{
	"Bundles": {
		"Bundle": [
			{
				"-id": "Squash Flat",
				"-title": "Squash Flat",
				"-groups": "Combat",
				"-description": "You can bull rush an opponent straight to the ground.",
				"Prerequisites": "Improved Bull Rush, Merciless Rush, worshiper of the associated deity.",
				"Benefit": [
					"Whenever you make a bull rush attack and your combat maneuver check exceeds the target's CMD by 5 or more, you can attempt to trip the target as part of your bull rush as a free action. This does not provoke an attack of opportunity.",
					"Combat Trick",
					"Source PPC:WMH",
					"Note If using the optional Stamina Pool rules, the following trick may be used with this feat.",
					"Combat Trick: After succeeding at a bull rush combat maneuver check, you can spend 4 stamina points to attempt to trip the target with Squash Flat regardless of your bull rush combat maneuver check's result."
				]
			},
			{
				"-id": "Squire",
				"-title": "Squire",
				"-description": "You attract a squire to aid you in your knightly endeavors.",
				"Prerequisites": "Character level 3rd, proficient with all martial weapons.",
				"Benefit": [
					"This feat acts similarly to the Leadership feat, with several exceptions. You can only attract a 1st-level cohort (referred to hereafter as a squire) with this feat, and cannot recruit followers until you have the Leadership feat. You determine your Leadership score according to the rules presented in the Leadership feat, but your squire is always at least three or more levels lower than yourself.",
					"A squire can only take levels in a class that grants proficiency with all martial weapons as a class feature, such as paladin, gunslinger, cavalier, or fighter. She cannot multiclass, though she may take any archetype she qualifies for.",
					"If a squire gains enough XP to bring her to two levels lower than your level, the squire does not gain the new level until you gain your next level—until then her new XP total is 1 less than the amount needed to attain the next level and she gains no additional XP until you advance.",
					"If you release your squire from service, you may gain a new one by scouting for potential candidates in a city or large town where members of your knightly order can typically be found, which requires at least 24 hours of uninterrupted scouting. This act can also replace a squire who has perished.",
					"Graduation: When you reach 7th level, this feat automatically upgrades to the Leadership feat (meaning that you effectively lose this feat and replace it with Leadership).",
					"Graduation Benefits: You gain all the normal benefits of the Leadership feat, except that your squire must remain at least three levels lower than you and must continue to take levels in her first class. In order for your squire to be able to be two levels lower than you, your squire must be at least 4th level, and you must witness her as she singlehandedly defeats a creature with Hit Dice equal to or greater than her own. Upon the creature's defeat, your squire graduates to full knighthood and acts as a normal cohort; she may begin taking levels in other classes if she so chooses, and she may increase in level to up to two levels lower than yourself."
				]
			},
			{
				"-id": "Squirming Pile Combat Teamwork",
				"-title": "Squirming Pile Combat Teamwork",
				"-description": "Your body is easily lost in the muddy chaos of fighting as a swarm, making your vital areas difficult to target.",
				"Prerequisites": "Acrobatics 5 ranks, swarming racial trait.",
				"Benefit": [ "While sharing a square with an ally who has this feat, you gain a 25% chance of negating the additional damage from a successful critical hit or sneak attack; if you negate the damage, it is instead rolled normally. This negation chance doesn't stack with similar protection provided by any other source, such as the fortification armor special ability." ]
			},
			{
				"-id": "Stabbing Shot",
				"-title": "Stabbing Shot",
				"-groups": "Combat",
				"-description": "You can clear the way to continue using your bow.",
				"Prerequisites": "Rapid Shot, elf.",
				"Benefit": [ "When adjacent to an opponent and making a full-attack action with a longbow or shortbow (including composite bows), you may choose to make a melee attack against that opponent with a drawn arrow rather than firing it. If the attack hits—whether or not it does damage—your target is pushed back 5 feet away from you. You can then fire arrows from your bow normally, at the original target, or at another target within range. This melee attack replaces the extra attack from Rapid Shot, and all of your attack rolls for the round (the melee attack and the ranged attacks) take a -2 penalty. If your initial attack leaves you with no enemies threatening you, you can make the subsequent ranged attack or attacks without provoking attacks of opportunity." ]
			},
			{
				"-id": "Stable Gallop",
				"-title": "Stable Gallop",
				"-groups": "Animal Companion Feat",
				"-description": "You run with a smooth and steady gait.",
				"Prerequisites": "Animal or magical beast.",
				"Benefit": [ "Your AC penalty when charging is halved. The penalties on ranged attacks made by your rider are reduced by 1 when you take a double move and by 2 when you run (minimum penalty of 0). Your rider gains a +4 bonus on concentration checks caused by your motion." ]
			},
			{
				"-id": "Stage Combatant",
				"-title": "Stage Combatant",
				"-groups": "Combat",
				"-description": "You are a master of stage and nonlethal combats",
				"Prerequisites": "Weapon Focus, base attack bonus +5",
				"Benefit": [ "When you make an attack with a weapon that you have Weapon Focus in, you take no penalty on the attack roll when you are attempting to make an attack that deals no damage or nonlethal damage." ],
				"Normal": [ "When making attacks that deal no damage or nonlethal damage, you take a -4 penalty on attack rolls." ]
			},
			{
				"-id": "Staggering Blow",
				"-title": "Staggering Blow",
				"-groups": "Combat",
				"-description": "You know just where to strike to temporarily stagger a foe.",
				"Prerequisites": "Str 13, Power Attack, Vital Strike, base attack bonus +8.",
				"Benefit": [ "When you attack a foe using Vital Strike, you can choose to take a -2 penalty on your attack roll to also make the attack a staggering strike. You must make this choice before making the attack roll. If your attack roll is successful, your target must succeed at a Fortitude saving throw (DC = 10 + 1/2 your character level + your Strength modifier) or be staggered until the start of your next turn. Once a creature that failed its save recovers from the effects of your staggering blow, it is immune to the effects of this feat for 24 hours. Constructs, oozes, plants, undead, incorporeal creatures, and creatures that are immune to critical hits are immune to this effect." ]
			},
			{
				"-id": "Staggering Critical",
				"-title": "Staggering Critical",
				"-groups": "Combat",
				"-description": "Your critical hits cause opponents to slow down.",
				"Prerequisites": "Critical Focus, base attack bonus +13.",
				"Benefit": [ "Whenever you score a critical hit, your opponent becomes staggered for 1d4+1 rounds. A successful Fortitude save reduces the duration to 1 round. The DC of this Fortitude save is equal to 10 + your base attack bonus. The effects of this feat do not stack. Additional hits instead add to the duration." ],
				"Special": [ "You can only apply the effects of one critical feat to a given critical hit unless you possess Critical Mastery." ]
			},
			{
				"-id": "Staggering Fist",
				"-title": "Staggering Fist",
				"-groups": "Combat",
				"-description": "When you engage in unarmed combat, you know just where to strike to stagger your foe.",
				"Prerequisites": "Dex 13, Wis 13, Improved Unarmed Strike, base attack bonus +2.",
				"Benefit": [ "When you damage a foe with your unarmed attack, you can also cause it to be staggered for 1 round (until just before your next turn). The target can avoid this with a successful Fortitude saving throw (DC = 10 + 1/2 your character level + your Wisdom modifier). You must declare that you are using this feat before you make your attack roll; thus, a failed attack roll ruins the attempt. You can attempt to use this feat once per day for every 4 character levels you have, but no more than once per round. Constructs, incorporeal creatures, plants, undead, and creatures that are immune to critical hits cannot be affected by this ability." ]
			},
			{
				"-id": "Stalker's Focus",
				"-title": "Stalker's Focus",
				"-description": "Your affinity to the natural world allows you to adopt the focus of a single animal.",
				"Prerequisites": "Knowledge (nature) 3 ranks, Survival 3 ranks, no levels in a class that has the animal focus class feature.",
				"Benefit": [ "Choose a single type of animal to emulate from the hunter's animal focus class feature. Once per day, you or your animal companion (if you have one) can gain the benefit of that animal focus for 1 minute. Treat your character level as your hunter level for the purpose of determining the benefits granted by your chosen animal focus." ],
				"Special": [ "If you gain levels in a class that has the animal focus class feature, when you gain that feature you gain 1 additional minute of use each day of your animal focus class feature." ]
			},
			{
				"-id": "Stalwart",
				"-title": "Stalwart",
				"-description": "You adopt a defensive stance that allows you to absorb and redirect hits.",
				"Prerequisites": "Diehard, Endurance, base attack bonus +4.",
				"Benefit": [ "While using the total defense action, fighting defensively action, or Combat Expertise, you can forgo the dodge bonus to AC you would normally gain to instead gain an equivalent amount of DR, to a maximum of DR 5/—, until the start of your next turn. This damage reduction stacks with DR you gain from class features, such as the barbarian's, but not with DR from any other source. If you are denied your Dexterity bonus to AC, you are also denied this DR." ]
			},
			{
				"-id": "Stance of the Xorn",
				"-title": "Stance of the Xorn",
				"-groups": "Combat",
				"-description": "You have heightened awareness of enemies on all sides.",
				"Prerequisites": "Wisdom 15, base attack bonus +3.",
				"Benefit": [ "Flanking creatures do not gain a +2 bonus to attack you (this does not prevent you from being sneak attacked or denied yourDexterity bonus). A condition that makes you lose your Dex bonus to AC also makes you lose the benefits of this feat." ],
				"Normal": [ "Flanking opponents gain a +2 flanking bonus to hit." ]
			},
			{
				"-id": "Stand Still",
				"-title": "Stand Still",
				"-groups": "Combat",
				"-description": "You can stop foes that try to move past you.",
				"Prerequisites": "Combat Reflexes.",
				"Benefit": [ "When a foe provokes an attack of opportunity due to moving through your adjacent squares, you can make a combat maneuver check as your attack of opportunity. If successful, the enemy cannot move for the rest of his turn. An enemy can still take the rest of his action, but cannot move. This feat also applies to any creature that attempts to move from a square that is adjacent to you if such movement provokes an attack of opportunity." ]
			},
			{
				"-id": "Starlight Summons",
				"-title": "Starlight Summons",
				"-description": "Your summoned minions slink along under the shadows of the stars.",
				"Prerequisites": "Spell Focus (conjuration), able to cast summon nature's ally.",
				"Benefit": [ "Creatures you summon gain the Blind-Fight feat, a +5 bonus to Perception and Stealth checks in dim light or darkness, and their natural weapons are treated as cold iron for overcoming damage reduction." ]
			},
			{
				"-id": "Starry Grace",
				"-title": "Starry Grace",
				"-groups": "Combat",
				"-description": "Your quick and free starknife motions allow you to make deadly dexterous attacks.",
				"Prerequisites": "Dex 13, Weapon Finesse, Weapon Focus (starknife).",
				"Benefit": [
					"When wielding a starknife, you can add your Dexterity modifier instead of your Strength modifier to that weapon's damage. The starknife must be one appropriate for your size. You do not gain this benefit while fighting with two weapons or using flurry of blows, or any time another hand is otherwise occupied.",
					"In addition, if you have the panache class feature, as long as you have at least 1 panache point, you gain a +5 bonus to your movement speed on your move action after taking an attack action with a starknife or on your Spring Attack or charge with a starknife."
				]
			},
			{
				"-id": "Startling Getaway",
				"-title": "Startling Getaway",
				"-groups": "Combat",
				"-description": "You strike with surprise and then run circles around your foe.",
				"Prerequisites": "Startling appearance class feature.",
				"Benefit": [ "During a surprise round, after taking an attack action to attack a creature unaware of your presence, you can take a move action to move. If you are already capable of taking both a standard and a move action in the surprise round, this feat does not grant you any additional actions." ],
				"Normal": [ "You can take only a single standard or move action during a surprise round." ]
			},
			{
				"-id": "Startoss Comet",
				"-title": "Startoss Comet",
				"-groups": "Combat",
				"-description": "You can aim a thrown weapon so it strikes two foes.",
				"Prerequisites": "Dex 13, Point-Blank Shot, Startoss Style, Weapon Focus with the chosen weapon.",
				"Benefit": [
					"As a standard action, you can make a single ranged thrown weapon attack at your full attack bonus with the chosen weapon. If you hit, you deal damage normally and can make a second attack (at your full attack bonus) against a target within one range increment of the first. You determine cover for this attack from the first target's space instead of your space.",
					"You can make only one additional attack per round with this feat. If you have Vital Strike, Improved Vital Strike, or Greater Vital Strike, you can add the additional damage from those feats to the initial ranged attack (but not the second attack)."
				]
			},
			{
				"-id": "Startoss Shower",
				"-title": "Startoss Shower",
				"-groups": "Combat",
				"-description": "You can strike multiple opponents with thrown weapons.",
				"Prerequisites": "Dex 13, Point-Blank Shot, Startoss Comet, Startoss Style, Weapon Focus with the chosen weapon, base attack bonus +4.",
				"Benefit": [
					"When you hit an opponent while using the Startoss Comet feat, you can continue to make attacks against foes that are within one range increment of all previous opponents. You determine cover for each attack from the most recently hit foe's space instead of your space, and you cannot attack an individual foe more than once during this attack action.",
					"You can make a maximum number of attacks equal to 1 + 1 per 5 points of base attack bonus you possess. If you have Vital Strike, Improved Vital Strike, or Greater Vital Strike, you can add the additional damage from those feats to the initial ranged attack (but not any subsequent attacks)."
				]
			},
			{
				"-id": "Startoss Style",
				"-title": "Startoss Style",
				"-groups": "Combat,Style",
				"-description": "Your thrown weapons become more deadly.",
				"Prerequisites": "Dex 13, Point-Blank Shot, Weapon Focus with the chosen weapon.",
				"Benefit": [
					"Choose one weapon from the thrown fighter weapon group. While using this style and the chosen weapon, you gain a bonus on damage rolls made with the weapon equal to 2 + 2 per style feat you possess that lists Startoss Style as a prerequisite (maximum +6 damage).",
					"You cannot use this ability if you are carrying a weapon or a shield in your off hand (except for a buckler)."
				],
				"Special": [ "In addition to the chosen weapon, a character with this feat and the weapon training (thrown) class feature can use Startoss Style with any thrown weapons that she wields in one hand." ]
			},
			{
				"-id": "Steadfast Personality",
				"-title": "Steadfast Personality",
				"-description": "You rely on your assuredness and sense of self to help keep your mind clear.",
				"Benefit": [ "Add your Charisma modifier instead of your Wisdom bonus on Will saves against mind-affecting effects. If you have a Wisdom penalty, you must apply both your Wisdom penalty and your Charisma modifier." ]
			},
			{
				"-id": "Steadfast Slayer",
				"-title": "Steadfast Slayer",
				"-groups": "Combat",
				"-description": "You stand alone against creatures far larger than you.",
				"Benefit": [ "If you are the only character threatening an opponent and you successfully attack the opponent with a two-handed melee weapon, for each size category larger than you that opponent is, you gain a +2 bonus on your melee damage roll." ]
			},
			{
				"-id": "Steady Engagement",
				"-title": "Steady Engagement",
				"-groups": "Combat",
				"-description": "You can draw on your excellent balance to trip or disarm opponents when they try to disengage.",
				"Prerequisites": "Combat Reflexes, Stand Still, worshiper of the associated deity.",
				"Benefit": [
					"If you use Stand Still to prevent an opponent from moving, you may make a disarm or trip combat maneuver against your target as an immediate action.",
					"Combat Trick",
					"Note If using the optional Stamina Pool rules, the following trick may be used with this feat.",
					"Combat Trick: You can spend up to 4 stamina points to gain a +1 bonus per stamina point spent on any combat maneuver check that you attempt as part of Steady Engagement."
				]
			},
			{
				"-id": "Stealthy",
				"-title": "Stealthy",
				"-description": "You are good at avoiding unwanted attention and slipping out of bonds.",
				"Benefit": [ "You get a +2 bonus on all Escape Artist and Stealth skill checks. If you have 10 or more ranks in one of these skills, the bonus increases to +4 for that skill." ]
			},
			{
				"-id": "Steam Caster",
				"-title": "Steam Caster",
				"-groups": "Undine",
				"-description": "You imbue your fire spells with elemental water, transforming them into powerful gouts of steam.",
				"Prerequisites": "Undine.",
				"Benefit": [ "You may increase the casting time of a fire spell to a full-round action, infusing it with elemental power (spells with a casting time of 1 full-round action or longer do not have an increased casting time). The spell is treated as if it had the water descriptor. All fire effects of the altered spell instead manifest as superheated steam. The altered spell works normally underwater without requiring a caster level check. Unlike fire, the steam cannot ignite objects or set creatures on fire. As the spell still deals fire damage, fire resistance or immunity still applies to the spell's effects." ]
			},
			{
				"-id": "Steam Spell",
				"-title": "Steam Spell",
				"-groups": "Metamagic",
				"-description": "You've built off of some of the closely-guarded secrets of the undine steamcasters, allowing you to use fire magic underwater easily.",
				"Benefit": [ "You can apply Steam Spell only to a spell with the fire descriptor. A steam spell works underwater without a caster level check, but it requires a caster level check to function above water. A steam spell uses up a slot the same spell level as the spell's actual level." ]
			},
			{
				"-id": "Steel Soul",
				"-title": "Steel Soul",
				"-description": "You are especially resistant to magic.",
				"Prerequisites": "Dwarf, hardy racial trait.",
				"Benefit": [ "You receive a +4 racial bonus on saving throws against spells and spell-like abilities. This replaces the normal bonus from the dwarf's hardy racial trait." ],
				"Normal": [ "Dwarves normally receive a +2 racial bonus on saving throws against spells and spell-like abilities." ]
			},
			{
				"-id": "Step Up",
				"-title": "Step Up",
				"-groups": "Combat",
				"-description": "You can close the distance when a foe tries to move away.",
				"Prerequisites": "Base attack bonus +1.",
				"Benefit": [ "Whenever an adjacent foe attempts to take a 5-foot step away from you, you may also make a 5-foot step as an immediate action so long as you end up adjacent to the foe that triggered this ability. If you take this step, you cannot take a 5-foot step during your next turn. If you take an action to move during your next turn, subtract 5 feet from your total movement." ]
			},
			{
				"-id": "Step Up and Strike",
				"-title": "Step Up and Strike",
				"-groups": "Combat",
				"-description": "When a foe tries to move away, you can follow and make an attack.",
				"Prerequisites": "Dex 13, Following Step, Step Up, base attack bonus +6.",
				"Benefit": [ "When using the Step Up or Following Step feats to follow an adjacent foe, you may also make a single melee attack against that foe at your highest base attack bonus. This attack counts as one of your attacks of opportunity for the round. Using this feat does not count toward the number of actions you can usually take each round." ],
				"Normal": [ "You can usually only take one standard action and one 5-foot step each round." ]
			},
			{
				"-id": "Stick Together",
				"-title": "Stick Together",
				"-groups": "Combat,Teamwork",
				"-description": "You stick close to your allies in combat.",
				"Benefit": [ "When an adjacent ally with this feat moves, you can move up to your speed as an immediate action, as long as your movement ends adjacent to that ally. If you do so, you are staggered on your next turn. This movement provokes attacks of opportunity as normal." ]
			},
			{
				"-id": "Stick-Fighting Counter",
				"-title": "Stick-Fighting Counter",
				"-groups": "Combat",
				"-description": "Using stick-fighting techniques both defensively and offensively, you can turn your parries into counterattacks.",
				"Prerequisites": "Stick-Fighting Style, base attack bonus +4.",
				"Benefit": [ "While you are fighting defensively, as a free action you can select an opponent you have attacked on that turn and prepare yourself to counter one of its attacks. Once per round, when that opponent attempts a melee attack against you and the attack misses, the attacker provokes an attack of opportunity from you, provided that it is within your threatened area. You must use a club, quarterstaff, dan bong, sap, or tonfa to perform the attack of opportunity." ]
			},
			{
				"-id": "Stick-Fighting Maneuver",
				"-title": "Stick-Fighting Maneuver",
				"-groups": "Combat",
				"-description": "Your attacks with sticks have become blindingly fast, and you can throw in a combat maneuver between your attacks.",
				"Prerequisites": "Stick-Fighting Counter, Stick-Fighting Style, base attack bonus +6.",
				"Benefit": [ "When making a full attack using only clubs, a quarterstaff, dan bongs, saps, or tonfas, you can perform a combat maneuver as an extra attack using your full base attack bonus." ]
			},
			{
				"-id": "Stick-Fighting Style",
				"-title": "Stick-Fighting Style",
				"-groups": "Combat,Style",
				"-description": "You know how to use batons, clubs, and sticks in new ways.",
				"Prerequisites": "Base attack bonus +1.",
				"Benefit": [ "When fighting with a club, quarterstaff, dan bong, sap, or tonfa with which you are proficient, you gain a +1 enhancement bonus on attack rolls as though it were a masterwork weapon. If the weapon actually is a masterwork weapon, it instead counts as having the blocking, disarm, distracting, performance, and trip special weapon qualities, even if the weapon normally doesn't have them." ]
			},
			{
				"-id": "Still Spell",
				"-title": "Still Spell",
				"-groups": "Metamagic",
				"-description": "You can cast spells without moving.",
				"Benefit": [
					"A stilled spell can be cast with no somatic components. Spells without somatic components are not affected.",
					"Level Increase: +1 (a stilled spell uses up a spell slot one level higher than the spell's actual level.)"
				]
			},
			{
				"-id": "Stock-Striker Style",
				"-title": "Stock-Striker Style",
				"-groups": "Combat,Style",
				"-description": "Your fighting technique makes you equally deadly with your firearm's stock as with its bullets.",
				"Prerequisites": "Pistol-whip gunslinger deed.",
				"Benefit": [ "When you perform the pistol-whip deed while using this style, you gain a +1 bonus on the attack roll and on the combat maneuver check to knock the target prone; this increases to +2 when you use a two-handed firearm. If you successfully knock the target prone, you do not provoke attacks of opportunity from the target until the end of your next turn when you make ranged attacks with your firearm. You can treat one-handed firearms as light weapons for the purpose of abilities such as Weapon Finesse when performing the pistol-whip deed." ]
			},
			{
				"-id": "Stock-Striker Sweep",
				"-title": "Stock-Striker Sweep",
				"-groups": "Combat",
				"-description": "The force of your firearm strikes can drive back your foe or damage a second target.",
				"Prerequisites": "Stock-Striker Style, base attack bonus +7, pistol-whip gunslinger deed.",
				"Benefit": [ "When you are using Stock-Striker Style and successfully knock a target prone with the pistol-whip deed, as a swift action you can either push the target 5 feet away from you or perform the pistol-whip deed a second time against a foe that is adjacent to the first and within your reach. This second use of pistol-whip costs 0 grit points." ]
			},
			{
				"-id": "Stock-Striker Takedown",
				"-title": "Stock-Striker Takedown",
				"-groups": "Combat",
				"-description": "Your melee strike leaves your target vulnerable to a merciless finishing shot.",
				"Prerequisites": "Point-Blank Shot, Stock-Striker Style, Stock-Striker Sweep, base attack bonus +9, pistol-whip gunslinger deed.",
				"Benefit": [ "After you knock a target prone with the pistol-whip deed while using Stock-Striker Style, you can fire one barrel of a loaded firearm you're wielding at the target as a move action; if your firearm has the scatter weapon quality, you can instead make a scattering shot so long as you include the target in the area of effect. For this attack, you take no attack penalty for making a ranged attack against a prone target, and the critical multiplier of your weapon increases by 1 (to a maximum of ×5)." ]
			},
			{
				"-id": "Stoic",
				"-title": "Stoic",
				"-description": "You know from firsthand experience that life is a series of unforgiving trials, and that fear itself is something that can be conquered.",
				"Prerequisites": "Iron Will.",
				"Benefit": [ "You gain a +1 bonus on all saving throws against fear effects. If you successfully save against any fear effect, you are immune to further fear effects from that source for 24 hours." ]
			},
			{
				"-id": "Stoic Pose",
				"-title": "Stoic Pose",
				"-groups": "Svirfneblin",
				"Prerequisites": "Svirfneblin.",
				"Benefit": [ "By spending 5 rounds finding a suitable location, you can hold yourself so still that you appear to be a Small object such as a pile of rocks. This allows you to make a Stealth check without cover or concealment, as long as you do not move or take any other actions." ]
			},
			{
				"-id": "Stone Read",
				"-title": "Stone Read",
				"-description": "Faint vibrations in stone can alert you to trouble.",
				"Prerequisites": "Knowledge (dungeoneering) 4 ranks",
				"Benefit": [ "You gain a +3 bonus on Perception checks in underground or mountainous environments. If you have 10 or more ranks in Knowledge (dungeoneering), this bonus increases to + 6." ]
			},
			{
				"-id": "Stone Sense",
				"-title": "Stone Sense",
				"-description": "You can feel movement in the very earth and stones around you.",
				"Prerequisites": "Improved Stonecunning, Perception 10 ranks.",
				"Benefit": [ "You gain tremorsense to a range of 10 feet." ]
			},
			{
				"-id": "Stone Singer",
				"-title": "Stone Singer",
				"-description": "Your songs are in accordance with the ways and lands of your people.",
				"Prerequisites": "Cha 13, bardic performance class feature, dwarf.",
				"Benefit": [ "When you use bardic performance with audible components underground, the range or area of your chosen performance is doubled, and you can affect deaf creatures if they possess tremorsense and are in your new range. In addition, the DC for saving throws against your bardic performance is increased by +2 for creatures of the earth subtype, regardless of where the performance occurs." ]
			},
			{
				"-id": "Stone-Faced",
				"-title": "Stone-Faced",
				"-description": "Rocks show more expression than you.",
				"Prerequisites": "Dwarf.",
				"Benefit": [ "You receive a +4 bonus on Bluff checks to lie or conceal your feelings or true motives, but not to feint in combat or deliver secret messages. In addition, the DC for Sense Motive checks to get a hunch about you is 25 rather than 20." ]
			},
			{
				"-id": "Stone-Handed",
				"-title": "Stone-Handed",
				"-groups": "Combat",
				"-description": "Drawing upon techniques to combat animated creatures, you bring a strike like an avalanche of stone.",
				"Prerequisites": "Str 13, Stunning Fist.",
				"Benefit": [ "Before making a melee attack with an unarmed strike, you can expend one use of Stunning Fist to declare a stone-handed strike. Resolve the attack normally, except your attack ignores an amount of the target's hardness equal to your monk level or one-quarter your base attack bonus (minimum 1), whichever is higher. This effect replaces other effects or conditions that would be caused by your Stunning Fist." ]
			},
			{
				"-id": "Stony Rampart",
				"-title": "Stony Rampart",
				"-groups": "Combat, Conduit",
				"-description": "Stone rises up at your command, offering cover to allies.",
				"Prerequisites": "Knowledge (planes) 3 ranks.",
				"Benefit": [
					"As a standard action, you can call forth a low wall of unworked stone along any side of a square within 30 feet.",
					"This wall is 5 feet long, 3 feet high, 2 inches thick, and acts as a low obstacle, except that it provides only partial cover. A single 5-foot section of stone created by this feat has hardness 8 and 30 hp. You can only have one such wall in existence at a time for every 5 ranks in Knowledge (planes) you have (minimum 1); walls last for a number of rounds equal to your ranks in Knowledge (planes) before crumbling to dust. If you have 10 or more ranks in Knowledge (planes), you can create multiple walls as a single standard action by expending an equivalent number of uses of this ability.",
					"You can use this feat's benefit a number of times per day equal to your ranks in Knowledge (planes)."
				]
			},
			{
				"-id": "Stony Step",
				"-title": "Stony Step",
				"-groups": "Oread",
				"-description": "...",
				"Prerequisites": "Oread.",
				"Benefit": [
					"Whenever you move, you may move through 5 feet of earth- or stone-based difficult terrain (rubble, stone stairs, and so on) each round as if it were normal terrain.",
					"The effects of this feat stack with similar feats such as Acrobatic Steps and Nimble Moves. This feat allows you to take a 5-foot step into this kind of difficult terrain."
				]
			},
			{
				"-id": "Storm Survivor",
				"-title": "Storm Survivor",
				"-description": "You know how to survive and thrive in even the stormiest of weathers.",
				"Prerequisites": "Knowledge (nature) 2 ranks, Survival 2 ranks.",
				"Benefit": [ "When you are in a storm of any type, you gain a +2 circumstance bonus on Perception checks, Survival checks, and saving throws regarding adverse effects from the storm itself. If you have 10 or more ranks in one of these skills, this bonus increases to +4." ]
			},
			{
				"-id": "Storm of Arrows",
				"-title": "Storm of Arrows",
				"-groups": "Combat",
				"-description": "You can rain arrows upon a greater number of foes.",
				"Prerequisites": "Hail of arrows class feature.",
				"Benefit": [ "When using hail of arrows, you can target up to two targets for every arcane archer level you have." ]
			},
			{
				"-id": "Storm of Blades",
				"-title": "Storm of Blades",
				"-groups": "Combat",
				"-description": "Your technique unleashes a dizzying torrent of cuts.",
				"Prerequisites": "Weapon Focus with slashing weapon, base attack bonus +6.",
				"Benefit": [
					"As a standard action, you can make a single attack with your chosen weapon while setting up a vortex of cuts that lasts until the beginning of your next turn. Any creature that begins its turn threatened by this weapon takes damage equal to your Strength or Dexterity bonus, whichever is greater.",
					"When your base attack bonus reaches +11, you also add your base weapon damage. When your base attack bonus reaches +16, you gain the distraction universal monster rule for this damage, but a creature that fails its save is only sickened. You can use this feat's benefits only once per minute."
				]
			},
			{
				"-id": "Storm-Lashed",
				"-title": "Storm-Lashed",
				"-description": "A life spent enduring gales and storms has hardened your body to the elements.",
				"Benefit": [ "You can ignore many of the effects of severe weather. In rainy conditions, your visibility is reduced by only one-quarter (not by half ) and you take only a -2 penalty on Perception checks. You are treated as if you were one size category larger for the purpose of wind effects, and halve any penalty on Perception checks caused by high winds. Finally, you gain a +2 bonus on saving throws against effects with the electricity descriptor or that deal electricity damage." ]
			},
			{
				"-id": "Stouthearted",
				"-title": "Stouthearted",
				"-description": "You fight back your fear by voicing the song in your heart.",
				"Prerequisites": "Raging song class feature.",
				"Benefit": [ "While you are maintaining a raging song, if you fail a saving throw against a fear effect, you can expend a round of performing to reroll your saving throw as an immediate action. You must keep this second result, even if it lower." ]
			},
			{
				"-id": "Strangler",
				"-title": "Strangler",
				"-groups": "Combat",
				"-description": "Throttling the life out of enemies is second nature to you.",
				"Prerequisites": "Dex 13, sneak attack +1d6, Improved Grapple, Improved Unarmed Strike.",
				"Benefit": [ "Whenever you successfully maintain a grapple and choose to deal damage, you can spend a swift action to deal your sneak attack damage to the creature you are grappling." ]
			},
			{
				"-id": "Street Carnage",
				"-title": "Street Carnage",
				"-groups": "Combat",
				"-description": "For you, the urban environment becomes another brutal weapon you can use to shred flesh and break bones.",
				"Prerequisites": "Str 15, Improved Bull Rush, Improved Unarmed Strike, Power Attack, Street Style, Street Sweep, base attack bonus +8 or monk level 7th.",
				"Benefit": [ "While using Street Style, the critical multiplier of your unarmed strikes becomes ×3, instead of ×2." ]
			},
			{
				"-id": "Street Smarts",
				"-title": "Street Smarts",
				"-description": "You are able to navigate the streets and personalities of whatever locale you run across.",
				"Benefit": [ "You get a +2 bonus on Knowledge (local) and Sense Motive checks, and Knowledge (local) is always a class skill for you. If you have 10 or more ranks in one of these skills, the bonus increases to +4 for that skill. The bonus on Sense Motive checks doesn't stack with Alertness." ]
			},
			{
				"-id": "Street Style",
				"-title": "Street Style",
				"-groups": "Combat,Style",
				"-description": "You use the urban environment to your advantage, thrashing and bashing your foe and driving it back.",
				"Prerequisites": "Str 15, Improved Bull Rush, Improved Unarmed Strike, Power Attack, base attack bonus +4 or monk level 3rd.",
				"Benefit": [ "While using this style, once per round as a swift action when you hit a target with an unarmed strike, you can deal an extra 1d6 points of damage and attempt a bull rush combat maneuver against that target." ],
				"Special": [ "You can enter the style stance for street style only while in urban terrain, and the stance ends immediately if you cease to be in urban terrain." ]
			},
			{
				"-id": "Street Sweep",
				"-title": "Street Sweep",
				"-groups": "Combat",
				"-description": "After driving your foe back, you can quickly knock it to the ground and slow it down.",
				"Prerequisites": "Str 15, Improved Bull Rush, Improved Unarmed Strike, Power Attack, Street Style, base attack bonus +6 or monk level 5th.",
				"Benefit": [ "While using Street Style, the first time each round that you deal damage with an unarmed strike to a foe that you bull rushed with Street Style since the beginning of your last turn, that foe must succeed at a Fortitude save (DC = 10 + your base attack bonus) or be knocked prone and staggered for 1 round." ]
			},
			{
				"-id": "Strength in Defeat",
				"-title": "Strength in Defeat",
				"-groups": "Combat",
				"-description": "Half-drow tap into inner reserves, fighting even more fiercely when losing.",
				"Prerequisites": "Base attack bonus +1, half-drow.",
				"Benefit": [ "When reduced to half of your maximum hit points or fewer, you gain a +1 morale bonus on attack and damage rolls. This bonus increases to +2 at 8th level and to +3 at 15th level." ]
			},
			{
				"-id": "Stretched Wings",
				"-title": "Stretched Wings",
				"-groups": "Strix",
				"Prerequisites": "Str 13, Skill Focus (Fly), strix, wing-clipped racial trait.",
				"Benefit": [ "Your strix racial fly speed increases to 60 feet (average). You ignore the wing-clipped trait's Fly check requirement to fly upward." ]
			},
			{
				"-id": "Strike Back",
				"-title": "Strike Back",
				"-groups": "Combat",
				"-description": "You can strike at foes that attack you using their superior reach, by targeting their limbs or weapons as they come at you.",
				"Prerequisites": "Base attack bonus +11.",
				"Benefit": [ "You can ready an action to make a melee attack against any foe that attacks you in melee, even if the foe is outside of your reach." ]
			},
			{
				"-id": "Strike True",
				"-title": "Strike True",
				"-groups": "Combat",
				"-description": "Rather than attempting a series of wild blows, you line up a perfect attack.",
				"Prerequisites": "Combat Expertise, base attack bonus +6.",
				"Benefit": [ "You can focus yourself as a move action. When focused, you gain a +4 bonus on your next melee attack roll before the end of your turn." ]
			},
			{
				"-id": "Strike True Combat",
				"-title": "Strike True Combat",
				"-description": "Rather than attempting a series of wild blows, you line up a perfect attack.",
				"Prerequisites": "Combat Expertise, base attack bonus +6.",
				"Benefit": [ "You can focus yourself as a move action. When focused, you gain a +4 bonus on your next melee attack roll before the end of your turn." ]
			},
			{
				"-id": "Strong Comeback",
				"-title": "Strong Comeback",
				"-description": "You learn quickly from past mistakes.",
				"Benefit": [ "Whenever you are allowed to reroll an ability check, a skill check, or a saving throw, you gain a +2 circumstance bonus on the reroll" ]
			},
			{
				"-id": "Strong Implement Link",
				"-title": "Strong Implement Link",
				"-description": "Your connection to a particular implement allows you to draw on its power more efficiently even when it's not in your possession.",
				"Prerequisites": "Implements class feature.",
				"Benefit": [ "When you are within 30 feet of your implement, You don't need to attempt a concentration check to cast spells associated with that implement. When you are at a greater distance, the DC for the concentration check is equal to 15 + the spell's level." ],
				"Normal": [ "Anytime you attempt to cast a spell using an implement that's not in your possession, you must succeed at a concentration check with a DC equal to 20 + the spell's level in order to cast the spell." ],
				"Special": [ "You can take this feat multiple times. Its effects don't stack. Each time you take the feat, you gain the benefits for a different school of implements. If you have more than one implement of a single school, you can select that school multiple times and apply the benefits to another one of those implements each time you take this feat and select that school." ]
			},
			{
				"-id": "Structural Strike",
				"-title": "Structural Strike",
				"-groups": "Combat, Panache",
				"-description": "You use your knowledge of how things fit together to find ways to punch through the defenses of any foe.",
				"Prerequisites": "Knowledge (engineering) 5 ranks, precise strike class feature or precise strike deed.",
				"Benefit": [
					"When using the duelist's or swashbuckler's precise strike, you can make a single strike as a standard action against an opponent that would be otherwise immune to your precise strike damage. If you hit, you deal your precise strike damage as normal against this enemy. When using the swashbuckler's precise strike deed, you can spend 1 panache point as a swift action to deal your regular precise strike damage on a single attack against an opponent that would typically be immune. If you have both class features, you can use either option in order to apply the full damage from both versions of precise strike.",
					"Additionally, against opponents with a chance of immunity to your precise strike (such as an opponent wearing armor with the fortification special ability), this feat reduces their chance of negating your precise strikes by 10%."
				]
			},
			{
				"-id": "Stubborn Curse",
				"-title": "Stubborn Curse",
				"-description": "Your curses are particularly tenacious.",
				"Prerequisites": "Ability to cast a spell or spell-like ability with the curse descriptor, or a special ability with a curse effect.",
				"Benefit": [
					"Any curse effect you create is difficult to remove.",
					"When a creature makes a caster level check to remove the curse, it must roll twice and take the worse result."
				]
			},
			{
				"-id": "Studied Combatant",
				"-title": "Studied Combatant",
				"-description": "Your inspiration guides your strikes when you take a moment to assess your foe.",
				"Prerequisites": "Int 13, Amateur Investigator, base attack bonus +6, 1 rank in at least one Knowledge skill, no levels in a class that has the inspiration class feature.",
				"Benefit": [ "You can expend one use of inspiration as a move action to study a single enemy that you can see. When you do so, you gain a +2 insight bonus on melee attack rolls and a +2 bonus on damage rolls for a number of rounds equal to your Intelligence modifier. The bonus on damage rolls is precision damage, and is not multiplied on a critical hit. Once affected by this feat, a target cannot be affect by your use of it again for 24 hours." ]
			},
			{
				"-id": "Studied Spell",
				"-title": "Studied Spell",
				"-groups": "Metamagic",
				"-description": "You use your knowledge about the target to bypass its resistances and damage reduction.",
				"Benefit": [
					"When casting a studied spell, designate one target affected by the spell. Attempt an appropriate Knowledge check based on that target's creature type as you cast the spell. The DC for this check is equal to 20 + the creature's CR based on its race and not including any class levels or template (a creature that is defined by class levels has an effective CR of 0 for this ability). If you succeed, your studied spell ignores any energy resistance or damage reduction the target has because of its race as well as any bonuses on saving throws against the spell granted by the target's race (such as the bonus from a dwarf's hardy ability or a halfling's halfling luck ability). Your studied spell doesn't ignore energy resistance, damage reduction, or saving throw bonuses granted by other spells and effects. If you fail the Knowledge check, the spell still has its normal effects.",
					"Level Increase: +2 (a studied spell uses up a spell slot 2 levels higher than the spell's actual level.)"
				]
			},
			{
				"-id": "Stunning Assault",
				"-title": "Stunning Assault",
				"-groups": "Combat",
				"-description": "You powerful but imprecise attacks can stun your enemies.",
				"Prerequisites": "Str 13, Power Attack, base attack bonus +16.",
				"Benefit": [ "You can choose to take a -5 penalty on all melee attack rolls and combat maneuver checks to stun targets you hit with your melee attacks for 1 round. A successful Fortitude save negates the effect. The DC of this save is 10 + your base attack bonus. You must choose to use this feat before making the attack roll, and its effects last until your next turn." ]
			},
			{
				"-id": "Stunning Critical",
				"-title": "Stunning Critical",
				"-groups": "Combat",
				"-description": "Your critical hits cause opponents to become stunned.",
				"Prerequisites": "Critical Focus, Staggering Critical, base attack bonus +17.",
				"Benefit": [ "Whenever you score a critical hit, your opponent becomes stunned for 1d4 rounds. A successful Fortitude save reduces this to staggered for 1d4 rounds. The DC of this Fortitude save is equal to 10 + your base attack bonus. The effects of this feat do not stack. Additional hits instead add to the duration." ],
				"Special": [ "You can only apply the effects of one critical feat to a given critical hit unless you possess Critical Mastery." ]
			},
			{
				"-id": "Stunning Fist",
				"-title": "Stunning Fist",
				"-groups": "Combat",
				"-description": "You know just where to strike to temporarily stun a foe.",
				"Prerequisites": "Dex 13, Wis 13, Improved Unarmed Strike, base attack bonus +8.",
				"Benefit": [ "You must declare that you are using this feat before you make your attack roll (thus, a failed attack roll ruins the attempt). Stunning Fist forces a foe damaged by your unarmed attack to make a Fortitude saving throw (DC 10 + 1/2 your character level + your Wis modifier), in addition to dealing damage normally. A defender who fails this saving throw is stunned for 1 round (until just before your next turn). A stunned character drops everything held, can't take actions, loses any Dexterity bonus to AC, and takes a -2 penalty to AC. You may attempt a stunning attack once per day for every four levels you have attained (but see Special), and no more than once per round. Constructs, oozes, plants, undead, incorporeal creatures, and creatures immune to critical hits cannot be stunned." ],
				"Special": [ "A monk receives Stunning Fist as a bonus feat at 1st level, even if he does not meet the prerequisites. A monk may attempt a stunning attack a number of times per day equal to his monk level, plus one more time per day for every four levels he has in classes other than monk." ]
			},
			{
				"-id": "Stunning Fist Adept",
				"-title": "Stunning Fist Adept",
				"-groups": "Combat",
				"-description": "Your stunning fist strikes become even deadlier.",
				"Prerequisites": "Stunning Fist, base attack bonus +3.",
				"Benefit": [ "Add +1 to the saving throw DC against your Stunning Fist attacks. This bonus does not stack with feats that grant you bonuses to the DC for saving throws against your Stunning Fist attacks, such as Mantis Style." ]
			},
			{
				"-id": "Stunning Irruption",
				"-title": "Stunning Irruption",
				"-groups": "Combat",
				"-description": "When you smash your way into a room, you gain more than just the element of surprise.",
				"Prerequisites": "Str 15, Power Attack, base attack bonus +5.",
				"Benefit": [
					"Before starting combat, you can attempt to break through a door, window, or wall to enter a room.",
					"If you succeed, the violence of your arrival is so great that all characters within 20 feet of your entry point must succeed at a Fortitude saving throw (DC = 10 + your base attack bonus) or be stunned instead of acting in the surprise round (if there is one) plus 1 round thereafter. Characters who succeed at this save are instead shaken for 1d4 rounds."
				]
			},
			{
				"-id": "Stunning Pin",
				"-title": "Stunning Pin",
				"-groups": "Combat",
				"-description": "You can render a pinned foe temporarily incapacitated.",
				"Prerequisites": "Improved Grapple, Improved Unarmed Strike, Stunning Fist.",
				"Benefit": [ "Whenever you pin an opponent, you can spend a swift action to make a Stunning Fist attempt against that opponent." ]
			},
			{
				"-id": "Stupefying Strike",
				"-title": "Stupefying Strike",
				"-groups": "Combat",
				"-description": "Your batter your foes with such disorienting force that they can't exert their full abilities.",
				"Prerequisites": "Dex 13, Wis 13, Improved Unarmed Strike, base attack bonus +8.",
				"Benefit": [ "When using this feat, in addition to dealing damage normally, you force a foe damaged by your unarmed attack to attempt a Fortitude save (DC = 10 + half your character level + your Wisdom modifier). If it fails, it loses its skill ranks and activated feats, such as Power Attack or Stunning Fist, for 1d4 rounds. You must declare you are using this feat before you make your attack roll; if you miss, the target is unaffected and your attempt is wasted. You can try to use Stupefying Strike once per day for every 4 character levels you have, but no more than once per round. Constructs, incorporeal creatures, mindless creatures, plants, undead, and creatures immune to critical hits can't be affected by this ability." ]
			},
			{
				"-id": "Stygian Spell",
				"-title": "Stygian Spell",
				"-groups": "Metamagic",
				"-description": "Stygian spells forsake pure water for the memory-destroying tides of the River Styx.",
				"Benefit": [
					"You can enhance any spell with the water descriptor that targets at least one creature to become a Stygian spell. Any creature successfully hit by a Stygian spell (if the spell requires an attack roll) or that fails its saving throw against a Stygian spell must succeed at a Will save (using the save DC of the original spell) or suffer the fugue lesser madness in addition to the spell's normal effects. If the attack is a confirmed critical hit or the original saving throw result is a natural 1, the creature must instead succeed at a Will save (again using the same DC) or suffer the amnesia greater madness (Horror Adventures 186). Madness gained this way lasts indefinitely, but can be treated using the normal methods for curing madness. This is a mind-affecting effect, and creatures native to the River Styx are immune to it.",
					"A spell modified by this feat gains the evil descriptor. A Stygian spell uses a spell slot 2 levels higher than the spell's normal spell level. Spells with the good descriptor can't be Stygian spells."
				]
			},
			{
				"-id": "Stylized Spell",
				"-title": "Stylized Spell",
				"-groups": "Metamagic",
				"-description": "You cast a spell in a distinctive manner.",
				"Prerequisites": "Bluff 5 ranks, Spellcraft 5 ranks.",
				"Benefit": [
					"A stylized spell has slightly different verbal and somatic components than normal, and the spell effect appears noticeably different. The Spellcraft DC to identify a stylized spell as it is being cast is 10 higher than normal.",
					"The Knowledge (arcana) DC to identify a stylized spell, its effects, or the materials it creates is 10 higher than normal, as is the DC to recognize your magical signature with greater detect magic.When you apply this feat to a spell, you can attempt to disguise your stylized spell as another spell of the same school and subschool with the same descriptors. The other spell must be either the same spell level as the stylized spell (before applying the metamagic adjustment) or 1 spell level higher. If you do so, the stylized spell gains the ruse descriptor and takes on some superficial aspects of the other spell. As usual for a spell with the ruse descriptor, identification attempts that fail by 10 or less mistakenly identify it as the chosen spell (those that fail by more can't identify it at all).Level Increase: +1 (a stylized spell uses up a spell slot 1 level higher than the spell's actual level.)*Special: When you cast a spell modified by this feat, you can reduce the DC of the Spellcraft or Knowledge (arcana) check to identify the spell by 5 to disguise the spell in one of the following ways.Apparent Descriptor: A stylized spell can appear to have a descriptor it lacks or appear to lack a descriptor it truly has. Changing an apparent energy descriptor changes the superficial manifestation of the energy in the spell effect but does not change the type of damage the spell deals. If the energy damages any creatures or objects, an observer who succeeds at a DC 15 Knowledge (arcana) or Perception check as a move action can identify the actual type of damage dealt based on sensory clues.Apparent School: A stylized spell can appear to be of a different school or subschool when studied with detect magic.Apparent Source of Magic: A stylized spell can appear to be a different type of magic—arcane, divine, or psychic. The effect is convincing only if the spellcaster provides any necessary components (such as a divine focus when imitating divine spells), and the caster must have a number of ranks in the skill associated with that type of magic equal to the spell's level. Knowledge (arcana) and Perform are associated with arcane magic, Knowledge (nature and religion) are associated with divine magic, and Bluff and Knowledge (arcana) are associated with psychic magic. A spellcaster can disguise his spell as psychic magic only if he can hide or remove the spell's verbal and somatic components (if any), such as with Conceal Spell, Secret Signs, Silent Spell, or Still Spell.Direction of Spell's Effect: A stylized spell effect that visibly originates from the caster (such as a ray, magic missile, or fireball bead) can instead appear to originate from another point within 30 feet of the caster. There must be clear lines of effect between each of the caster, the new origin point, and the destination. If the spell effect instead fills an area that originates from the caster (such as a line or cone), the effect can instead appear to originate from any point in that area. The new point of origin is entirely cosmetic, and it does not allow the spellcaster to ignore cover or other barriers. In addition, the deception can't make it appear that another creature cast the spell.Imitate a Dissimilar Spell: If a stylized spell appears to be of the same school and same source of magic, and to have the same descriptors as another spell because of other stylized spell modifications or changes from other sources (such as a class ability), the stylized spell can take on the superficial visual and auditory properties of the other spell.Suppress Audible or Visible Effects: A stylized spell's effects can be suppressed to the point where they are difficult to spot or hear. Such a spell's audible and visual effects are largely transparent, quieter, smaller, or otherwise less obtrusive. A creature notices the suppressed effects only if it succeeds at a Perception check (DC = 10 + your number of ranks in Bluff or Spellcraft + the highest of your Intelligence, Wisdom or Charisma modifiers). If, at the GM's discretion, a spell's effects are intrinsically bound to its visual or auditory signature (such as sunburst, sound burst, and most spells with the language-dependent, light, or sonic descriptors), reduce the DC of the Perception by 10.Source PPC:ISI"
				]
			},
			{
				"-id": "Subconscious Usurpation",
				"-title": "Subconscious Usurpation",
				"-description": "You have trained your subconscious to overpower your conscious mind under dire circumstances.",
				"Prerequisites": "Base Will save bonus +2.",
				"Benefit": [
					"You can attempt to force yourself to act normally while your conscious mind is impaired. At the start of any turn that you are under the effects of a compulsion, confusion, or possession effect, you can attempt a Will saving throw (DC = the original effect's save DC). If your saving throw is successful, you can perform one purely mental action (such as casting a psychic spell) as though you weren't under the effects of a compulsion, confusion, or possession effect. This mental action must be a free action, a swift action, a move action, or a standard action.",
					"All other actions that you take during the turn are subject to the compulsion, confusion, or possession effect."
				]
			},
			{
				"-id": "Subjective Mobility",
				"-title": "Subjective Mobility",
				"-description": "You are master of your own gravity in planar realms where gravity is subjective.",
				"Prerequisites": "Wis 13.",
				"Benefit": [ "You automatically succeed at Wisdom checks to set a new direction of gravity. When you set a new direction of gravity, you can reduce your falling speed by up to two-thirds (to a minimum of 50 feet on the first round and 100 feet per round thereafter) or increase it to a maximum of twice normal (300 feet on the first round and 600 feet per round thereafter). These effects only apply on planes with subjective directional gravity." ]
			},
			{
				"-id": "Subjective Slam",
				"-title": "Subjective Slam",
				"-groups": "Combat",
				"-description": "When in control of gravity, you can use your momentum to cause brutal impacts, transforming the very act of falling into a devastating weapon.",
				"Prerequisites": "Con 13; Wis 13; Subjective Mobility; base attack bonus +4 or monk level 3rd.",
				"Benefit": [ "While on a plane with subjective directional gravity, you halve all damage you take from impacts (such as falling damage). While on such a plane, if your “fall” would cause you to collide with a creature or object, you can slam into it with devastating force as a standard action. You must succeed at a touch attack to slam a creature or object, with a cumulative –1 penalty for every 50 feet of your current falling speed; at the GM's discretion, you can automatically hit vast objects such as walls. A creature or object hit by this slam takes 1d6 points of bludgeoning damage for every 50 feet of current falling speed, to a maximum of 6d6, and begins falling at your current speed according to your current subjective directional gravity." ]
			},
			{
				"-id": "Subtle Enchantments",
				"-title": "Subtle Enchantments",
				"-description": "Your enchantments influence targets in more subtle ways and are harder to notice.",
				"Prerequisites": "Deceitful, Spell Focus (enchantment).",
				"Benefit": [ "When you cast an enchantment spell or use an enchantment spell-like ability to influence a creature's attitude or actions and the foe negates the spell with a successful Will save, she has a 50% chance not to notice that she just succeeded at a saving throw (she still can attempt to identify your spell or spell-like ability as normal). If the foe fails the saving throw or is otherwise affected by the spell, the Sense Motive DC to notice she is under the effects of an enchantment increases by 5." ],
				"Normal": [ "Anyone who successfully saves against a spell notices the mental intrusion automatically." ]
			},
			{
				"-id": "Summon Evil Monster",
				"-title": "Summon Evil Monster",
				"-description": "You can summon the aid of creatures driven their very nature to destroy goodness.",
				"Prerequisites": "Evil alignment.",
				"Benefit": [ "When casting summon monster, you also have access to the list of evil monsters on this page. When summoning a creature from this list, your debased nature allows you to cast the spell as a standard action. The summoned creature appears as normal for the spell but can't act until next your next turn. It is not flat-footed, however, and it can make attacks of opportunity as normal. These effects don't apply for creatures from the standard list that aren't also on this list." ],
				"Special": [ "If you possess the Sacred Summons feat, you can apply it to a creature on this list whose alignment (as opposed to its subtype or subtypes) matches your aura." ]
			},
			{
				"-id": "Summon Good Monster",
				"-title": "Summon Good Monster",
				"-description": "You can summon the aid of creatures driven by their very nature to destroy evil.",
				"Prerequisites": "Good alignment.",
				"Benefit": [ "When casting summon monster, you also gain access to the list of good monsters listed here. Your righteous determination grants these summoned creatures the Diehard feat. You may still summon creatures from the standard list, but without the Diehard feat." ]
			},
			{
				"-id": "Summon Neutral Monster",
				"-title": "Summon Neutral Monster",
				"-description": "You can summon creatures that embody the forces of balance.",
				"Prerequisites": "Chaotic neutral, lawful neutral, or neutral alignment.",
				"Benefit": [
					"When casting a summon monster spell, you gain access to the list of neutral creatures at right. You may also summon creatures from the standard summon monster list and apply the counterpoised creature simple template to applicable creatures instead of the celestial or fiendish template.",
					"Creatures you summon from the list and creatures you summon with the counterpoised template gain a +2 resistance bonus on Will saves."
				]
			},
			{
				"-id": "Summoner's Call",
				"-title": "Summoner's Call",
				"-description": "Whenever you summon your eidolon, it is more powerful for a brief period of time.",
				"Prerequisites": "Eidolon class feature.",
				"Benefit": [ "Whenever you summon your eidolon, it is more powerful for a brief period of time. You may give it a +2 enhancement bonus to its Strength, Dexterity, or Constitution. This bonus lasts 10 minutes after the summoning ritual is complete." ]
			},
			{
				"-id": "Sun Striker",
				"-title": "Sun Striker",
				"-groups": "Combat",
				"-description": "Called to strike down the undead, your scimitar becomes an agent of her burning will.",
				"Prerequisites": "Critical Focus, Weapon Focus (scimitar), character level 7th, worshiper of a good deity.",
				"Benefit": [
					"Whenever you confirm a critical hit against an undead creature, your attack bypasses all DR, deals full damage to incorporeal creatures, and acts as though it has the flaming burst weapon special ability.",
					"Combat Trick",
					"Note If using the optional Stamina Pool rules, the following trick may be used with this feat.",
					"Combat Trick: Whenever you threaten a critical hit against an undead creature, you can spend up to 4 stamina points to gain a +1 bonus per stamina point spent to confirm the critical hit."
				]
			},
			{
				"-id": "Sunder Blessing",
				"-title": "Sunder Blessing",
				"-groups": "Combat",
				"-description": "Your disdain for authority allows you to tear away the blessings of the gods.",
				"Prerequisites": "Disruptive, fighter level 8th.",
				"Benefit": [
					"You can attempt to sunder an ongoing divine spell effect or divine spell-like ability by succeeding at a combat maneuver check.",
					"For any effect other than one on a creature, you must succeed at a combat maneuver check against a CMD of 15 + the effect's caster level. To sunder an effect on a creature, you must succeed at a normal sunder combat maneuver check against the creature's CMD + 5, ignoring any miss chance caused by a spell or spell-like ability. On a success, you suppress the effect for 1 round. If you exceed the CMD by 5 or more, you suppress the effect for 2 rounds. If you exceed the CMD by 10 or more, the effect is dispelled instead. If you fail to sunder a spell, you cannot attempt to sunder that effect again for 1 minute."
				]
			},
			{
				"-id": "Sundering Strike",
				"-title": "Sundering Strike",
				"-groups": "Combat",
				"-description": "Your critical hits can sunder your foes' weapons.",
				"Prerequisites": "Str 13, Improved Sunder, Power Attack, base attack bonus +9.",
				"Benefit": [ "Whenever you score a critical hit with a melee attack, you can sunder your opponent's weapon, in addition to the normal damage dealt by the attack. If your confirmation roll exceeds your opponent's CMD, you may deal damage to your opponent's weapon as if from the sunder combat maneuver (roll normal damage to the weapon separately). This does not provoke an attack of opportunity." ],
				"Normal": [ "You must perform a sunder combat maneuver to sunder an opponent's weapon." ],
				"Special": [ "You can only apply the effects of one of the following feats to a given critical hit: Bull Rush Strike, Disarming Strike, Repositioning Strike, Sundering Strike, or Tripping Strike. You may choose to use this feat after you make your confirmation roll." ]
			},
			{
				"-id": "Sunlight Summons",
				"-title": "Sunlight Summons",
				"-description": "Your summoned minions shine with the power of the sun.",
				"Prerequisites": "Spell Focus (conjuration), able to cast summon nature's ally.",
				"Benefit": [ "Creatures that you summon shed light as a light spell. They are immune to blinding or dazzling effects, and their natural weapons are treated as magical for overcoming damage reduction." ]
			},
			{
				"-id": "Sunlit Strike",
				"-title": "Sunlit Strike",
				"-description": "Your melee blows deal extra damage to creatures sensitive to light, making you adept at hunting foul monsters of the night.",
				"Prerequisites": "Arcane Strike, daylight spell-like ability.",
				"Benefit": [ "Whenever you successfully hit an enemy that is vulnerable to light (such as by the light blindness, light sensitivity, or sunlight powerlessness universal monster rules) with a melee weapon you've imbued with your Arcane Strike feat, you deal an additional 1d6 points of damage to the target of your attack. The struck creature must also succeed at a Fortitude saving throw (DC 10 + 1/2 your character level + your Strength modifier) or become staggered for 1 round." ]
			},
			{
				"-id": "Superior Scryer",
				"-title": "Superior Scryer",
				"-description": "You are adept at seeing more when scrying.",
				"Prerequisites": "Spell Focus (divination), the ability to cast at least one spell of the scrying subschool.",
				"Benefit": [
					"When casting a scrying spell, you see through the spell's sensor with darkvision 60 feet, whether or not you possess darkvision normally and whether or not the spell normally allows you to see with darkvision. If the spell sends back sensory information only within 10 feet of the sensor (such as with scrying and greater scrying), this feat doesn't increase that range. You receive a +2 bonus on Perception checks to notice things through a scrying sensor, and your prying eyes and insect spies also receive a +2 bonus on Perception checks.",
					"When you use the scrying or greater scrying spell, you have a 10% increase to the chance of using spells through the sensor."
				]
			},
			{
				"-id": "Superior Summoning",
				"-title": "Superior Summoning",
				"-description": "You can summon more creatures.",
				"Prerequisites": "Augment Summoning, caster level 3rd.",
				"Benefit": [ "Each time you cast a summoning spell that conjures more than one creature, add one to the total number of creatures summoned." ]
			},
			{
				"-id": "Supernal Feast",
				"-title": "Supernal Feast",
				"-description": "You sup on the blood of your ancestors to fuel your fury.",
				"Prerequisites": "Con 15, aasimar.",
				"Benefit": [ "Whenever you are adjacent to a good outsider that takes bleed or blood drain damage, you gain 1 temporary hit point as you bathe in the celestial being's gore. Furthermore, as a full-round action, you can feast on the fallen body of a good outsider that has been dead no longer than 24 hours. When you do, you regain 1 temporary hit point per Hit Die the outsider possessed at a rate of 1 hit point per minute. Temporary hit points gained from this feat last 1d4 hours." ]
			},
			{
				"-id": "Suppress Blight",
				"-title": "Suppress Blight",
				"-description": "You can temporarily suppress afflictions brought on by blight, at a long-term cost.",
				"Prerequisites": "Great Fortitude, Iron Will.",
				"Benefit": [ "Once per day as a standard action, when you are suffering from a curse or disease effect, you can suppress the effects (as delay poison) for 1 hour per 3 character levels (minimum 1 hour). While the affliction is suppressed, you gain a number of temporary hit points equal to the suppressed affliction's save DC, which last as long as the affliction's effects are suppressed. At the end of this duration, the effects return and all subsequent saving throw DCs against the affliction (including the DC to permanently end the effect) are increased by 2, to a maximum increase of half your Hit Dice; you can't suppress an affliction whose save DC has already been increased to its maximum." ]
			},
			{
				"-id": "Suppress Regeneration",
				"-title": "Suppress Regeneration",
				"-groups": "Combat,Teamwork",
				"-description": "You and your allies can exacerbate a regenerating creature's weaknesses. By making a precisely timed attack to open a serious wound just a bit further, your allies can extend the length of time the creature's regeneration is suppressed.",
				"Benefit": [ "When you make a successful attack that causes a creature's regeneration ability to cease functioning for at least 1 round (such as by hitting a troll with alchemist's fire), any ally who also has this feat and is currently threatening the creature can make an attack of opportunity against it. This attack of opportunity deals no damage, but instead extends the time that the creature's regeneration is suppressed by 1 additional round. If multiple allies with this feat hit the creature with this attack of opportunity, the additional rounds of suppression stack." ]
			},
			{
				"-id": "Suppressive Fire",
				"-title": "Suppressive Fire",
				"-groups": "Combat,Teamwork",
				"-description": "Your well-timed ranged attacks protect your allies as they advance on the battlefield.",
				"Prerequisites": "Far Shot, Point-Blank Shot, Precise Shot, keen senses racial trait.",
				"Benefit": [ "Whenever you damage a target using a ranged attack, that target can't make attacks of opportunity for 1 round against your allies who also have this feat when they move out of one of the target's threatened squares." ]
			},
			{
				"-id": "Sure Grasp",
				"-title": "Sure Grasp",
				"-description": "Your quick reflexes and skill at climbing keep you from falling to your doom.",
				"Prerequisites": "Climb 1 rank.",
				"Benefit": [ "Roll twice while climbing or when making a Reflex save to avoid falling, and take the higher result." ]
			},
			{
				"-id": "Sure and Fleet",
				"-title": "Sure and Fleet",
				"-groups": "Halfling",
				"-description": "You are both fast and careful.",
				"Prerequisites": "Fleet of foot racial trait, halfling.",
				"Benefit": [ "You gain a +2 racial bonus on Acrobatics and Climb checks." ]
			},
			{
				"-id": "Sure-Footed",
				"-title": "Sure-Footed",
				"-groups": "Animal Companion Feat",
				"-description": "Your footing is secure in unstable terrain.",
				"Prerequisites": "Quadruped animal or magical beast.",
				"Benefit": [ "You gain a +2 bonus on Acrobatics checks to keep your balance and Reflex saves to avoid falling. You can move at a normal speed on steep slopes and stairs and do not risk falling when running or charging downhill." ],
				"Normal": [ "Moving uphill costs 2 squares of movement to enter each square of steep slope. Running or charging downhill requires a successful DC 10 Acrobatics check (or DC 10 Ride check for mounted characters) or you risk falling." ]
			},
			{
				"-id": "Surge of Success",
				"-title": "Surge of Success",
				"-groups": "Human",
				"-description": "Your success drives your further actions.",
				"Prerequisites": "Human.",
				"Benefit": [ "When you confirm a critical hit or roll a natural 20 on a saving throw, you gain a +2 circumstance bonus on a single attack roll, saving throw, skill check, or ability check of your choice before the end of your next turn. You must choose to use this bonus before you make the attack roll, saving throw, skill check, or ability check." ]
			},
			{
				"-id": "Surprise Follow-Through",
				"-title": "Surprise Follow-Through",
				"-groups": "Combat,Orc/Half-Orc",
				"-description": "...",
				"Prerequisites": "Str 13, Cleave, Power Attack, base attack bonus +1.",
				"Benefit": [ "When using Cleave or Great Cleave, the second foe you attack on your turn is denied its Dexterity bonus against you." ]
			},
			{
				"-id": "Surprise Maneuver",
				"-title": "Surprise Maneuver",
				"-description": "Your maneuvers are devastating against disadvantaged foes.",
				"Prerequisites": "Combat Expertise; sneak attack +3d6 or studied strike +3d6.",
				"Benefit": [
					"If you have sneak attack, when you attempt a combat maneuver check against a creature that you are flanking or that is denied its Dexterity bonus to AC against your attack, you gain a bonus on the combat maneuver check that's equal to the number of sneak attack dice you roll.",
					"If you have the studied combat class feature, you can use studied strike on a combat maneuver check. When you do so, you gain a bonus on the combat maneuver check equal to your number of studied strike dice."
				]
			},
			{
				"-id": "Surprise Strike",
				"-title": "Surprise Strike",
				"-groups": "Combat,Halfling",
				"-description": "You actually seem to do more damage when frantically trying to avoid your enemies.",
				"Prerequisites": "Cautious Fighter, Desperate Swing, base attack bonus +6, halfling.",
				"Benefit": [ "Once per day, when fighting defensively or making an attack of opportunity while taking the total defense action with the Desperate Swing feat, you take no penalty on the attack roll." ]
			},
			{
				"-id": "Surprising Combatant",
				"-title": "Surprising Combatant",
				"-groups": "Combat",
				"-description": "You can get the drop on foes by tricking your opponents into overlooking you as a combatant.",
				"Prerequisites": [
					"Improved Initiative, Bluff 3 ranks.",
					"Benefit*: At the beginning of a combat in which you would normally be able to act in a surprise round, after initiative is rolled but before the surprise round begins, you can attempt a Bluff check as a free action. The DC of this Bluff check is equal to 15 + the CR of the encounter. If you succeed at this Bluff check, you may treat the result of your Bluff check as your initiative result for the surprise round. If your Bluff check fails, you cannot act during the surprise round. Regardless, you use your normal initiative result to determine initiative for the remainder of the encounter."
				],
				"Special": [ "This feat is available to weretigers, weretiger-kin and those who associate with these creatures." ]
			},
			{
				"-id": "Surprising Strategy",
				"-title": "Surprising Strategy",
				"-groups": "Combat",
				"-description": "Your quick swordsmanship leaves your opponents struggling to predict your moves.",
				"Prerequisites": "Riposte class feature.",
				"Benefit": [ "In addition to the attack of opportunity you can make when you successfully parry an attack, you can attempt a dirty trick, disarm, or sunder combat maneuver with a +2 morale bonus without provoking an attack of opportunity against the creature whose attack you parry, so long as the creature is within reach." ]
			},
			{
				"-id": "Survivor",
				"-title": "Survivor",
				"-description": "Only the strong thrive in your homeland, and you are no weakling, even among your kin.",
				"Prerequisites": "Con 13, Diehard, Endurance.",
				"Benefit": [ "You gain a +5 bonus on all Constitution checks made to stabilize while dying. Once per day, if you are struck by a critical hit or sneak attack, you can spend an immediate action to negate the critical or the sneak attack damage, making the attack a normal hit." ]
			},
			{
				"-id": "Swap Places",
				"-title": "Swap Places",
				"-groups": "Combat,Teamwork",
				"-description": "You are skilled at changing places with your ally during a chaotic melee.",
				"Benefit": [ "Whenever you are adjacent to an ally who also has this feat, you can move into your ally's square as part of normal movement. At the same time, your ally moves into your previous space as an immediate action. Both you and your ally must be willing and able to move to take advantage of this feat. Your ally must be the same size as you to utilize this feat. Your ally does not provoke an attack of opportunity from this movement, but you provoke as normal. This movement does not count against your ally's movement on his next turn." ]
			},
			{
				"-id": "Sweeping Disarm",
				"-title": "Sweeping Disarm",
				"-groups": "Combat",
				"-description": "When you knock a weapon from an opponent's grasp, the errant weapon may disarm another foe.",
				"Prerequisites": "Int 13, Combat Expertise, Improved Disarm, base attack bonus +1.",
				"Benefit": [ "Whenever you succeed at a combat maneuver check to disarm an opponent, you can attempt a second disarm at a -5 penalty against an opponent adjacent to the original target. You need not be threatening the second target. You can attempt only one additional disarm combat maneuver check per round with this feat." ]
			},
			{
				"-id": "Sweeping Dodge",
				"-title": "Sweeping Dodge",
				"-groups": "Combat",
				"-description": "A quick sweep of your cloak deflects an incoming attack.",
				"Prerequisites": "Dex 13, Dodge.",
				"Benefit": [ "When you make a dueling dodge while wearing a cloak, you gain evasion (as the rogue ability). If a critical hit or sneak attack is scored on you, there is a 25% chance that the critical hit or sneak attack is negated and damage is instead rolled normally. This feat only applies until the attack that triggered the immediate action is resolved. This feat does not stack with the fortification armor special ability or similar effects." ]
			},
			{
				"-id": "Swift Aid",
				"-title": "Swift Aid",
				"-groups": "Combat",
				"-description": "With a quick but harmless swipe, you can aid an ally's assault.",
				"Prerequisites": "Int 13, Combat Expertise, base attack bonus +6.",
				"Benefit": [ "As a swift action, you can attempt the aid another action, granting your ally either a +1 bonus on his next attack roll or a +1 bonus to his AC." ],
				"Normal": [ "Aid another is a standard action." ]
			},
			{
				"-id": "Swift Iron Style",
				"-title": "Swift Iron Style",
				"-groups": "Combat,Style",
				"-description": "You have learned to move in ways that better accommodate your armor, and can maneuver easily despite its bulk.",
				"Prerequisites": "Str 13, Dex 13, proficiency with medium armor.",
				"Benefit": [ "While using this style, you treat the armor check penalty of your armor as if it were 1 less, and the maximum Dexterity bonus to AC as if it were 1 higher." ],
				"Special": [ "A character with the armor training class feature can use Swift Iron Style while wearing any type of armor with which she is proficient. These benefits stack with armor training." ]
			},
			{
				"-id": "Swift Kitsune Shapechanger",
				"-title": "Swift Kitsune Shapechanger",
				"-groups": "Kitsune",
				"-description": "You can change shape more quickly than most kitsune.",
				"Special": [ "A kitsune may select this feat any time she would gain a feat." ],
				"Prerequisites": "Dex 13, base attack bonus +6, kitsune.",
				"Benefit": [ "You can assume human or kitsune form as a swift action. If you have the Fox Shape feat, you can assume fox form as a swift action as well." ],
				"Normal": [ "A kitsune's change shape ability is a standard action." ]
			},
			{
				"-id": "Swift Refuge",
				"-title": "Swift Refuge",
				"-groups": "Combat",
				"-description": "You quickly turn, forcing devastating blows to be blunted by the thickest part of your armor.",
				"Prerequisites": "Str 13, Dex 13, Swift Iron Style, proficiency with medium armor.",
				"Benefit": [ "Once per day when using Swift Iron Style, when you're hit by a weapon, unarmed attack, or natural weapon, you can treat all dice other than the weapon's base damage dice (including extra dice from sneak attack, critical hit, magic special weapon abilities, and Vital Strike) as having rolled 1s. You can use this ability a second time per day when your base attack bonus reaches +8, and a third time at +16." ]
			},
			{
				"-id": "Swift Sprint",
				"-title": "Swift Sprint",
				"-groups": "Combat",
				"-description": "You balance your armor expertly, allowing you to run and sprint without impediment.",
				"Prerequisites": "Str 13, Dex 13, Swift Iron Style, Swift Refuge, proficiency with medium armor.",
				"Benefit": [ "When you're charging, running, or taking no action in your turn other than movement, your armor does not reduce your movement." ]
			},
			{
				"-id": "Sword Oath",
				"-title": "Sword Oath",
				"-description": "By swearing to never use a weapon other than a longsword, you can achieve things normally limited to the most highly trained swordsmen.",
				"Prerequisites": "Proficient in longsword, Weapon Focus (longsword), base attack bonus +4.",
				"Benefit": [ "You may select longsword-related feats as if you were a 4th-level fighter. For example, you may select Weapon Specialization (longsword) as a feat." ],
				"Special": [ "If you ever use a melee or ranged weapon other than a longsword in combat, you lose the benefits of this feat until you receive an atonement spell. You may still use spells that act as weapons (such as flame blade and spiritual weapon) without affecting your oath." ]
			},
			{
				"-id": "Sword and Pistol",
				"-title": "Sword and Pistol",
				"-groups": "Combat",
				"-description": "You effortlessly pair melee and ranged weaponry.",
				"Prerequisites": "Dex 13, Point-Blank Shot, Rapid Shot, Snap Shot, Two-Weapon Fighting, base attack bonus +6.",
				"Benefit": [ "When you use the Two-Weapon Fighting feat while wielding a melee weapon and a crossbow or firearm, your attacks with the crossbow or firearm provoke no attacks of opportunity from foes that you threaten with your melee weapon." ],
				"Normal": [ "Making a ranged attack provokes attacks of opportunity." ]
			},
			{
				"-id": "Sword's Shadow",
				"-title": "Sword's Shadow",
				"-groups": "Combat",
				"-description": "You attack with a second strike before your opponent can recover from the first.",
				"Prerequisites": "Deft Hands, base attack bonus +7, wyrwood.",
				"Benefit": [ "When you successfully damage an enemy with the first attack of a full attack, you can attempt a Sleight of Hand check against that enemy's CMD as an immediate action. If you succeed, you can treat that enemy as flat-footed for the next attack you make as part of the full attack action." ]
			},
			{
				"-id": "Swordplay Deflection",
				"-title": "Swordplay Deflection",
				"-groups": "Combat",
				"-description": "You can deflect incoming attacks.",
				"Prerequisites": "Combat Expertise, Improved Feint, Swordplay Style, Swordplay Upset, Weapon Focus with the chosen weapon, base attack bonus +7.",
				"Benefit": [
					"While using Swordplay Style, when you make one or more melee attacks, you can forgo a single melee attack to prepare an action to disrupt an opponent's attack.",
					"This functions as a swashbuckler's opportune parry and riposte deed, except that if your result is greater than your opponent's, you gain a +4 shield bonus to your Armor Class against attacks made by your opponent until the start of your next turn instead of preventing the hit, and you cannot attempt to riposte. If you have the opportune parry and riposte deed, you gain this Armor Class bonus anytime you successfully parry an opponent's attack."
				]
			},
			{
				"-id": "Swordplay Style",
				"-title": "Swordplay Style",
				"-groups": "Combat,Style",
				"-description": "Your defense relies on perfectly timed attacks.",
				"Prerequisites": "Combat Expertise, Weapon Focus with the chosen weapon, base attack bonus +3.",
				"Benefit": [ "Choose one weapon from the heavy blades or light blades fighter weapon group. While using this style, wielding the chosen weapon, and fighting defensively or using either the total defense action or the Combat Expertise feat, you gain a +1 shield bonus to your Armor Class. In addition, you do not take the penalty on melee attacks from Combat Expertise on the first attack roll you make each turn. You still take the penalty on additional attacks, including attacks of opportunity." ],
				"Special": [ "A character with the swashbuckler weapon training or weapon training (heavy blades or light blades) class feature can use Swordplay Style with any light or one-handed piercing melee weapon, heavy blade, or light blade, respectively, in addition to the chosen weapon." ]
			},
			{
				"-id": "Swordplay Upset",
				"-title": "Swordplay Upset",
				"-groups": "Combat",
				"-description": "You catch opponents off guard with your attacks.",
				"Prerequisites": "Combat Expertise, Improved Feint, Swordplay Style, Weapon Focus with the chosen weapon, base attack bonus +5.",
				"Benefit": [ "While using Swordplay Style, as an immediate action, you can attempt a feint against an opponent that makes a melee attack against you and misses." ]
			},
			{
				"-id": "Sycophant",
				"-title": "Sycophant",
				"-description": "You elicit pity or disgust from your enemies.",
				"Benefit": [
					"As a standard action, you can attempt to force an enemy to show you mercy by succeeding at a Diplomacy check (DC = 15 + the target's Will saving throw bonus) If you succeed, your target's next successful attack against you deals nonlethal damage (the target does not take the usual attack penalty for dealing nonlethal damage).",
					"Whether you succeed or fail, you cannot target the same creature with this feat again for 24 hours."
				]
			},
			{
				"-id": "Symbolic Mastery",
				"-title": "Symbolic Mastery",
				"-groups": "Item Mastery",
				"-description": "You can channel the power of the gods through symbols of their faiths, using it as a weapon.",
				"Prerequisites": "Use Magic Device 4 ranks, base Fortitude saving throw bonus +2.",
				"Benefit": [
					"A number of times per day equal to your base Fortitude save bonus, you can cause a holy symbol of a deity you worship and whose alignment is the same as yours to unleash a harmful magical attack called a symbolic bolt. This attack can be delivered via touch or a ray, as a standard action. A melee symbolic bolt requires a melee touch attack that doesn't provoke attacks of opportunity, and a ranged symbolic bolt is a ranged attack with a range of 30 feet. A symbolic bolt deals damage equal to 1d6 + 1/2 your total number of ranks in the Use Magic Device skill. You choose the type of damage dealt by your symbolic bolt each time you use this feat from those offered by the cleric domains granted by the deity whose holy symbol you use. The types of damage (and the cleric domains that grant them) are acid (Earth, Magic, Rune), cold (Darkness, Magic, Rune, Void, Water, Weather), electricity (Air, Magic, Rune, Weather), fire (Destruction, Fire, Magic, Rune), negative energy (Death, Destruction, Void), positive energy (Glory, Healing, Repose, Sun), sonic (Magic, Rune, Weather), and untyped (any). If a symbolic bolt is used to deal untyped damage, the bolt's damage is reduced to an amount equal to 1d3 + 1/2 your total number of ranks in Use Magic Device.",
					"When you create a symbolic bolt, it originates from the hand holding the holy symbol and appears only briefly, so you have a hand free anytime you're not attacking with a symbolic bolt. The feat Weapon Focus (ray) doesn't apply to symbolic bolts, but you can take the feat Weapon Focus (symbolic bolt) and apply it to both melee and ranged symbolic bolts. Spells that target a single weapon (such as magic weapon) can't affect symbolic bolts, nor can a symbolic bolt have magic weapon special abilities. Abilities and feats that affect all weapon attacks function as normal with symbolic bolts."
				]
			},
			{
				"-id": "Sympathetic Rage",
				"-title": "Sympathetic Rage",
				"-groups": "Combat",
				"-description": "Seeing an ally enter a rage causes you to enter a rage-like state.",
				"Benefit": [ "Whenever you are adjacent to an ally who is raging, you may choose to enter a similar but less powerful rage as a free action on your turn. This weaker rage gives you all the benefits and penalties of a rage, except your morale bonus to Strength and Constitution is only +2. There is no limit to how long you can rage, as long as you remain adjacent to a raging ally (for example, you could take a 5-foot step away from one raging ally toward another raging ally and maintain your rage). As with a barbarian's rage, when this weaker rage ends, you are fatigued." ]
			},
			{
				"-id": "Tactical Reposition",
				"-title": "Tactical Reposition",
				"-groups": "Combat",
				"-description": "You excel at moving foes right where you want them.",
				"Prerequisites": "Int 13, Combat Expertise, Improved Reposition.",
				"Benefit": [ "When making a reposition combat maneuver, you can move an enemy into a trap or other hazardous area, such as a pit, wall scythe, or blade barrier. When you do so, the moved enemy is treated as though it had activated the trap or triggered the hazard, and it takes a -2 penalty to AC and on saving throws to mitigate the trap or hazard's effects." ],
				"Normal": [ "You cannot reposition a foe into an intrinsically dangerous space such as a pit or blade barrier." ]
			},
			{
				"-id": "Tail Terror",
				"-title": "Tail Terror",
				"-groups": "Combat,Kobold",
				"-description": "...",
				"Prerequisites": "Base attack bonus +1, kobold.",
				"Benefit": [ "You can make a tail slap attack with your tail. This is a secondary natural attack that deals 1d4 points of bludgeoning damage. Furthermore, you can augment your tail slap attack with a kobold tail attachment. For the purpose of weapon feats, you are considered proficient with all kobold tail attachments." ]
			},
			{
				"-id": "Tail Weapon",
				"-title": "Tail Weapon",
				"-groups": "Combat",
				"-description": "You have strengthened your tail enough that you can use it to make slap attacks and augment your balance.",
				"Prerequisites": "Base attack bonus +1, serpentfolk.",
				"Benefit": [
					"You can make a tail slap attack with your tail.",
					"This is a secondary natural attack that deals 1d6 points of bludgeoning damage. You also gain a +2 racial bonus on Acrobatics checks to balance and to your CMD against maneuvers that attempt to move you from your square."
				]
			},
			{
				"-id": "Take a Breather",
				"-title": "Take a Breather",
				"-groups": "Combat",
				"-description": "You can use lapses in your opponent's guard to recuperate from the wounds you have already sustained.",
				"Prerequisites": "Con 13, Combat Vigor, character level 4th.",
				"Benefit": [ "Your vigor pool gains 1 vigor point. Whenever an opponent that you threaten provokes an attack of opportunity from you, as a swift action you can spend 1 or more vigor points to regain hit points as described by the Combat Vigor feat, instead of making an attack of opportunity against that opponent. Spending vigor in this manner does not count against the total number of attacks of opportunity that you can make during a round." ]
			},
			{
				"-id": "Talented Magician",
				"-title": "Talented Magician",
				"-description": "Roguish magic comes easily to you.",
				"Prerequisites": "Major magic rogue talent, minor magic rogue talent.",
				"Benefit": [ "You gain an additional daily use of each of your minor magic and major magic rogue talents." ],
				"Special": [ "You can take this feat multiple times. Each time you do, you gain an additional daily use of each talent." ]
			},
			{
				"-id": "Tandem Evasion",
				"-title": "Tandem Evasion",
				"-groups": "Combat,Teamwork",
				"-description": "You and your allies help each other evade deadly attacks.",
				"Prerequisites": "Dex 13, Dodge.",
				"Benefit": [ "When adjacent to an ally who also has this feat, you gain evasion against a dragon's breath weapon and tail sweep special attacks. If you already have evasion, you gain improved evasion instead." ]
			},
			{
				"-id": "Tandem Trip",
				"-title": "Tandem Trip",
				"-groups": "Combat,Teamwork",
				"-description": "You know how to work together to trip your foes.",
				"Benefit": [ "Whenever you attempt a trip combat maneuver against an enemy threatened by an ally with this feat, you roll twice and take the better result." ]
			},
			{
				"-id": "Tangle Feet",
				"-title": "Tangle Feet",
				"-groups": "Combat, Goblin",
				"Prerequisites": "Dodge, Mobility, Underfoot, Goblin, Small size or smaller.",
				"Benefit": [ "When you successfully make an Acrobatics check to avoid provoking an attack of opportunity from a larger opponent when you move through its threatened area or its space, you can make that opponent lose its balance until the end of its next turn as a free action. While that creature's balance is lost, if it attempts to move, it must make a successful DC 15 Acrobatics check or fall prone, wasting the move action. You can only affect one creature with this effect each round." ]
			},
			{
				"-id": "Tangled Limbs",
				"-title": "Tangled Limbs",
				"-groups": "Combat",
				"-description": "You twist your long weapon among your target's legs, knocking your foe off-balance.",
				"Prerequisites": "Int 13, Combat Expertise, Improved Trip, Weapon Focus with the chosen weapon.",
				"Benefit": [
					"Choose one weapon with the reach special quality.",
					"When you attempt a trip combat maneuver check with the chosen weapon, your target doesn't receive a bonus to its CMD against your trip attempt for having more than two legs."
				],
				"Normal": [ "A creature with more than two legs receives a +2 bonus to its CMD against trip attempts for each additional leg it has." ],
				"Special": [ "In addition to the chosen weapon, a character with the weapon training class feature can use Tangled Limbs with any melee weapon from any fighter weapon group that he has selected with weapon training and that has the reach special quality." ]
			},
			{
				"-id": "Tantrum",
				"-title": "Tantrum",
				"-groups": "Combat",
				"-description": "Your overly dramatic expressions of rage can trick your opponents into letting their guard down.",
				"Prerequisites": "Bluff 1 rank, rage class feature, gnome.",
				"Benefit": [ "You may use the Bluff skill to feint while raging. The effect of the feint lasts only until the first time you hit the target." ]
			},
			{
				"-id": "Target of Opportunity",
				"-title": "Target of Opportunity",
				"-groups": "Combat,Teamwork",
				"-description": "You and your allies pelt your enemies with a deadly barrage of missiles.",
				"Prerequisites": "Point-Blank Shot, base attack bonus +6.",
				"Benefit": [ "When an ally who also has this feat makes a ranged attack and hits an opponent within 30 feet of you, you can spend an immediate action to make a single ranged attack against that opponent. Your ranged weapon must be in hand, loaded, and ready to be fired or thrown for you to make the ranged attack." ]
			},
			{
				"-id": "Taskmaster",
				"-title": "Taskmaster",
				"-groups": "Combat, Hobgoblin",
				"Prerequisites": "Demoralizing Lash, Intimidate 5 ranks, Hobgoblin.",
				"Benefit": [ "As a standard action, you spur an ally, who must have fewer Hit Dice than yourself, to reckless effort. For 1 minute, the ally gains a +1 morale bonus on attack rolls, weapon damage rolls, and Will saves against mind-affecting effects. However, the ally also takes a –2 penalty to AC and on skill checks. To affect an unwilling ally, you must succeed at an Intimidate check with the same DC used to demoralize your ally." ],
				"Special": [ "If you have 10 or more ranks in Intimidate, the morale bonus increases to +2." ]
			},
			{
				"-id": "Tatzlwyrm Claw Style",
				"-title": "Tatzlwyrm Claw Style",
				"-groups": "Combat,Style",
				"-description": "Your curled fingers can tear into opponents' flesh and snatch free grappled allies.",
				"Prerequisites": "Dex 13, Improved Grapple, Improved Unarmed Strike, Escape Artist 1 rank.",
				"Benefit": [ "You can choose for your unarmed attacks to deal slashing damage. If you strike a target that has another creature grappled or pinned, as a swift action you can immediately attempt a grapple combat maneuver check against the target's CMD. If you succeed at the check, you can force the target to release a grappled creature or switch a pinned creature to being merely grappled." ]
			},
			{
				"-id": "Tatzlwyrm Grappler",
				"-title": "Tatzlwyrm Grappler",
				"-groups": "Combat",
				"-description": "You can twist and bend in a way that makes you extremely difficult to grab.",
				"Prerequisites": "Dex 13, Improved Grapple, Improved Unarmed Strike, Tatzlwyrm Claw Style, Escape Artist 3 ranks.",
				"Benefit": [ "While you're using the Tatzlwyrm Claw Style feat, whenever an opponent attempts to initiate a grapple against you, you can attempt an Escape Artist check. If the result is higher than your CMD, you can use the result as your CMD against that combat maneuver. You must be aware of the attack and not flat-footed." ]
			},
			{
				"-id": "Tatzlwyrm Rake",
				"-title": "Tatzlwyrm Rake",
				"-groups": "Combat",
				"-description": "You can immobilize your foe without using your arms.",
				"Prerequisites": "Dex 13, Improved Grapple, Improved Unarmed Strike, Tatzlwyrm Claw Style, Tatzlwyrm Grappler, Escape Artist 8 ranks.",
				"Benefit": [ "While using the Tatzlwyrm Claw Style feat, you can attempt a combat maneuver check to maintain a grapple without using your arms. You must use at least two limbs in order to do this, and if you use all your legs, you can't take any movement while maintaining the grapple. If your combat maneuver check succeeds by 10 or more, you are able to make a single unarmed attack against the target of the grapple as a swift action." ]
			},
			{
				"-id": "Taunt",
				"-title": "Taunt",
				"-description": "You may be small, but your remarks cut others down to size.",
				"Prerequisites": "Cha 13, Small size or smaller.",
				"Benefit": [ "You can demoralize opponents using Bluff rather than Intimidate (see the Intimidate skill description for details) and take no skill check penalty for being smaller than your target." ]
			},
			{
				"-id": "Team Up",
				"-title": "Team Up",
				"-groups": "Combat",
				"-description": "When you are ganging up against an enemy, you can aid an ally with a quick feint.",
				"Prerequisites": "Int 13, Combat Expertise, Gang Up, base attack bonus +6.",
				"Benefit": [ "When you and at least two of your allies are adjacent to an opponent, you can attempt the aid another action as a move action." ],
				"Normal": [ "Aid another is a standard action." ]
			},
			{
				"-id": "Technologist",
				"-title": "Technologist",
				"-description": "You are familiar with the basic mechanics of technology.",
				"Benefit": [ "You are considered to be trained in any skill used against a technology-based subject. If the skill in question requires training to use even against non-technological subjects, you must still have ranks in that skill in order to gain the benefit of Technologist." ],
				"Normal": [ "You treat all skill checks made against technology as if they were untrained skill checks. This may mean that you cannot attempt certain skill checks, even if you possess ranks in the skill in question." ]
			},
			{
				"-id": "Technology Adept",
				"-title": "Technology Adept",
				"-groups": "Combat",
				"-description": "You utilize high-tech firearms to maximum effect.",
				"Prerequisites": "Dex 13, Exotic Weapon Proficiency (firearms), Point-Blank Shot",
				"Benefit": [ "When you attack with a technological firearm that consumes charges, the save DC of any effect caused by that firearm increases by 1. If your bonuses from Point-Blank Shot apply, it increases by 2 instead." ]
			},
			{
				"-id": "Technophobe",
				"-title": "Technophobe",
				"-description": "Smashing technological abominations brings you joy.",
				"Prerequisites": "Improved Sunder",
				"Benefit": [ "When you reduce a robot to 0 hit points or destroy a technological item possessed by an enemy, you receive a +2 morale bonus on ability checks, attack rolls, saving throws, and skill checks for a number of rounds equal to your Wisdom bonus (minimum 1 round). You receive this bonus for destroying an unattended object so long as it was in the possession of an enemy within the last round." ]
			},
			{
				"-id": "Telekinetic Mastery",
				"-title": "Telekinetic Mastery",
				"-groups": "Combat, Item Mastery",
				"-description": "You can coax telekinesis from transmutation magic items.",
				"Prerequisites": "Use Magic Device 5 ranks, base Fortitude save bonus +7.",
				"Benefit": [
					"You can cause an item that has a transmutation spell of 4th level or higher in its construction requirements to cast telekinesis.",
					"You can use this feat once per day, plus an additional time per day at base Fortitude save bonus +9 and +11."
				]
			},
			{
				"-id": "Telepathic Link",
				"-title": "Telepathic Link",
				"-description": "You can telepathically communicate with your familiar.",
				"Prerequisites": "Must have a familiar with the speak with master ability.",
				"Benefit": [ "You and your familiar can communicate with each other telepathically at a range of up to 1 mile." ]
			},
			{
				"-id": "Telepathy Tap",
				"-title": "Telepathy Tap",
				"-description": "You are able to notice, intercept, and interpret telepathic communication around you.",
				"Prerequisites": "Sense Motive 10 ranks, ability to cast detect thoughts or telepathy as a spell or spell-like ability or telepathy supernatural ability.",
				"Benefit": [ "When a creature within range of your telepathy (or within 60 feet if you are using detect thoughts) uses telepathy to communicate, including when that creature sends or receives a magical message such as dream or sending, you can notice the attempt with a successful DC 30 Sense Motive check. At this point, you can either use your telepathy ability or spend a use or casting of detect thoughts as an immediate action. If you do so, for every 5 points by which your check exceeds the DC, you glean one fragment of information about the communication, such as the identity of its source; its general nature; the emotional state of the sender or the recipient; or a specific person, place, or thing mentioned in the message. In addition, the creature must attempt a saving throw (with a DC equal to that of the spell if you spent a use of detect thoughts or are using telepathy, or 10 + 1/2 your racial HD + your Charisma modifier if you are using a racial telepathy ability). If the target fails its save, you can listen to both sides of the telepathic or magical communication as long as you continue to concentrate each round as a standard action." ]
			},
			{
				"-id": "Teleport Tactician",
				"-title": "Teleport Tactician",
				"-groups": "Combat",
				"Prerequisites": "Combat reflexes, Disruptive, Spellbreaker.",
				"Benefit": [ "Any creature using a teleportation effect to enter or leave a square threatened by you provokes an attack of opportunity, even if casting defensively or using a supernatural ability." ]
			},
			{
				"-id": "Teleportation Mastery",
				"-title": "Teleportation Mastery",
				"-groups": "Item Mastery",
				"-description": "You can coax teleportation from conjuration magic items.",
				"Prerequisites": "Use Magic Device 4 ranks, base Fortitude save bonus +6.",
				"Benefit": [
					"You can cause an item that has a conjuration spell of 3rd level or higher in its construction requirements to cast dimension door.",
					"You can use this ability once per day, plus an additional time per day at base Fortitude save bonus +9 and +12."
				]
			},
			{
				"-id": "Tempting Bargain",
				"-title": "Tempting Bargain",
				"-description": "By going against traditional teachings and summoner practices, you have secured the service of an outsider whose morality differs wildly from your own, but you must endure its constant temptations or attempts to redeem you.",
				"Prerequisites": "Unchained summoner level 1st, eidolon class feature.",
				"Benefit": [
					"You can select an eidolon of any alignment, even if its alignment is more than one step away from your own. Your eidolon never refuses your call as a result of the differences between your respective alignments, though it still can refuse to follow commands that are against its ethos or alignment.",
					"Each time you gain a summoner level, you must attempt a Will saving throw (DC = 10 + half your eidolon's Hit Dice + your eidolon's Charisma modifier). On a failure, your alignment permanently shifts one step closer to that of your eidolon. Modifiers that are not permanent can't be applied on this saving throw."
				],
				"Special": [ "If your alignment becomes the same as that of your eidolon, you can immediately replace this feat with any other feat you would have qualified for at 1st level. The feat you choose for this must be one approved by the GM, depending on the nature of your eidolon and its influence over you." ]
			},
			{
				"-id": "Tenacious Hunter",
				"-title": "Tenacious Hunter",
				"-groups": "Animal Companion Feat",
				"-description": "The animal is capable of quickly pinpointing hidden prey.",
				"Prerequisites": "Perception 3 ranks, Stealth 3 ranks, animal companion.",
				"Benefit": [ "The animal companion gains a +2 bonus on Perception checks to oppose Stealth checks. When using Perception to pinpoint an invisible creature's location, this bonus increases to +10. In addition, whenever the animal companion successfully uses Perception to notice a creature using Stealth or to pinpoint an invisible creature's location, that foe is denied its Dexterity bonus to AC against the next attack the animal companion makes on or before the animal companion's next turn." ]
			},
			{
				"-id": "Tenacious Spell",
				"-title": "Tenacious Spell",
				"-groups": "Metamagic",
				"-description": "Your magic is difficult to unravel.",
				"Benefit": [
					"Increase the DC of caster level checks to counter or dispel a tenacious spell by 2. If a tenacious spell is dispelled or dismissed, it lasts for 1d4 further rounds (to a maximum of the spell's normal duration) before ending (this does not occur if antimagic field or a similar spell or effect suppresses or ends the spell's effect without dispelling or dismissing it). The lingering auras of tenacious spells detectable with detect magic last for twice as long as usual after the spells end.",
					"Level Increase: +1 (a tenacious spell uses up a spell slot 1 level higher than the spell's actual level.)"
				]
			},
			{
				"-id": "Tenacious Survivor",
				"-title": "Tenacious Survivor",
				"-groups": "Orc/Half-Orc",
				"Prerequisites": "Con 13, Diehard, Endurance, half-orc or orc.",
				"Benefit": [ "When you are killed by hit point damage, your soul lingers in your body for a number of rounds equal to your Constitution bonus. You are still dead, but a creature can make a DC 10 Heal check as a standard action to realize that you can still be saved. You can be healed by magic as if you were alive. If you are healed enough hit points that you would no longer be dead, you are alive again, but you gain one permanent negative level." ]
			},
			{
				"-id": "Tenacious Transmutation",
				"-title": "Tenacious Transmutation",
				"-description": "Your mastery of the magic of changing makes your transmutations more durable.",
				"Prerequisites": "Spell Focus (transmutation).",
				"Benefit": [ "The DC of caster level checks to dispel or remove your transmutations increases by 2; even if the spell is negated, its effects persist for 1 additional round before dissipating." ]
			},
			{
				"-id": "Tenebrous Spell",
				"-title": "Tenebrous Spell",
				"-groups": "Metamagic",
				"-description": "You blend shadow into your spells, increasing their efficacy at the price of susceptibility to light.",
				"Benefit": [
					"When you cast a tenebrous spell in darkness or dim light, the spell's effective caster level and any associated save DCs are increased by 1. Any attempts at dispelling a tenebrous spell in darkness or dim light take a –2 penalty on the dispel check.",
					"Casting a tenebrous spell in bright light is difficult, and requires a concentration check (DC 15 + twice the tenebrous spell's effective spell level). Attempts to dispel a tenebrous spell in bright light gain a +4 bonus on the dispel check.You cannot use this feat on spells with the light descriptor. A tenebrous spell uses up a spell Slot one level higher than the spell's actual level, except in the case of spells with the darkness or shadow descriptor or of the illusion (shadow) subschool; this feat does not change the effective level of those spells (but still counts as using a metamagic feat for all other purposes)."
				]
			},
			{
				"-id": "Tengu Raven Form",
				"-title": "Tengu Raven Form",
				"-groups": "Tengu",
				"Prerequisites": "Tengu Wings, character level 7th, tengu.",
				"Benefit": [ "Once per day, you can take the form of a Large black bird resembling a raven, granting you a fly speed of 60 feet (good maneuverability), a +4 size bonus to your Strength, a –2 penalty to your Dexterity, and a +4 natural armor bonus. This spell-like ability otherwise functions as beast shape II with a caster level equal to your level." ]
			},
			{
				"-id": "Tengu Wings",
				"-title": "Tengu Wings",
				"-groups": "Tengu",
				"-description": "...",
				"Prerequisites": "Character level 5th, tengu.",
				"Benefit": [ "Once per day, you can sprout a pair of giant black crow's wings, granting you a fly speed of 30 feet (average maneuverability). This spell-like ability otherwise functions as beast shape I (though you do not gain any other benefits of that spell) with a caster level equal to your level." ]
			},
			{
				"-id": "Terrifying Mask",
				"-title": "Terrifying Mask",
				"-description": "Your fiendish visage has made you a truly terrifying spectacle to behold, and you can force others to betray their feelings with a single look.",
				"Prerequisites": "Cha 13, Monstrous Mask, tiefling.",
				"Benefit": [ "Anytime you can make a Sense Motive check to get a hunch or detect whether someone is trustworthy or not, you can choose to instead make an Intimidate check at a –2 penalty. This ability only works on creatures of the humanoid type." ]
			},
			{
				"-id": "Terrifying Strike",
				"-title": "Terrifying Strike",
				"-description": "Your touch spreads fear.",
				"Prerequisites": "Despair special ability, mummy.",
				"Benefit": [ "Any creature struck by your slam attack must succeed at a Will save at the same DC as your despair ability or be shaken for 1d4 rounds. If the creature is already shaken, frightened, or panicked, it is paralyzed for 1 round instead. This is a mind-affecting fear effect." ]
			},
			{
				"-id": "Terrorizing Display",
				"-title": "Terrorizing Display",
				"-groups": "Combat,Hobgoblin",
				"-description": "...",
				"Prerequisites": "Dazzling Display, Demoralizing Lash, Taskmaster, Weapon Focus, Intimidate 10 ranks, Hobgoblin, proficiency with selected weapon.",
				"Benefit": [ "When you use Dazzling Display, in addition to its normal effects, you can use it to spur allies within 30 feet as if you had used the Taskmaster feat. Use the same Intimidate check to determine the effects of Dazzling Display and this feat." ]
			},
			{
				"-id": "Thanatopic Spell",
				"-title": "Thanatopic Spell",
				"-groups": "Metamagic",
				"-description": "Your spells can pierce wards against negative energy and even affect undead targets.",
				"Prerequisites": "Knowledge (religion) 6 ranks, Spell Focus (necromancy).",
				"Benefit": [
					"A thanatopic spell pierces defenses and immunities that protect against death effects, negative levels, and energy drain, affecting the target as if the protective barrier did not exist.",
					"For example, you could cast a thanatopic vampiric touch or enervation spell on a target under the effects of death ward, and the target would suffer the normal effect of the spell. Saving throws and SR (if any) still apply. Undead are susceptible to spells augmented by this feat, as it retunes the negative energy to be harmful to them. A thanatopic spell that would kill a living creature (such as by giving it negative levels equal to its Hit Dice) destroys an undead (though undead such as ghosts, liches, and vampires may reform as normal). Undead affected by thanatopic spells that give negative levels automatically make their saving throws to remove negative levels after 24 hours.",
					"Level Increase: +2 (a thanatopic spell uses up a spell slot two levels higher than the spell's actual level.)"
				],
				"Normal": [ "Defenses such as death ward negate death effects, negative levels, and energy drain. Undead are immune to these attacks." ]
			},
			{
				"-id": "Theurgy",
				"-title": "Theurgy",
				"-description": "You can blend the power of arcane and divine magic.",
				"Prerequisites": "Wis 13, Int or Cha 13, able to cast 1st-level arcane spells, able to cast 1st-level divine spells.",
				"Benefit": [
					"You can augment the power of your divine spells with arcane energy and augment your arcane spells with divine energy.",
					"When casting a divine spell, you may sacrifice an arcane spell slot or arcane prepared spell of that spell's level or higher as a swift action. The caster level for that divine spell increases by +1.",
					"When casting an arcane spell, you may sacrifice a divine spell slot or prepared divine spell of the same or higher level as a swift action. Half the damage dealt by the arcane spell becomes holy (if you channel positive energy) or unholy (if you channel negative energy)."
				]
			},
			{
				"-id": "Third Eye",
				"-title": "Third Eye",
				"-description": "You possess and can open a third eye that permits you to see things as they really are and gain greater insight into auras.",
				"Prerequisites": "Psychic Sensitivity or ability to cast psychic spells.",
				"Benefit": [
					"Once per day as a standard action, you can open a spiritual third eye positioned on your forehead between and above your normal eyes. You can keep this eye open for up to 1 minute per character level you possess. This duration doesn't have to be consecutive, but it must be used in 1-minute increments. Once per day while your third eye is open, you can use the read aura occult skill unlock after 1 minute of intense concentration. This is in addition to the normal daily use of read aura (which still takes 10 minutes). While your third eye is open, you gain a +4 bonus on Perception checks to read auras, as well as a +8 bonus on Perception checks to detect invisible creatures or objects or see through magical disguises (both illusory ones and those provided by the change shape ability or polymorph magic).",
					"When you close your third eye, either voluntarily or at the end of the time limit, you are fatigued for an amount of time equal to the length of time you kept your third eye open."
				],
				"Normal": "Without this feat, you must spend 10 minutes in intense concentration to read one of a creature or item's four auras, and you can do so only once per day.",
				"Special": [ "You can take this feat multiple times. Its effects don't stack. Each time you take the feat, you increase the number of times per day you can open your third eye (and read an aura) by one." ]
			},
			{
				"-id": "Thoughtful Discernment",
				"-title": "Thoughtful Discernment",
				"-description": "Thinking back, you discover a lie in what you once thought to be words of truth.",
				"Prerequisites": "Discern lies class feature.",
				"Benefit": [ "Once per day as a free action, you can think back about a single statement you heard in the last day and determine if it was a lie. This acts like the discern lies spell, but instead of affecting a creature, it affects a single statement a creature has made. For example, if the king told you, “My daughter is in the monster's dungeon” before you left to find her, as long as the king said that to you within the past day, you can use this feat to determine whether or not the king deliberately and knowingly lied to you when he made that statement." ]
			},
			{
				"-id": "Thousand Cuts",
				"-title": "Thousand Cuts",
				"-groups": "Combat, Combination",
				"-description": "Your attacks are calculated to draw the most blood possible. With every swing, you open persistent, vicious wounds that drain the life from your enemies.",
				"Prerequisites": "Weapon Focus with slashing weapon.",
				"Benefit": [ "When you deal damage with a melee attack with a slashing weapon to an opponent you have already damaged this round, you can also deal 1 point of bleed damage that lasts for 2 rounds. This bleed damage stacks with itself, but only if dealt in the same round." ]
			},
			{
				"-id": "Threatening Illusion",
				"-title": "Threatening Illusion",
				"-groups": "Metamagic",
				"-description": "You've mastered the art of making illusions that force foes to divide their attention in combat.",
				"Prerequisites": "Spell Focus (illusion), gnome.",
				"Benefit": [
					"You can use this metamagic feat only on illusion (figment) spells.",
					"A threatening illusion spell causes one target to believe your illusion is a threat. Choose one 5-foot square within the area of your illusion; that square threatens the target as long as it is adjacent. Thus, if you or an ally is on the opposite side of the target, it is considered flanking. Normally the area must contain an illusory creature of Small or Medium size. However, you can select one square of a larger illusory creature to threaten the target. For example, an illusory Large ogre takes up four 5-foot squares; you select one square to be the source of the threat, and its other three squares do not threaten anyone. If the target has reason to believe there is an invisible creature in the vicinity, even an auditory illusion with no visual elements (such as ghost sound) is sufficient to convince the target that the selected square contains an actual threat. As long as you maintain the illusion, you can change the location of the threatening square as a swift action. When you threaten a target with this spell, the foe may make a Will save to disbelieve (DC 10 + threatening spell's level + your spellcasting ability score modifier). If the target makes this save, the threatening effect of this feat no longer applies to it.Level Increase: +1 (a threatening illusion takes up a spell slot one level higher than normal.)"
				],
				"Normal": "Illusion spells do not threaten squares."
			},
			{
				"-id": "Threatening Negotiator",
				"-title": "Threatening Negotiator",
				"-description": "Those who you intimidate know that you'll go through with your threats.",
				"Prerequisites": "Nerve-Racking Negotiator, Persuasive, Skill Focus (Intimidate).",
				"Benefit": [ "When you successfully use the Intimidate skill to force an opponent to act friendly toward you, the duration of the attitude change lasts 2d6 hours." ],
				"Normal": [ "Changing an opponent's attitude with Intimidate normally changes the foe's attitude to friendly for 1d6×10 minutes." ]
			},
			{
				"-id": "Threnodic Spell",
				"-title": "Threnodic Spell",
				"-groups": "Metamagic",
				"-description": "You can convert mind-affecting magic to necromantic power capable of controlling undead.",
				"Prerequisites": "Knowledge (religion) 6 ranks, Spell Focus (necromancy).",
				"Benefit": [
					"This feat only works on mind-affecting spells. A threnodic spell affects undead creatures (even mindless undead) as if they weren't immune to mind-affecting effects, but has no effect on living creatures.",
					"Level Increase: +2 (a threnodic spell uses up a spell slot two level higher than the spell's actual level.)"
				],
				"Normal": [ "Undead are immune to mind-affecting effects." ]
			},
			{
				"-id": "Thrill of the Hunt",
				"-title": "Thrill of the Hunt",
				"-groups": "Combat",
				"-description": "The pursuit of prey invigorates you. You revel in tracking down and slaying your quarry.",
				"Prerequisites": "Survival 1 rank; base attack bonus +4 or track class feature.",
				"Benefit": [
					"Once per day, when you succeed at a Survival check to find or follow a creature's tracks, you can designate that creature to be your prize for a number of hours equal to 4 + your ranks in Survival. You gain a +2 morale bonus on Survival checks to follow your prize's tracks and on weapon damage rolls against your prize.",
					"If you find and subsequently render your prize dead or helpless, you gain a +2 morale bonus on attack rolls, saves, and skill checks for a number of hours equal to your ranks in Survival."
				],
				"Special": [ "An animal companion can choose this feat as if it were an animal feat." ]
			},
			{
				"-id": "Thrill of the Kill",
				"-title": "Thrill of the Kill",
				"-groups": "Orc/Half-Orc",
				"-description": "...",
				"Prerequisites": "Half-orc or orc, rage class feature.",
				"Benefit": [ "When you are raging and your attack reduces an enemy to negative hit points or kills it, you regain 1 round of rage. You may only use this feat if the fallen enemy had at least as many Hit Dice as you. You can only gain this benefit once per round." ]
			},
			{
				"-id": "Thrilling Vengeance",
				"-title": "Thrilling Vengeance",
				"-groups": "Combat, Performance",
				"-description": "Your savage rage thrills the crowd as you turn it upon a foe that has harmed you.",
				"Prerequisites": "Base attack bonus +3, rage class feature",
				"Benefit": [
					"When you spend a swift action to attempt a performance combat check while you're raging, you gain a +2 bonus on the check if the trigger involved you dealing damage to a creature that had hit you within the last round.",
					"Combat Trick",
					"Note If using the optional Stamina Pool rules, the following trick may be used with this feat.",
					"Combat Trick: You can spend 3 stamina points to increase the bonus on performance combat checks that you gain from Thrilling Vengeance by 2."
				]
			},
			{
				"-id": "Throat Slicer",
				"-title": "Throat Slicer",
				"-groups": "Combat",
				"-description": "Sometimes the only way to deal with those who see your illicit activities is to get rid of them.",
				"Prerequisites": "Base attack bonus +1.",
				"Benefit": [ "When using a one-handed, light, or natural weapon, you can deliver a coup de grace to an unconscious, bound, or pinned target (though not other kinds of helpless targets) as a standard action." ]
			},
			{
				"-id": "Throw Anything",
				"-title": "Throw Anything",
				"-groups": "Combat",
				"-description": "You are used to throwing things you have on hand.",
				"Benefit": [ "You do not suffer any penalties for using an improvised ranged weapon. You receive a +1 circumstance bonus on attack rolls made with thrown splash weapons." ],
				"Normal": [ "You take a -4 penalty on attack rolls made with an improvised weapon." ]
			},
			{
				"-id": "Throw Back Arrows",
				"-title": "Throw Back Arrows",
				"-groups": "Combat",
				"-description": "When you catch arrows and other ranged ammunition, you can immediately hurl them at your enemies.",
				"Prerequisites": "Dex 17, Deflect Arrows, Improved Unarmed Strike, Snatch Arrows.",
				"Benefit": [
					"When using the Snatch Arrows feat, you can throw a caught piece of ranged ammunition (such as an arrow, bolt, or sling bullet, but not a firearm bullet) as though it were a thrown weapon with a range increment of 20 feet (even though it isn't your turn). The thrown ammunition deals the normal amount of damage for its type plus your Strength modifier, and you don't take a penalty for throwing a weapon that isn't designed to be thrown. This attack provokes attacks of opportunity as normal.",
					"You must have at least one hand free (holding nothing) to use this feat."
				]
			},
			{
				"-id": "Thunder and Fang",
				"-title": "Thunder and Fang",
				"-groups": "Combat",
				"-description": "You have mastered the ancient Thunder and Fang fighting style, allowing you to fight with increased effectiveness when wielding an earth breaker and klar.",
				"Prerequisites": "Str 15, Two-Weapon Fighting, Weapon Focus (earth breaker), Weapon Focus (klar)",
				"Benefit": [ "You can use an earth breaker as though it were a one-handed weapon. When using an earth breaker in one hand and a klar in your off hand, you retain the shield bonus your klar grants to your Armor Class even when you use it to attack. Treat your klar as a light weapon for the purposes of determining your two-weapon fighting penalty." ],
				"Normal": [ "An earth breaker is a two-handed weapon, preventing the use of a klar in one hand without imposing penalties for using the earth breaker one-handed. A klar can be used either as a one-handed weapon or a shield; it does not grant a bonus to AC during rounds in which it is used as a weapon." ]
			},
			{
				"-id": "Thundering Spell",
				"-title": "Thundering Spell",
				"-groups": "Metamagic",
				"-description": "You can conjure your spells into existence with blaring thunder or fearful shrieks, deafening creatures damaged by their effects.",
				"Benefit": [
					"You can modify a spell to deafen a creature damaged by the spell. When a creature takes damage from this spell, it becomes deafened for a number of rounds equal to the original level of the spell. If the spell allows a saving throw, a successful save negates the deafening effect. If the spell does not allow a save, the target can make a Fortitude save to negate the deafening effect. If the spell effect also causes the creature to become deafened, the duration of this metamagic effect is added to the duration of the spell.",
					"Level Increase: +2 (a thundering spell uses up a spell slot two levels higher than the spell's actual level.)Spells that do not inflict damage do not benefit from this feat."
				]
			},
			{
				"-id": "Tiger Claws",
				"-title": "Tiger Claws",
				"-groups": "Combat",
				"-description": "You can sacrifice multiple attacks to make a single devastating strike.",
				"Prerequisites": "Improved Unarmed Strike, Tiger Style, base attack bonus +6 or monk level 5th.",
				"Benefit": [
					"While you are using the Tiger Style feat and have both hands free, you can use a full-round action to make a single unarmed strike with both hands.",
					"Use your highest base attack bonus, rolling unarmed strike damage for each hand separately and multiplying both if you score a critical hit.",
					"If you use Power Attack in conjunction with this attack,increase your Strength bonus on one of the damage rollsby an additional one-half your Strength bonus.",
					"If you hit, you can attempt a bull rush maneuver with a +2 bonus on the combat maneuver check. This bull rush attempt provokes no attack of opportunity from your opponent, but you cannot move with that opponent if your bull rush is successful."
				]
			},
			{
				"-id": "Tiger Pounce",
				"-title": "Tiger Pounce",
				"-groups": "Combat",
				"-description": "Your unarmed strikes are as precise as they are powerful, but they leave you open and you can pursue foes with blinding speed.",
				"Prerequisites": "Improved Unarmed Strike, Power Attack, Tiger Claws, Tiger Style, base attack bonus +9 or monk level 8th.",
				"Benefit": [ "While using the Tiger Style feat, you can apply the penalty from Power Attack to your AC instead of attack rolls. Additionally, once per round as a swift action, you can move up to half your speed closer to a target you hit with an unarmed strike or made a successful combat maneuver against on this turn or your last turn." ]
			},
			{
				"-id": "Tiger Style",
				"-title": "Tiger Style",
				"-groups": "Combat,Style",
				"-description": "Your unarmed fighting style emulates the strength and ferocity of a tiger.",
				"Prerequisites": "Improved Unarmed Strike, base attack bonus +3 or monk level 3rd.",
				"Benefit": [ "While using this style, you gain a +2 bonus to your CMD against bull rush, overrun, and trip maneuvers. You can also deal slashing damage with your unarmed strikes. Whenever you score a critical hit with your slashing unarmed strike, your opponent also takes 1d4 points of bleed damage at the start of his next two turns." ],
				"Normal": [ "Unarmed strikes deal bludgeoning damage." ]
			},
			{
				"-id": "Timely Coordination",
				"-title": "Timely Coordination",
				"-groups": "Teamwork",
				"-description": "You can precisely time your teamwork.",
				"Benefit": [ "You gain a +1 bonus on attack rolls and skill checks made as part of readied actions triggered by one of your allies who also has this feat. When you and an ally who also has this feat are attempting to overcome separate simultaneous obstacles as part of a heist or infiltration, you also gain this +1 bonus on attack rolls and skill checks." ]
			},
			{
				"-id": "Tiring Critical",
				"-title": "Tiring Critical",
				"-groups": "Combat",
				"-description": "Your critical hits cause opponents to become fatigued.",
				"Prerequisites": "Critical Focus, base attack bonus +13.",
				"Benefit": [ "Whenever you score a critical hit, your opponent becomes fatigued. This feat has no additional effect on a fatigued or exhausted creature." ],
				"Special": [ "You can only apply the effects of one critical feat to a given critical hit unless you possess Critical Mastery." ]
			},
			{
				"-id": "Titan Strike",
				"-title": "Titan Strike",
				"-groups": "Mythic",
				"-description": "Your fists can fell titanic foes.",
				"Prerequisites": "Improved Unarmed Strike (mythic).",
				"Benefit": [ "Your unarmed strike deals damage as if you were one size category larger. You also gain a +1 bonus for each size category that your target is larger than you on the following: bull rush, drag, grapple, overrun, sunder, and trip combat maneuver checks and the DC of your Stunning Fist." ]
			},
			{
				"-id": "Titan's Tangle",
				"-title": "Titan's Tangle",
				"-groups": "Combat",
				"-description": "Even creatures much bigger than you can lose their balance when you apply the appropriate leverage.",
				"Prerequisites": "Int 13, Combat Expertise, Improved Trip, Tangled Limbs, Weapon Focus with the chosen weapon.",
				"Benefit": [ "Choose one weapon with the reach special quality. When you attempt a trip combat maneuver check with the chosen weapon, you can try to trip creatures that are up to two size categories larger than you. If you have the Greater Weapon Focus feat with the chosen weapon, you can attempt to trip creatures up to three size categories larger than you are." ],
				"Normal": [ "You can trip only an opponent who is no more than one size category larger than you." ],
				"Special": [ "In addition to the chosen weapon, a character with the weapon training class feature can use Titan's Tangle with any melee weapon from any fighter weapon group that he has selected with weapon training and that has the reach special quality." ]
			},
			{
				"-id": "To the Last",
				"-title": "To the Last",
				"-groups": "Combat",
				"-description": "Your devotion to battle inspires you to fight competently until death claims you.",
				"Prerequisites": "Diehard, Endurance, worshiper of a god of battle",
				"Benefit": [
					"When you are disabled, you are not staggered, though performing standard actions still deals 1 point of damage to you. Taking a full-round action deals 2 points of damage to you.",
					"Combat Trick",
					"Note If using the optional Stamina Pool rules, the following trick may be used with this feat.",
					"Combat Trick: You can spend 1 stamina when disabled to take a standard action without losing a hit point."
				]
			},
			{
				"-id": "Topple Foe",
				"-title": "Topple Foe",
				"-groups": "Combat,Teamwork",
				"-description": "You and your allies can work together to trip larger foes.",
				"Prerequisites": "Combat Expertise, Improved Trip.",
				"Benefit": [
					"If you attempt to trip a foe that is larger than you, you gain a +1 bonus on your CMB check to trip the foe as long as an ally with Topple Foe is flanking the foe with you. If multiple allies with Topple Foe are flanking the foe with you, you gain an additional +2 bonus on your CMD check for each additional ally that's flanking the target. The bonuses granted by this feat stack with those granted by Improved Trip and Greater Trip.",
					"Each time you attempt to trip the same foe in consecutive rounds, the bonus granted to your trip attempt increases by +1 per ally, to a maximum bonus of +4 per flanking ally on the 4th round of consecutive trip attempts."
				]
			},
			{
				"-id": "Toppling Pileup",
				"-title": "Toppling Pileup",
				"-groups": "Combat",
				"-description": "When you trip one opponent, its fall might take the legs out from under another creature.",
				"Prerequisites": "Int 13, Combat Expertise, Improved Trip.",
				"Benefit": [ "As a standard action, you can attempt a single trip combat maneuver check at your full base attack bonus against a foe within reach. If you succeed, the target is knocked prone as normal and you can attempt an additional trip combat maneuver check (using your full base attack bonus) against a foe that is adjacent to the first target and also within reach. You can attempt only one additional combat maneuver per round with this feat." ]
			},
			{
				"-id": "Toppling Spell",
				"-title": "Toppling Spell",
				"-groups": "Metamagic",
				"-description": "Your spells with the force descriptor knock the affected creatures prone.",
				"Benefit": [
					"The impact of your force spell is strong enough to knock the target prone. If the target takes damage, fails its saving throw, or is moved by your force spell, make a trip check against the target, using your caster level plus your casting ability score bonus (Wisdom for clerics, Intelligence for wizards, and so on). This does not provoke an attack of opportunity. If the check fails, the target cannot attempt to trip you or the force effect in response.",
					"A toppling spell only affects spells with the force descriptor.",
					"Level Increase: +1 (a toppling spell uses up a spell slot one level higher than the spell's actual level.)"
				]
			},
			{
				"-id": "Torch Fighter",
				"-title": "Torch Fighter",
				"-groups": "Combat",
				"-description": "You can make use of a torch as a deadly, mace-like weapon.",
				"Benefit": [ "You treat a torch as a light weapon that deals bludgeoning damage equal to that of a light mace of its size plus 1 point of fire damage, and you do not incur penalties as you would for using it as an improvised weapon." ],
				"Normal": [
					"A torch used in combat is treated as a one-handed improvised weapon that deals bludgeoning damage equal to that of a gauntlet of its size plus 1 point of fire damage.",
					"Combat Trick",
					"Note If using the optional Stamina Pool rules, the following trick may be used with this feat.",
					"Combat Trick: By spending 2 stamina points when you hit an opponent with a torch, you can increase the amount of fire damage dealt by the torch to 1d4."
				]
			},
			{
				"-id": "Torrid Tolerance",
				"-title": "Torrid Tolerance",
				"-description": "You relish hot climates, as the equatorial heat does not sap your strength.",
				"Prerequisites": "Desert Dweller or Jungle Survivalist.",
				"Benefit": [ "You treat hot environments as though they were one step less severe; if you have a similar ability from another feat (like Desert Dweller), the benefits stack and you treat hot conditions as if they were two steps less severe. You do not take a penalty on Constitution checks for wearing armor in hot climates." ]
			},
			{
				"-id": "Totem Spirit",
				"-title": "Totem Spirit",
				"-description": "You are mystically tied to your tribe's sacred totem.",
				"Prerequisites": "Member of a primitive tribe.",
				"Benefit": [
					"The benefit granted by this feat depends on which tribe you belong to:",
					"Moon Clan: You gain a +1 bonus on Will saves and a +2 bonus on Perception checks.",
					"Axe Clan: If you have the rage ability, you can rage for 3 additional rounds per day. You also gain a +2 bonus on Intimidate checks.",
					"Hawk Clan: You gain a +2 bonus on Initiative checks and a +2 bonus on Ride checks.",
					"Spire Clan: You gain a +1 bonus on Fortitude saves and a +2 bonus on Perception checks.",
					"Sun Clan: You gain a +1 bonus on Reflex saves and a +2 bonus on Acrobatics checks.",
					"Skull Clan: You gain a +2 bonus on weapon damage against undead and a +2 bonus on Heal checks.",
					"Wind Clan: Your base land speed increases by 5 feet. You also gain a +2 bonus on Acrobatics checks."
				]
			},
			{
				"-id": "Totemic Disciple",
				"-title": "Totemic Disciple",
				"-description": "Your understanding of your barbaric totem flourishes as your combat prowess grows.",
				"Prerequisites": "Str 15; Dex 13; Athletic, Totemic Initiate; base attack bonus +9; no barbarian totem rage powers except those chosen with this feat or Totemic Initiate; nonlawful alignment.",
				"Benefit": [ "Choose one barbarian totem rage power that requires that you have the totem rage power you selected with Totemic Initiate. While gaining the benefits of Totemic Initiate, you also gain the benefits of this new rage power." ]
			},
			{
				"-id": "Totemic Initiate",
				"-title": "Totemic Initiate",
				"-description": "You were born to or have lived among the barbarian tribes of the wild and passed the trials of their sacred totems.",
				"Prerequisites": "Str 13; Dex 13; Athletic; base attack bonus +5; no barbarian totem rage powers except the one you choose with this feat; nonlawful alignment.",
				"Benefit": [ "Choose one barbarian lesser totem rage power (such as lesser beast totem). As a swift action, you can gain the benefits of that rage power as though you were raging. For the purpose of determining that rage power's effects, your barbarian level is equal to your base attack bonus. You do not gain any other benefits or penalties of rage. You can gain these benefits for a number of rounds per day equal to your base attack bonus plus your Constitution modifier; these rounds do not need to be consecutive." ]
			},
			{
				"-id": "Totemic Master",
				"-title": "Totemic Master",
				"-description": "Through both might of arms and spiritual wisdom, you have attained full understanding of your barbaric totem.",
				"Prerequisites": "Str 17; Dex 13; Wis 13; Athletic; Totemic Disciple; Totemic Initiate; base attack bonus +13; no barbarian totem rage powers except those chosen with this feat, Totemic Disciple, or Totemic Initiate; nonlawful alignment.",
				"Benefit": [ "Choose one greater totem rage power that requires the totem rage power you chose with Totemic Disciple. While gaining the benefits of Totemic Initiate, you also gain the benefits of this new rage power as well as the one you chose with Totemic Disciple. If you gain the pounce ability this way, you can make only natural attacks using your pounce ability." ]
			},
			{
				"-id": "Touch of Evil",
				"-title": "Touch of Evil",
				"-description": "You instill unbidden thoughts and desires into another with your touch.",
				"Prerequisites": "Channel negative energy 6d6, evil alignment.",
				"Benefit": [ "As a standard action, you can expend three uses of your channel negative energy and make a melee touch attack against a target. You can attempt an opposed Sleight of Hand check against the target's Perception to make this attack without the target noticing. If the attack hits, the target gets a Will save (DC=10 + 1/2 your character level + your Charisma modifier). On a failed save, you implant a suggestion into the creature's mind. This works similar to the suggestion spell, however, you can suggest to the creature to commit a harmful or destructive act against another creature or object. If you choose the latter, the creature attempts to carry out the suggestion in 1d6+1 days as it thinks over the suggestion and plans it out. The creature can attempt another Will save at the original DC to resist the suggestion right before it carries it out. If it fails the save, it gains a +4 circumstance bonus on one die roll used in carrying out the suggestion. This relentless planning causes the creature 1 point of Wisdom damage (or 1d6 sanity damage, if you are using that system), until the suggestion is carried out." ]
			},
			{
				"-id": "Touch of Serenity",
				"-title": "Touch of Serenity",
				"-groups": "Combat",
				"-description": "With a single touch you can reduce the threat of even the most savage of foes.",
				"Prerequisites": "Wis 18, Improved Unarmed Strike, base attack bonus +8.",
				"Benefit": [ "You must declare that you are using this feat before you make your attack roll (thus a failed attack roll ruins the attempt). On a successful hit, the attack deals no damage and bestows no other effect or condition, but the target cannot cast spells or attack (including attacks of opportunity and attacks as immediate actions) for 1 round unless it succeeds on a Will saving throw with a DC of 10 + 1/2 your character level + your Wisdom modifier. You may attempt a touch of serenity once per day for every four levels you have attained (but see Special), and no more than once per round." ],
				"Special": [ "A monk of the lotus receives Touch of Serenity as a bonus feat at 1st level, even if he does not meet the Prerequisites. A monk may attempt a touch of serenity a number of times per day equal to his monk level, plus one more time per day for every four levels he has in classes other than monk." ]
			},
			{
				"-id": "Toughness",
				"-title": "Toughness",
				"-description": "You have enhanced physical stamina.",
				"Benefit": [ "You gain +3 hit points. For every Hit Die you possess beyond 3, you gain an additional +1 hit point. If you have more than 3 Hit Dice, you gain +1 hit points whenever you gain a Hit Die (such as when you gain a level)." ]
			},
			{
				"-id": "Tower Shield Proficiency",
				"-title": "Tower Shield Proficiency",
				"-groups": "Combat",
				"-description": "You are trained in how to properly use a tower shield.",
				"Prerequisites": "Shield Proficiency.",
				"Benefit": [ "When you use a tower shield, the shield's armor check penalty only applies to Strength and Dexterity-based skills." ],
				"Normal": [ "A character using a shield with which he is not proficient takes the shield's armor check penalty on attack rolls and on all skill checks that involve moving, including Ride." ],
				"Special": [ "Fighters automatically have Tower Shield Proficiency as a bonus feat. They need not select it." ]
			},
			{
				"-id": "Toxic Recovery",
				"-title": "Toxic Recovery",
				"-groups": "Dwarf",
				"-description": "...",
				"Prerequisites": "Dwarf, hardy racial trait.",
				"Benefit": [ "Whenever you succeed at a saving throw against poison, you heal 1 point of ability damage of the type dealt by the poison. Whenever you heal ability damage naturally or magically, you heal 1 additional point of ability damage. This feat has no effect on penalties to ability scores or ability drain." ]
			},
			{
				"-id": "Toxic Spell",
				"-title": "Toxic Spell",
				"-groups": "Metamagic",
				"-description": "You can infuse a spell with the power of a poison.",
				"Prerequisites": "Craft (poison) 5 ranks, ability to cast 2nd-level spells, poison use class feature.",
				"Benefit": [
					"You can use 1 dose of contact, ingested, inhaled, or injury poison as an additional material component for a spell you cast. This spell gains the poison descriptor. Select a single creature affected by the spell. If that creature fails its saving throw against the spell, it must also attempt a saving throw against the poison used as a material component. If the target fails the save against the poison, the poison takes effect immediately, ignoring any onset time. The poison uses its save DC (rather than the save DC of the spell), but is modified by any effects that increase the spell's DC (such as Spell Focus). This feat works only with spells whose effects can be negated by a successful Fortitude save.",
					"Level Increase: +1 (a toxic spell uses up a spell slot 1 level higher than the spell's actual level.)"
				]
			},
			{
				"-id": "Toxic Spray",
				"-title": "Toxic Spray",
				"-groups": "Combat",
				"-description": "You produce enough venom to cast a web of poison over your hapless victims.",
				"Prerequisites": "Spit Venom, Viscous Venom, nagaji.",
				"Benefit": [ "When you spit poison using the ability granted by the Spit Venom feat, you can envenom a 5-foot-radius area within 30 feet for 1 round. Any creature that enters or begins its turn in this area is both exposed to the poison granted by Spit Venom and entangled as if you had targeted that creature with the ability granted by the Viscous Venom feat. In addition, you gain one additional use per day of the ability to spit poison granted by the Spit Venom feat." ]
			},
			{
				"-id": "Tracer Fire",
				"-title": "Tracer Fire",
				"-groups": "Combat",
				"-description": "You highlight the path of your projectile with light, allowing your allies to better spot the target.",
				"Prerequisites": "Point-Blank Shot, Precise Shot.",
				"Benefit": [ "As a standard action, you can make a single ranged attack at your highest base attack bonus with an illuminated throwing weapon or piece of ammunition, such as a flaming shuriken or an arrow imbued with a magical light effect. If the attack hits its target, attacks against the same target gain a +2 circumstance bonus for 1 round, so long as those attacks originate in dim light or darker areas. The target counts as being in bright light until the projectile is removed or extinguished. Removing the projectile is a move action that provokes an attack of opportunity." ]
			},
			{
				"-id": "Traditional Weapons",
				"-title": "Traditional Weapons",
				"-groups": "Combat",
				"-description": "You're a master of utilizing simple, time-trusted arms against strange or technological weapons.",
				"Prerequisites": "Int 13.",
				"Benefit": [ "You receive a +2 bonus on combat maneuver checks against creatures wielding exotic weapons, firearms, or technological weapons. You also receive a +2 bonus to your CMD whenever an opponent attempts any combat maneuver against you while wielding such a weapon. You gain these bonuses only if you are not wielding an exotic weapon, firearm, or technological weapon." ]
			},
			{
				"-id": "Train Plants",
				"-title": "Train Plants",
				"-description": "After years of practice, cautious experiments, or sheer stubbornness, you have gained the ability to teach unintelligent plant creatures to follow simple commands.",
				"Prerequisites": "Handle Animal 5 ranks, Knowledge (nature) 5 ranks.",
				"Benefit": [ "A character with this feat treats creatures of the plant type with Intelligence scores of 3 or lower as animals for the purposes of the Handle Animal skill. Plant creatures without an Intelligence score are treated as animals with an Intelligence of 1 for these purposes. Ordinary plants lack Wisdom and Charisma scores—they aren't creatures and can't be trained." ]
			},
			{
				"-id": "Trample",
				"-title": "Trample",
				"-groups": "Combat",
				"-description": "While mounted, you can ride down opponents and trample them under your mount.",
				"Prerequisites": "Ride 1 rank, Mounted Combat.",
				"Benefit": [ "When you attempt to overrun an opponent while mounted, your target may not choose to avoid you. Your mount may make one hoof attack against any target you knock down, gaining the standard +4 bonus on attack rolls against prone targets." ]
			},
			{
				"-id": "Trap Wrecker",
				"-title": "Trap Wrecker",
				"-groups": "Orc",
				"-description": "...",
				"Prerequisites": "Power Attack, Disable Device 1 rank, orc.",
				"Benefit": [ "You can attempt to disarm a trap by striking it with a melee weapon instead of making a Disable Device check. As a full-round action, make a melee attack against an Armor Class equal to the trap's Disable Device DC. If you miss, the trap activates. If you hit, roll damage. If this damage is at least half the trap's Disable Device DC, you disable the trap. If this damage is less than half the trap's Disable Device DC, the trap activates. You can only attempt this on non-magical traps. You must be able to reach some part of the trap with your attack in order to use this feat. At the GM's discretion, some traps may not be susceptible to this feat." ]
			},
			{
				"-id": "Trapper's Setup",
				"-title": "Trapper's Setup",
				"-description": "You have an instinct for waiting until just the right moment to spring a hazard or trap.",
				"Prerequisites": "Craft (traps) 5 ranks.",
				"Benefit": [ "When you manually trigger a trap against opponents, that trap receives either a +2 circumstance bonus on melee attack rolls or a +2 circumstance bonus to its saving throw DC." ]
			},
			{
				"-id": "Traumatic Spell",
				"-title": "Traumatic Spell",
				"-groups": "Metamagic",
				"-description": "Creatures harmed by your spells relive their torments in nightly terrors.",
				"Benefit": [
					"A traumatic spell causes lingering memories of pain and suffering in creatures harmed by it. When a creature fails a saving throw against a traumatic spell, the next time it sleeps it must succeed at a Will save with a DC equal to the original spell's DC or be affected as if by nightmare. Each time the target fails its save, it must save again the following night or be affected by another nightmare, though the save DC decreases by 2 each night after the first.",
					"This metamagic feat can be applied only to spells with the emotion or fear descriptor.",
					"Level Increase: +2 (a traumatic spell uses up a spell slot 2 levels higher than the spell's actual level."
				]
			},
			{
				"-id": "Tree Hanger",
				"-title": "Tree Hanger",
				"-groups": "Combat,Vanara",
				"-description": "...",
				"Prerequisites": "Acrobatics 1 rank, vanara.",
				"Benefit": [ "You gain a +2 bonus to your CMD against all trip attacks. If your square has a branch or other sturdy large object that you could hang from, as a swift action you may make a DC 15 Acrobatics check to jump upward and use your tail to hang from that object. While hanging, you can't be tripped, you ignore the effects of difficult terrain in your square, and you gain a +2 bonus to your CMD against bull rush, drag, and reposition attacks. If you leave that square (including if you are moved against your will), you lose your grip on the object and are no longer hanging. While hanging, you cannot use your tail for anything else." ]
			},
			{
				"-id": "Tree Leaper",
				"-title": "Tree Leaper",
				"-description": "You use the flexibility of tree branches to aid in making arboreal leaps.",
				"Benefit": [ "When you are in a tree, you count as having a running start when you jump." ],
				"Normal": [ "You must have at least 10 feet of space for a running start." ]
			},
			{
				"-id": "Trepanation",
				"-title": "Trepanation",
				"-description": "Through careful study and practice, you have learned how to relieve pressure in the brain to balance the humors, promote health, and ward off outside influence.",
				"Prerequisites": "Heal 5 ranks, Knowledge (arcana) 2 ranks.",
				"Benefit": [
					"You can perform the faith healing occult skill unlock even if you can't use psychic magic. If you can cast psychic spells or have the Psychic Sensitivity feat, you can use faith healing one additional time per day.",
					"So long as you have a healer's kit or surgeon's tools, you can spend 1 hour performing a full trepanation on a creature.This procedure requires a Heal check (DC = 20 + the target's Hit Dice). If you're successful, the target gains a +2 insight bonus on saving throws against curses, possession, and spells from the enchantment (compulsion) school. These effects persist for 1 day per character level you possess. If you fail the check, the target takes 1d3 points of Intelligence, Wisdom, and Charisma damage. You can perform this procedure on yourself, but the DC increases by 5."
				]
			},
			{
				"-id": "Triangulate",
				"-title": "Triangulate",
				"-groups": "Teamwork",
				"-description": "Your distrust of magic has forced you to develop tactics to fight witches, fey, and other supernatural foes. No matter how clever they think they are, they can't hide.",
				"Prerequisites": "Blind-Fight, Greater Blind-Fight, Improved Blind-Fight, Perception 15 ranks, human.",
				"Benefit": [ "Whenever both you and an ally who also has this feat are within 30 feet of an invisible foe of whose presence you're aware, you automatically pinpoint the foe's location. Whenever both you and an ally who has this feat are within 30 feet of a creature and you miss that creature because of its concealment, you can reroll your miss chance percentile roll." ]
			},
			{
				"-id": "Tribal Hunter",
				"-title": "Tribal Hunter",
				"-groups": "Combat,Teamwork",
				"-description": "From watching pack animals hunt, you learned to take down large prey as part of a group.",
				"Prerequisites": "Animal Affinity.",
				"Benefit": [ "When either you or an ally with this feat is adjacent to and flanking an opponent that is larger than either of you, you both are considered to be flanking the opponent as long as you remain adjacent to it." ],
				"Normal": [ "You must be positioned opposite an ally to flank an opponent." ]
			},
			{
				"-id": "Trick Riding",
				"-title": "Trick Riding",
				"-groups": "Combat",
				"-description": "You are not only skilled at controlling a horse in combat; you can make it look like art.",
				"Prerequisites": "Ride 9 ranks, Mounted Combat.",
				"Benefit": [ "While wearing light or no armor, you do not need to make Ride skill checks for any task listed in the Ride skill with a DC of 15 or lower. You do not take a -5 penalty for riding a mount bareback. You can make a check using Mounted Combat to negate a hit on your mount twice per round instead of just once." ]
			},
			{
				"-id": "Trick Shooter",
				"-title": "Trick Shooter",
				"-groups": "Combat",
				"-description": "Your uncanny aim allows you to disable your opponents without harming them.",
				"Prerequisites": "Dex 13, Deadly Aim, base attack bonus +1.",
				"Benefit": [ "You gain a +2 bonus on ranged combat maneuvers. When you attempt to perform a ranged combat maneuver, you can refrain from damaging the target at no penalty." ]
			},
			{
				"-id": "Trick Spell",
				"-title": "Trick Spell",
				"-groups": "Metamagic",
				"-description": "The vengeful nature of your goddess flows through your magic, turning your enemies against themselves.",
				"Prerequisites": "Ability to cast 1st-level spells, chaotic neutral alignment, worshiper of a deity of trickery, lust, and revenge.",
				"Benefit": [
					"Only enchantment spells that affect a single target and can be negated with a successful Will save can be trick spells. If the target fails its Will save against a trick spell, in addition to the spell's normal effects, the target also clumsily hinders itself. Immediately attempt a special combat maneuver check (1d20 + your caster level + your Charisma bonus) to perform a dirty trick combat maneuver against the target. Any feats you have that apply to dirty trick maneuvers (such as Greater Dirty Trick) also apply to this check.",
					"Level Increase: +1 (a trick spell takes up a spell slot 1 level higher than the spell's actual level.)"
				]
			},
			{
				"-id": "Tripping Staff",
				"-title": "Tripping Staff",
				"-groups": "Combat",
				"-description": "You can make a trip attack with your quarterstaff.",
				"Prerequisites": "Int 13, Combat Expertise, Improved Trip, Weapon Focus (quarterstaff ), base attack bonus +6.",
				"Benefit": [ "You treat quarterstaves as if they had the trip special feature." ],
				"Special": [ "If you are a magus with the staff magus archetype, you can use spellstrike on any trip combat maneuver you make with the staff." ]
			},
			{
				"-id": "Tripping Strike",
				"-title": "Tripping Strike",
				"-groups": "Combat",
				"Prerequisites": "Int 13, Combat Expertise, Improved Trip, base attack bonus +9.",
				"Benefit": [ "Whenever you score a critical hit with a melee attack, you can trip your opponent, in addition to the normal damage dealt by the attack. If your confirmation roll exceeds your opponent's CMD, you may knock your opponent prone as if from the trip combat maneuver. This does not provoke an attack of opportunity. If you are tripped during your own trip attempt, you can drop your weapon to avoid being tripped." ],
				"Normal": [ "You must perform a trip combat maneuver to trip an opponent." ],
				"Special": [ "You can only apply the effects of one of the following feats to a given critical hit: Bull Rush Strike, Disarming Strike, Repositioning Strike, Sundering Strike, or Tripping Strike. You may choose to use this feat after you make your confirmation roll." ]
			},
			{
				"-id": "Tripping Twirl",
				"-title": "Tripping Twirl",
				"-groups": "Combat",
				"-description": "You can make a trip attack with a quarterstaff on all adjacent enemies.",
				"Prerequisites": "Int 13, Combat Expertise, Improved Trip, Tripping Staff, Weapon Focus (quarterstaff ), Weapon Specialization (quarterstaff ), base attack bonus +12.",
				"Benefit": [ "As a full-round action, while wielding a quarterstaff two-handed, you can attempt a trip combat maneuver against each enemy adjacent to you." ],
				"Special": [ "If you are a magus with the staff magus archetype, you can use spellstrike on any one trip combat maneuver you make with the staff." ]
			},
			{
				"-id": "Triton Portal",
				"-title": "Triton Portal",
				"-groups": "Undine",
				"-description": "...",
				"Prerequisites": "Character level 5th, hydraulic push spell-like ability, undine.",
				"Benefit": [ "Once per day, you may expend your racial hydraulic push ability to instead cast summon nature's ally III as a spell-like ability with a caster level equal to your character level. This use of the ability can only summon 1d3 Small water elementals, 1d4+1 dolphins, a shark, or an electric eel. Using this ability is a full-round action." ]
			},
			{
				"-id": "Troth of the Forgotten Pharaoh",
				"-title": "Troth of the Forgotten Pharaoh",
				"-description": "You've pledged your body to a forgotten pharaoh, and are willing to sacrifice yourself to keep his secrets even in death.",
				"Prerequisites": "Must be a member of a cult of a forgotten pharaoh.",
				"Benefit": [
					"Upon taking this feat, you undergo a ritual wherein the cartouche of a pharaoh is carved into your flesh (typically on the chest or back), and then embellished with painful crimson and ocher tattoos. The ritual takes 1 hour to complete, and you take 3 points of damage from the wound (see Special, below). Upon completion of the ritual, you gain the feat's benefits.",
					"As an immediate action, or when you die, you can cause white-hot fire to burst from the tattooed cartouche on your flesh, immolating your body in a bright flash and instantly reducing it to ash. If you are still alive, you are immediately slain. Spells such as raise dead or speak with dead cannot be used on your remains, but your equipment is unaffected.As the fire consumes you, fiery snakes whip out of your body in a 5-foot-radius burst, dealing 1d6 points of fire damage + 1 point per character level. Creatures in the area can attempt a Reflex save to negate the damage (DC 10 + 1/2 your character level + your Constitution modifier). In addition, creatures within a 10-foot burst must succeed at a Fortitude save (DC 10 + 1/2 your character level + your Constitution modifier) or be blinded for 1 round. Blind or sightless creatures are unaffected by this blinding effect."
				],
				"Special": "You permanently lose 3 hit points when you take this feat. This damage can be healed only with a miracle or wish spell, but doing so causes you to lose all benefits of this feat."
			},
			{
				"-id": "True Breed",
				"-title": "True Breed",
				"-description": "Your dual heritage makes you something more than merely a mix of your parent races.",
				"Prerequisites": "Two subtypes, elf blood or orc blood racial trait.",
				"Benefit": [ "For the purposes of any effect related to subtype (such as a ranger's favored enemy and bane weapons), you count as neither of your subtypes, and you no longer count as either of your parent races for the purposes of effects related to race." ]
			},
			{
				"-id": "True Deception",
				"-title": "True Deception",
				"-description": "Time spent learning the mystic arts of disguise has given you insight into the anonymity of the everyday.",
				"Prerequisites": "Cha 17, Disguise 17 ranks, master disguise master ninja trick or master of disguise advanced rogue talent, ninja level 10th or rogue level 10th.",
				"Benefit": [ "When using the master disguise master ninja trick or master of disguise advanced rogue talent to take on the appearance of a specific individual, you can fool divination magic and effects designed to locate the subject of your disguise as per the vigilante's any guise social talent. In addition, you gain a +10 bonus on Bluff checks to act like that individual." ]
			},
			{
				"-id": "Truth in Wine",
				"-title": "Truth in Wine",
				"-description": "In refining your palate and experiencing the food, drink, and meal rituals of myriad cultures, you have learned to divine truths about human behavior and use intoxication to break down psychological barriers.",
				"Prerequisites": "Appraise 3 ranks.",
				"Benefit": [ "You can perform the psychometry occult skill unlock even if you can't use psychic magic, though you must consume a drink of high-quality alcohol (costing at least 10 gp per drink) to do so. If you can cast psychic spells or have the Psychic Sensitivity feat, you can use psychometry one additional time per day. If you consume a drink of high-quality alcohol, you gain a +2 circumstance bonus on Appraise and Sense Motive checks for 1 minute and can increase the caster level of the next divination spell you cast within 1 minute by 1. If you are addicted to alcohol, these bonuses increase by 1, but so too does the save DC for your addiction." ]
			},
			{
				"-id": "Tumbling Upset",
				"-title": "Tumbling Upset",
				"-groups": "Combat",
				"-description": "You nimbly dodge beneath your opponent, creating an opportunity to upend your foe.",
				"Prerequisites": "Int 13, Combat Expertise, Improved Trip, Acrobatics 7 ranks.",
				"Benefit": [ "When you succeed at an Acrobatics check to move through an enemy's space, you can spend a swift action to attempt a trip combat maneuver check against the opponent. Even if you fail this check by 10 or more, you do not fall prone." ],
				"Normal": [ "If you fail a trip combat maneuver check by 10 or more, you are knocked prone." ]
			},
			{
				"-id": "Tumultuous Spell",
				"-title": "Tumultuous Spell",
				"-groups": "Metamagic",
				"-description": "You can pour the churning chaos of the Maelstrom into your magic, causing foes to scatter unpredictably, pushed apart in random directions as the unknowable whims of chaos itself, bringing with it strange and unexpected sounds and flashes of unnatural color.",
				"Benefit": [
					"You can enhance any spell that targets a single creature to become a tumultuous spell. A creature hit by a tumultuous spell (if the spell requires an attack roll) or that fails its saving throw against a tumultuous spell immediately moves 1d4×5 feet in a random direction. This movement does not provoke attacks of opportunity. If this movement would force a creature into a solid object or another creature, the movement ends harmlessly just before impact.",
					"A tumultuous spell uses a spell slot 1 level higher than the spell's normal spell level. Spells with the lawful descriptor can't be tumultuous spells."
				]
			},
			{
				"-id": "Tunnel Rat",
				"-title": "Tunnel Rat",
				"-groups": "Ratfolk",
				"-description": "You are a master of fighting in confined spaces.",
				"Prerequisites": "Ratfolk, swarming racial trait.",
				"Benefit": [ "You count as one size smaller than normal for the purpose of squeezing." ]
			},
			{
				"-id": "Turbulent Takeoff",
				"-title": "Turbulent Takeoff",
				"-groups": "Combat",
				"-description": "When you take off, you create a burst of wind that keeps foes from attacking you.",
				"Prerequisites": "Fly 5 ranks.",
				"Benefit": [ "When you use your fly speed to leave the ground, you can create a blast of wind. Each creature that threatens you cannot make attacks of opportunities as you move away unless it succeeds at a Reflex save (DC = 10 + your skill ranks in Fly + your Dexterity modifier). A creature that fail this Reflex save by 10 or more is knocked prone. You must begin your move action standing on the ground to use this ability." ]
			},
			{
				"-id": "Turn Undead",
				"-title": "Turn Undead",
				"-description": "Calling upon higher powers, you cause undead to flee from the might of your unleashed divine energy.",
				"Prerequisites": "Channel positive energy class feature.",
				"Benefit": [ "You can, as a standard action, use one of your uses of channel positive energy to cause all undead within 30 feet of you to flee, as if panicked. Undead receive a Will save to negate the effect. The DC for this Will save is equal to 10 + 1/2 your cleric level + your Charisma modifier. Undead that fail their save flee for 1 minute. Intelligent undead receive a new saving throw each round to end the effect. If you use channel energy in this way, it has no other effect (it does not heal or harm nearby creatures)." ]
			},
			{
				"-id": "Twin Fang Lunge",
				"-title": "Twin Fang Lunge",
				"-groups": "Combat",
				"-description": "You strike with the force of a serpent's lunge.",
				"Prerequisites": "Dex 15; Quick Draw; Twin Fang Strike; Twin Fang Style; Two-Weapon Fighting; Acrobatics 8 ranks; base attack bonus +8 or monk level 8th.",
				"Benefit": [ "While using Twin Fang Style, you can spend a full-round action to move up to twice your speed and then use Twin Fang Strike as if you were taking the attack action." ]
			},
			{
				"-id": "Twin Fang Strike",
				"-title": "Twin Fang Strike",
				"-groups": "Combat",
				"-description": "You strike at your enemies with both weapons simultaneously.",
				"Prerequisites": "Dex 15; Quick Draw; Twin Fang Style; Two-Weapon Fighting; Acrobatics 6 ranks; base attack bonus +6 or monk level 6th.",
				"Benefit": [ "While using Twin Fang Style, when you take an attack action while wielding two daggers or two kama, you can strike with both your primary and off-hand weapons. If you do so, both attacks take a -4 penalty and you apply precision damage and effects that occur when you hit only once, even if you hit with both attacks." ]
			},
			{
				"-id": "Twin Fang Style",
				"-title": "Twin Fang Style",
				"-groups": "Combat,Style",
				"-description": "Your paired blades rend through armor.",
				"Prerequisites": "Dex 15, Quick Draw, Two-Weapon Fighting, base attack bonus +1, Acrobatics 1 rank.",
				"Benefit": [ "Each time you make a full attack wielding a pair of daggers or a pair of kama and hit a creature with both weapons, you reduce its armor bonus to AC by 1 until the beginning of your next turn. This reduction stacks to a minimum armor bonus of +0. For example, if you hit a creature wearing a chain shirt with two primary attacks and two off-hand attacks, you would reduce its armor bonus to AC from +4 to +2." ]
			},
			{
				"-id": "Twin Thunders",
				"-title": "Twin Thunders",
				"-groups": "Combat",
				"Prerequisites": "Dwarf or gnome, defensive training racial trait, Two-Weapon Fighting or flurry of blows class feature, Weapon Focus with both wielded weapons.",
				"Benefit": [ "Once per round, when wielding a bludgeoning weapon in each hand against a creature with the giant subtype, if you hit the creature with your off-hand weapon after you hit with your primary weapon, roll the damage dice for your off-hand weapon twice and add the results together before adding any bonuses. Such extra weapon damage dice are not multiplied on a critical hit." ]
			},
			{
				"-id": "Twin Thunders Flurry",
				"-title": "Twin Thunders Flurry",
				"-groups": "Combat",
				"-description": "Your dual bludgeoning strikes are especially deadly when you are fighting giants.",
				"Prerequisites": "Dwarf or gnome; defensive training racial trait; Improved Two-Weapon Fighting and Two-Weapon Fighting, or flurry of blows class feature; Twin Thunders; Weapon Focus with both wielded weapons; base attack bonus +6.",
				"Benefit": [ "You can trip a creature with the giant subtype of up to Huge size, and you gain a +2 bonus on damage rolls against creatures of the giant subtype. Further, each time you hit a creature of the giant subtype with your off-hand weapon after you hit that creature with your primary weapon, you can deal the extra off-hand weapon damage Twin Thunders grants you." ]
			},
			{
				"-id": "Twin Thunders Master",
				"-title": "Twin Thunders Master",
				"-groups": "Combat",
				"-description": "With thunderous simultaneous strikes, you can batter a mighty giant into submission.",
				"Prerequisites": "Dwarf or gnome; defensive training racial trait; Improved Two-Weapon Fighting and Two-Weapon Fighting, or flurry of blows class feature; Twin Thunders; Twin Thunders Flurry; Weapon Focus with both wielded weapons; base attack bonus +9.",
				"Benefit": [ "Whenever you deal an opponent extra damage with the Twin Thunders feat, that opponent is shaken for 1 round. You also force that opponent to succeed at a Fortitude saving throw (DC 10 + half your level + your Str modifier) or become staggered for 1 round. If you use this feat to render staggered an opponent that is already staggered, you daze that opponent instead. In a similar way, you can stun an opponent that is already dazed." ]
			},
			{
				"-id": "Twinned Feint",
				"-title": "Twinned Feint",
				"-groups": "Combat",
				"-description": "You can fool two opponents with a single feint.",
				"Prerequisites": "Cha 13.",
				"Benefit": [ "As a standard action, you can attempt to feint against a foe within your reach. If you succeed at the feint, you can make an additional feint attempt against a foe that is adjacent to the first one and also within reach. You can attempt only one additional feint per action with this feat. When you use this feat, you take a -2 penalty to your AC until your next turn." ],
				"Special": [ "If you have the Improved Feint feat, you can use this feat as a move action instead." ]
			},
			{
				"-id": "Twist Away",
				"-title": "Twist Away",
				"-description": "Your quick reflexes and dexterous movements make up for your lack of stamina.",
				"Prerequisites": "Evasion.",
				"Benefit": [ "While you are wearing light armor or no armor, if you are forced to attempt a Fortitude saving throw, you can use an immediate action to instead attempt a Reflex saving throw (at the same DC). If you succeed at this saving throw and the attack has a reduced effect on a successful save, you avoid the effect entirely. Whether the saving throw is successful or not, you are staggered until the end of your next turn. If you are prevented from becoming staggered, you can't use Twist Away, nor can you ignore the staggered condition from Twist Away or remove it early" ]
			},
			{
				"-id": "Two Weapon Drunkard Combat",
				"-title": "Two Weapon Drunkard Combat",
				"-groups": "Combat",
				"-description": "You effortlessly wield tankards in your off hand, and can use them to drink from and as deadly weapons in a battle with equal ease. Note This is associated with a specific deity.",
				"Prerequisites": [
					"Catch Off-Guard, Two-Weapon Fighting Benefit: When you wield a tankard as an improvised weapon in your off hand, it functions as a light mace, including for the purpose of determining the effects of feats like Weapon Focus. If you worship the associated deity, your off-hand tankard functions as a divine focus and does not interfere with somatic spell components.",
					"When you fight with two weapons and have the sickened condition, you do not apply the penalties from being sickened to attack rolls or weapon damage rolls."
				],
				"Normal": [ "A tankard wielded as an improvised weapon normally functions as a gauntlet." ]
			},
			{
				"-id": "Two-Fisted Drinker",
				"-title": "Two-Fisted Drinker",
				"-groups": "Mythic",
				"-description": "You can pound down drinks with amazing verve.",
				"Prerequisites": "Quick Draw.",
				"Benefit": [ "You can draw two potions or other beverages—mundane or magical—from a pouch, bandolier, or similar holder (but not from a backpack) as a move action. As a standard action, you can drink two potions or other beverages. You must have two free hands to use this feat." ]
			},
			{
				"-id": "Two-Handed Thrower",
				"-title": "Two-Handed Thrower",
				"-groups": "Combat",
				"-description": "You hurl weapons with both hands and with great force, sometimes using a whirling technique to send your weapon flying through the air at tremendous speeds.",
				"Prerequisites": "Str 15.",
				"Benefit": [ "Whenever you use two hands to throw a one-handed or two-handed weapon, you gain a bonus on damage rolls equal to 1-1/2 times your Strength bonus. Using two hands to throw any weapon requires only a standard action for you. If you also have the Quick Draw feat, you can throw two-handed weapons at your full normal rate of attacks." ],
				"Normal": [ "You add your Strength bonus on thrown weapon damage, regardless of available hands. Throwing a two-handed weapon is a full-round action." ]
			},
			{
				"-id": "Two-Weapon Defense",
				"-title": "Two-Weapon Defense",
				"-groups": "Combat",
				"-description": "You are skilled at defending yourself while dual-wielding.",
				"Prerequisites": "Dex 15, Two-Weapon Fighting.",
				"Benefit": [
					"When wielding a double weapon or two weapons (not including natural weapons or unarmed strikes), you gain a +1 shield bonus to your AC.",
					"When you are fighting defensively or using the total defense action, this shield bonus increases to +2."
				]
			},
			{
				"-id": "Two-Weapon Feint",
				"-title": "Two-Weapon Feint",
				"-groups": "Combat",
				"-description": "You use one weapon to distract your enemy while slipping another past his defenses.",
				"Prerequisites": "Dex 15, Int 13, Combat Expertise, Two-Weapon Fighting.",
				"Benefit": [ "While using Two-Weapon Fighting to make melee attacks, you can forgo your first primary-hand melee attack to make a Bluff check to feint an opponent." ]
			},
			{
				"-id": "Two-Weapon Fighting",
				"-title": "Two-Weapon Fighting",
				"-groups": "Combat",
				"-description": "You can fight with a weapon wielded in each of your hands. You can make one extra attack each round with the secondary weapon.",
				"Prerequisites": "Dex 15.",
				"Benefit": [ "Your penalties on attack rolls for fighting with two weapons are reduced. The penalty for your primary hand lessens by 2 and the one for your off hand lessens by 6. See Two-Weapon Fighting." ],
				"Normal": [
					"If you wield a second weapon in your off hand, you can get one extra attack per round with that weapon. When fighting in this way you suffer a -6 penalty with your regular attack or attacks with your primary hand and a -10 penalty to the attack with your off hand. If your off-hand weapon is light, the penalties are reduced by 2 each. An unarmed strike is always considered light.",
					"Editor's Note",
					"If you use Two-Weapon Fighting on your turn to attack with two weapons, do you also take that penalty on attacks of opportunity made before the start of your next turn? How long do the penalties last?",
					"No, the penalties end as soon as you have completed the full-attack action that allowed you to attack with both weapons. Any attacks of opportunity you make are at your normal attack bonus. Generally speaking, penalties on attacks made during your turn do not carry over to attacks of opportunity unless they specifically state otherwise (such as the penalty from using Power Attack).",
					"[Source]"
				]
			},
			{
				"-id": "Two-Weapon Grace",
				"-title": "Two-Weapon Grace",
				"-groups": "Combat",
				"-description": "You can fight using agility instead of brute strength, even while fighting with two weapons.",
				"Prerequisites": "Dex 15; Fencing Grace, Slashing Grace, or Starry Grace; Two-Weapon Fighting; Weapon Finesse.",
				"Benefit": [
					"You can gain the benefit of the Fencing Grace, Slashing Grace, or Starry Grace feats while fighting with two weapons. Your penalties from two-weapon fighting increase by 2 on all attack rolls you make when doing so, and you can't decrease the penalties to less than -2 even if other abilities would reduce the penalties further. Add 1/2 your Dexterity bonus to damage with your off-hand weapon instead of 1/2 your Strength modifier. If you attack without using your off-hand weapon, you can use the aforementioned feats despite your other hand being occupied.",
					"In addition, Two-Weapon Grace counts as Double Slice for the purposes of qualifying for the Two-Weapon Rend feat."
				],
				"Normal": [ "You gain no benefit from the listed feats if you don't have a free hand." ]
			},
			{
				"-id": "Two-Weapon Rend",
				"-title": "Two-Weapon Rend",
				"-groups": "Combat",
				"-description": "Striking with both of your weapons simultaneously, you can use them to deliver devastating wounds.",
				"Prerequisites": "Dex 17, Double Slice, Improved Two-Weapon Fighting, Two-Weapon Fighting, base attack bonus +11.",
				"Benefit": [
					"If you hit an opponent with both your primary hand and your off-hand weapon, you deal an additional 1d10 points of damage plus 1-1/2 times your Strength modifier. You can only deal this additional damage once each round.",
					"*Note: It has been stated in an FAQ that this feat should function as the Universal Monster Ability Rend. In this case, the damage amount is the 1d10 +1-1/2 times your Strength+Other modifiers, like Power Attack, Piranha Strike, sneak attack (if both triggering attacks were eligible for it as well), etc. Weapon damage modifiers, such as enhancements, those specifically stated to be weapon damage bonuses, like divine favor, etc. do not apply to the feat's bonus damage."
				]
			}
		]
	}
}