{
	"Bundles": {
		"Bundle": [
			{
				"-id": "Ice Climber",
				"-title": "Ice Climber",
				"-description": "You can move or clamber across slippery surfaces with great skill.",
				"Prerequisites": "Arctic Adaptation or Mountaineer; Climb 2 ranks.",
				"Benefit": [ "When moving across a slippery surface (including but not limited to icy surfaces), you gain a +5 bonus on Climb checks and on Acrobatics checks to maintain your balance. If you fail a Climb check, you fall only if you fail the check by 10 or more. You also gain a +5 bonus on Perception checks to notice an avalanche and a +2 circumstance bonus on Reflex saves to avoid an avalanche." ]
			},
			{
				"-id": "Iconoclast",
				"-title": "Iconoclast",
				"-groups": "Combat",
				"-description": "You know how to turn a deity's holy symbol into a weapon against her followers.",
				"Prerequisites": "Divine Defiance, Improved Sunder, Power Attack, Intimidate 3 ranks",
				"Benefit": [ "When you succeed at a sunder combat maneuver against a holy or unholy symbol, you can attempt an Intimidate check to demoralize as a free action. This demoralization affects all followers of the deity or philosophy whose symbol you sundered who saw you sunder it and are within 30 feet. If you destroyed the symbol, you gain a +5 bonus on your Intimidate check. You can use this feat when sundering any physical holy symbol - it doesn't have to be the hand-held variety commonly used by clerics and other divine spellcasters." ]
			},
			{
				"-id": "Illusion Mastery",
				"-title": "Illusion Mastery",
				"-groups": "Item Mastery",
				"-description": "You can weave figments with illusion magic items.",
				"Prerequisites": "Use Magic Device 2 ranks, base Fortitude save bonus +4.",
				"Benefit": [
					"You can cause an item that has an illusion spell of 1st level or higher in its construction requirements to cast minor image.",
					"You can use this feat once per day, plus an additional time per day at base Fortitude save bonus +6, +8, +10, and +12."
				]
			},
			{
				"-id": "Illusive Gnome Bewilderment",
				"-title": "Illusive Gnome Bewilderment",
				"-groups": "Combat",
				"-description": "You can use your gnome weapons in unusual ways.",
				"Prerequisites": "Int 13, Combat Expertise, Gnome Weapon Focus, Illusive Gnome Style, Illusive Gnome Surprise, Improved Feint, gnome magic and weapon familiarity racial traits.",
				"Benefit": [ "While using Illusive Gnome Style, when you successfully use Bluff to feint against an opponent, you can pick one special weapon feature from among those listed by Illusive Gnome Surprise and deny the opponent its Dexterity modifier to AC, as normal for feinting; alternatively, you can pick two special weapon features instead of one." ]
			},
			{
				"-id": "Illusive Gnome Style",
				"-title": "Illusive Gnome Style",
				"-groups": "Combat,Style",
				"-description": "The chaotic, somewhat random design of your racial weapons makes it easy to combine them with illusions.",
				"Prerequisites": "Int 13, Combat Expertise, Gnome Weapon Focus, Improved Feint, base attack bonus +1, gnome magic and weapon familiarity racial traits.",
				"Benefit": [ "While feinting with a melee weapon that has 'gnome' in its name, you can sacrifice a spell slot, a spell of the illusion school, or a spell from the gnome magic racial trait to gain a bonus on the skill check attempted to feint. This bonus is equal to 1 + the level of the spell sacrificed. If you sacrifice a 0-level spell, you cannot cast or sacrifice that spell again for 24 hours." ]
			},
			{
				"-id": "Illusive Gnome Surprise",
				"-title": "Illusive Gnome Surprise",
				"-groups": "Combat",
				"-description": "You can use gnome weapons in unusual ways.",
				"Prerequisites": "Int 13, Combat Expertise, Gnome Weapon Focus, Illusive Gnome Style, Improved Feint.",
				"Benefit": [ "While using Illusive Gnome Style, you gain a +2 bonus on combat maneuver checks to perform dirty tricks and on Bluff checks to feint. In addition, when you successfully use Bluff to feint against a foe, instead of denying that foe its Dexterity bonus to AC, you can treat one 'gnome' weapon that you are wielding as if it had one of the following weapon special features: blocking, brace, disarm, distracting, performance, sunder, or trip. This benefit applies only against that foe and lasts for a number of rounds equal to your Charisma modifier (minimum 1)." ]
			},
			{
				"-id": "Impact Critical Shot",
				"-title": "Impact Critical Shot",
				"-groups": "Combat",
				"Prerequisites": "Dex 13, Point-Blank Shot, base attack bonus +9.",
				"Benefit": [ "Whenever you score a critical hit with a ranged attack, in addition to the normal damage your attack deals, if your confirmation roll exceeds your opponent's CMD, you can push your opponent back as if from the bull rush combat maneuver or knock that target prone as if from a trip combat maneuver. If you choose to bull rush, you cannot move with the target. Your maneuver does not provoke an attack of opportunity." ],
				"Normal": [ "You must perform a bull rush combat maneuver to bull rush an opponent, and you must perform a trip combat maneuver to trip an opponent." ]
			},
			{
				"-id": "Impaling Critical",
				"-title": "Impaling Critical",
				"-groups": "Combat",
				"-description": "Your critical hits can skewer your foes.",
				"Prerequisites": "Critical Focus, Weapon Specialization with selected piercing melee weapon, base attack bonus +11.",
				"Benefit": [ "Whenever you score a critical hit with the selected piercing melee weapon, you can impale your opponent on your weapon. While your opponent is impaled in this way, each time he starts his turn, you deal damage equal to your weapon's damage dice plus the extra damage dice from your weapon's properties. As an immediate action, you can pull your weapon out of your opponent. If your opponent is ever outside your reach, you must spend a free action to let go of your weapon or pull it out of him. Your opponent can also spend a move action to pull your weapon out. When the weapon comes out, your opponent takes damage as if starting his turn impaled. While you impale your opponent with your weapon, you cannot use it to attack, and you must hold on to it." ]
			},
			{
				"-id": "Imperial Conscript",
				"-title": "Imperial Conscript",
				"-description": "Your constant training in service to your lord has improved your martial prowess with some weapons. ",
				"Prerequisites": "Imperial serf in service to a lord",
				"Benefit": [ "When wielding a farm implement (such as a hand axe, pick, pitchfork, or scythe) as a weapon, you get a +1 bonus on damage rolls. When fighting alongside other conscripts you get a +1 bonus on initiative checks." ]
			},
			{
				"-id": "Imperial Knight",
				"-title": "Imperial Knight",
				"-description": "A noble has knighted you, giving you the rights and privileges of a knight of the realm. ",
				"Prerequisites": "Base attack bonus +6, heavy armor proficiency, proficient in a martial weapon",
				"Benefit": [ "You gain a cohort as if you had selected the Leadership feat; this cohort is a human or halfling commoner, expert, or warrior with the Imperial Squire feat. When within 10 feet of your squire, you get a +2 bonus on initiative checks and a +1 dodge bonus to AC." ]
			},
			{
				"-id": "Imperial Squire",
				"-title": "Imperial Squire",
				"-description": "You spent time as a squire to a knight and understand how to fight alongside him.",
				"Prerequisites": "Base attack bonus +1, proficient in a martial weapon",
				"Benefit": [ "When within 50 feet of a mounted ally with the Mounted Combat feat, you get a +2 bonus on initiative. If this ally is injured, you gain a +1 dodge bonus on AC as long as you are within 10 feet of him." ]
			},
			{
				"-id": "Implacable",
				"-title": "Implacable",
				"-groups": "Combat",
				"-description": "You aren't easily fazed, especially when you've been drinking.",
				"Benefit": [ "You gain a +2 bonus on saving throws against pain effects. When you are drunk or soused, you gain DR 5/piercing or slashing." ]
			},
			{
				"-id": "Implant Bomb",
				"-title": "Implant Bomb",
				"-description": "You can attach a bomb to a creature that explodes when the creature dies or after 24 hours.",
				"Prerequisites": "Heal 5 ranks, delayed bomb alchemist discovery.",
				"Benefit": [
					"You may implant a bomb in a willing or helpless creature (a mindless creature under your control, such as a zombie, counts as willing for this purpose). This takes 1 hour and expends 1 use of your bomb ability for the day. When the implanted creature dies or is destroyed, the bomb detonates in the creature's square as if it were a delayed bomb set by you (though you can set the bomb's damage to less than your normal bomb damage). You can use any bomb-affecting discoveries on this implanted bomb (acid bomb, frost bomb, smoke bomb, and so on) as normal. The bomb automatically detonates 24 hours after you implant it in the creature.",
					"If you expend 150 gp worth of alchemical reagents per die of the bomb's damage (for example, 750 gp for a 5d6 bomb), the bomb does not automatically detonate after 24 hours, and only detonates if the creature dies or is destroyed (24 hours after implantation, this bomb no longer counts toward your daily total).",
					"Implanting a bomb is as invasive as using the Heal skill to treat deadly wounds and leaves surgical scars unless the creature is healed by magic or abilities such as regeneration or fast healing. Some creatures (such as oozes, elementals, and creatures with the incorporeal quality) cannot have bombs implanted in them. Removing an implanted bomb requires a Heal check to treat deadly wounds, followed by a dispel magic spell or Disable Device check to neutralize the bomb (DC = 11 + alchemist‘s caster level)."
				]
			},
			{
				"-id": "Implement Focus",
				"-title": "Implement Focus",
				"-description": "You are more adept at spending generic focus on focus powers from your chosen school.",
				"Prerequisites": "Occultist level 3rd.",
				"Benefit": [ "Select one of your implement schools. When you spend generic focus to activate focus powers with one of that school's implements, the focus powers cost their listed amount of mental focus." ],
				"Normal": [ "Any focus power activated with generic focus costs twice as much focus to use and maintain." ],
				"Special": [ "You can take this feat multiple times. Each time, you must select a different implement school." ]
			},
			{
				"-id": "Implement Mastery",
				"-title": "Implement Mastery",
				"-groups": "Item Mastery",
				"-description": "You can use your implements to unlock secrets of mastering relics and other items of power.",
				"Prerequisites": "Implements class feature, mental focus class feature.",
				"Benefit": [ "For the purposes of using item mastery feats, you treat your implements as magic items with all spells that you know from each implement's associated implement school functioning as their effective construction requirements. When using an implement to activate an item mastery feat, you can spend a number of points of mental focus equal to half of the feat's base Fortitude save bonus prerequisite to activate the feat without counting the use against the item mastery feat's total number of daily uses." ],
				"Special": [ "An occultist who has this feat can select item mastery feats in place of focus powers, provided he meets the feats' prerequisites." ]
			},
			{
				"-id": "Improved Armor Focus",
				"-title": "Improved Armor Focus",
				"-groups": "Combat",
				"-description": "Your mastery makes the most of your armor.",
				"Prerequisites": "Armor Focus, base attack bonus +6, proficiency with selected armor.",
				"Benefit": [ "The armor check penalty of the selected armor decreases by 1 (to a minimum of 0). You also use your character level in place of your base attack bonus for the purpose of armor mastery feat prerequisites." ],
				"Special": [ "You can gain this feat multiple times. Its effects do not stack. Each time you take the feat, it applies to a new type of armor." ]
			},
			{
				"-id": "Improved Awesome Blow",
				"-title": "Improved Awesome Blow",
				"-groups": "Combat",
				"-description": "You are skilled at sending your opponents flying.",
				"Prerequisites": "Str 13; Awesome Blow or awesome blow class feature; Power Attack",
				"Benefit": [ "You receive a +2 bonus on checks to perform an awesome blow combat maneuver. You also gain a +2 bonus to your combat maneuver defense whenever an opponent tries to perform an awesome blow combat maneuver against you. Whenever you successfully perform an awesome blow combat maneuver, your opponent's movement provokes attacks of opportunity from all your allies (but not you)." ],
				"Normal": [ "Creatures moved by awesome blow do not provoke attacks of opportunity." ]
			},
			{
				"-id": "Improved Balor Whip",
				"-title": "Improved Balor Whip",
				"-groups": "Combat",
				"-description": "You can pull in foes with your whip and attack them with your sword.",
				"Prerequisites": "Balor Whip, Weapon Focus (whip), Whip Mastery, base attack bonus +12.",
				"Benefit": [ "When you succeed at a drag attempt with your whip against a non-adjacent target and the target ends the drag adjacent to you, as a free action you can make a single attack against the target at your highest attack bonus using the melee weapon held in your other hand. You gain an additional +2 bonus on drag combat maneuver checks when using a whip to drag, but this bonus does not stack with the bonus from Greater Drag." ]
			},
			{
				"-id": "Improved Beast Hunter",
				"-title": "Improved Beast Hunter",
				"-groups": "Combat",
				"-description": "You are well trained in stalking and hunting the animals of the wild.",
				"Prerequisites": "Beast Hunter; base attack bonus +3; Knowledge (nature) or Survival 3 ranks.",
				"Benefit": [ "When fighting animals that are at least one size category larger than you and that are native to the terrain you have chosen with Beast Hunter, you gain a +4 bonus on combat maneuver checks and a +4 to your CMD against such animals' attempts to use combat maneuvers against you. Additionally, you gain a +2 bonus on Reflex saves against attacks by the animal that allow a Reflex save (such as attempting to avoid a trample attack)." ],
				"Special": [ "If you have selected Beast Hunter multiple times, you gain this benefit for all of the terrains you have chosen for those feats." ]
			},
			{
				"-id": "Improved Bless Equipment",
				"-title": "Improved Bless Equipment",
				"-description": "You can channel even more energy into weapons and armor to grant them several divine powers at once.",
				"Prerequisites": "Bless Equipment, caster level 9th, channel energy class feature.",
				"Benefit": [
					"The number of uses of channeled energy you must expend to bless a piece of equipment using Bless Equipment and Align Equipment decreases by one (to a minimum of one use of channel energy per blessing).",
					"You can also bless a piece of equipment with up to two blessings at a time. Each blessing provides a different special ability drawn from the Bless Equipment list (and the Align Equipment list if you possess that feat). You must still have a high enough caster level to bless a piece of equipment with each of the selected blessings.",
					"You expend the appropriate number of uses of channeled energy required for each blessing, taking into account the reduction granted by this feat (and the increase for blessing a masterwork item, if needed). For example, a cleric with this feat would need to expend two uses of channeled energy to bless a weapon with the undead–bane and ghost touch special abilities (one use for bane plus one use for ghost touch).",
					"If a given piece of equipment already has a blessing on it, you can give it a second blessing. When another blessing is applied to a piece of equipment that currently has a blessing active on it, the durations for the two blessings are tracked separately."
				]
			},
			{
				"-id": "Improved Blind-Fight",
				"-title": "Improved Blind-Fight",
				"-groups": "Combat",
				"-description": "Your keen senses guide your hand against hidden foes.",
				"Prerequisites": "Perception 10 ranks, Blind-Fight.",
				"Benefit": [ "Your melee attacks ignore the miss chance for less than total concealment. You may still reroll your miss chance percentile roll for total concealment. If you successfully pinpoint an invisible or hidden attacker within 30 feet, that attacker gets no advantages related to hitting you with ranged attacks. That is, you don't lose your Dexterity bonus to Armor Class, and the attacker doesn't get the usual +2 bonus for being invisible." ],
				"Special": [ "The Improved Blind-Fight feat is of no use against a character who is the subject of a blink spell." ]
			},
			{
				"-id": "Improved Bravery",
				"-title": "Improved Bravery",
				"-groups": "Combat",
				"-description": "Your bravery protects you from more than just fear.",
				"Prerequisites": "Cha 13, bravery class feature.",
				"Benefit": [ "Add your bravery bonus against all mind-affecting effects instead of just against fear." ]
			},
			{
				"-id": "Improved Bull Rush",
				"-title": "Improved Bull Rush",
				"-groups": "Combat",
				"-description": "You are skilled at pushing your foes around.",
				"Prerequisites": "Str 13, Power Attack, base attack bonus +1.",
				"Benefit": [ "You do not provoke an attack of opportunity when performing a bull rush combat maneuver. In addition, you receive a +2 bonus on checks made to bull rush a foe. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to bull rush you." ],
				"Normal": [ "You provoke an attack of opportunity when performing a bull rush combat maneuver." ]
			},
			{
				"-id": "Improved Called Shot",
				"-title": "Improved Called Shot",
				"-groups": "combat",
				"-description": "You are skilled at landing blows right where you want to.",
				"Prerequisites": "Int 13, Combat Expertise.",
				"Benefit": [ "You receive a +2 bonus on attack rolls when making a called shot. When taking a full-round or standard action that gives you multiple attacks, you can replace a single attack with a called shot. You may only attempt one called shot per round." ],
				"Normal": [ "You can make one called shot per round as a full-round action." ]
			},
			{
				"-id": "Improved Channel",
				"-title": "Improved Channel",
				"-description": "Your channeled energy is harder to resist.",
				"Prerequisites": "Channel energy class feature.",
				"Benefit": [ "Add 2 to the DC of saving throws made to resist the effects of your channel energy ability. " ]
			},
			{
				"-id": "Improved Channel Force",
				"-title": "Improved Channel Force",
				"-groups": "Channeling; Aasimar",
				"-description": "You move your enemies within a beam of righteous energy.",
				"Prerequisites": "Channel Force, Aasimar, channel energy 4d6.",
				"Benefit": [ "When using Channel Force, you can affect all creatures in a 60-foot line or a 30-foot cone-shaped burst. You must choose to either push or pull all creatures within the affected area that fail their saves." ]
			},
			{
				"-id": "Improved Charging Hurler",
				"-title": "Improved Charging Hurler",
				"-groups": "Combat",
				"-description": "Every muscle in your body adds its force to your thrown weapons.",
				"Prerequisites": "Charging Hurler, Point-Blank Shot.",
				"Benefit": [ "When you use Charging Hurler, your target can be at any range up to your weapon's maximum range. If your target is within 30 feet, you gain a +2 bonus on damage rolls." ],
				"Normal": [ "Using Charging Hurler requires you to end your movement within 30 feet of your opponent." ]
			},
			{
				"-id": "Improved Cleaving Finish",
				"-title": "Improved Cleaving Finish",
				"-groups": "Combat",
				"-description": "You can cut down many opponents in a single strike.",
				"Prerequisites": "Str 13, Cleave, Cleaving Finish, Great Cleave, Power Attack, base attack bonus +6.",
				"Benefit": [ "You can use Cleaving Finish any number of times per round." ]
			},
			{
				"-id": "Improved Conceal Spell",
				"-title": "Improved Conceal Spell",
				"-description": "You can conceal the mightiest spells in the subtlest fashions.",
				"Prerequisites": "Conceal Spell, Deceitful, Bluff 5 ranks, Disguise 5 ranks, Sleight of Hand 10 ranks, ability to cast 3rd-level spells or use a 3rd-level spell-like ability.",
				"Benefit": [ "When you use Conceal Spell, creatures no longer gain a bonus equal to the level of the spell or spell-like ability on their checks to notice the hidden spell." ],
				"Normal": [ "Creatures attempting to notice a spell hidden with Conceal Spell gain a bonus equal to the level of the spell or spell-like ability on their Perception, Sense Motive, and Spellcraft checks." ]
			},
			{
				"-id": "Improved Counterspell",
				"-title": "Improved Counterspell",
				"-description": "You are skilled at countering the spells of others using similar spells.",
				"Benefit": [ "When counterspelling, you may use a spell of the same school that is one or more spell levels higher than the target spell." ],
				"Normal": [ "Without this feat, you may counter a spell only with the same spell or with a spell specifically designated as countering the target spell." ]
			},
			{
				"-id": "Improved Critical",
				"-title": "Improved Critical",
				"-groups": "Combat",
				"-description": "Attacks made with your chosen weapon are quite deadly.",
				"Prerequisites": "Proficient with weapon, base attack bonus +8.",
				"Benefit": [ "When using the weapon you selected, your threat range is doubled." ],
				"Special": [
					"You can gain Improved Critical multiple times. The effects do not stack. Each time you take the feat, it applies to a new type of weapon.",
					"This effect doesn't stack with any other effect that expands the threat range of a weapon."
				]
			},
			{
				"-id": "Improved Dark Sight",
				"-title": "Improved Dark Sight",
				"-groups": "Fetchling",
				"-description": "With further modification, your eyes see clearly in not only normal darkness, but in magical darkness as well.",
				"Prerequisites": "Dark Sight, Gloom Sight, fetchling",
				"Benefit": [ "You gain the see in darkness ability and lose the light sensitivity weakness, but gain the light blindness weakness." ]
			},
			{
				"-id": "Improved Devastating Strike",
				"-title": "Improved Devastating Strike",
				"-groups": "Combat",
				"Prerequisites": "Devastating Strike, Vital Strike, base attack bonus +13.",
				"Benefit": [ "Whenever you use Vital Strike, Improved Vital Strike, or Greater Vital Strike, you gain a bonus on attack rolls to confirm a critical hit equal to the bonus on damage rolls you gain from Devastating Strike." ]
			},
			{
				"-id": "Improved Dirge of Doom",
				"-title": "Improved Dirge of Doom",
				"-description": "The foreboding tone of your dirge is especially effective at unsettling your enemies.",
				"Prerequisites": "Ability to perform dirge of doom.",
				"Benefit": [ "The range of your dirge of doom ability is extended to 60 feet. Additionally, if a creature is shaken from another effect, the effect of your dirge of doom is changed to frightened for that specific creature. This benefit cannot cause a creature to become panicked, even if a target is already frightened from another effect. Once affected by this feat, a creature cannot be affected by it again for 24 hours." ],
				"Normal": [ "The range of dirge of doom is 30 feet. A creature that is already shaken cannot become frightened by dirge of doom. " ]
			},
			{
				"-id": "Improved Dirty Trick",
				"-title": "Improved Dirty Trick",
				"-groups": "Combat",
				"-description": "You are skilled at pulling dirty tricks on your foes.",
				"Prerequisites": "Int 13, Combat Expertise.",
				"Benefit": [ "You do not provoke an attack of opportunity when performing a dirty trick combat maneuver. In addition, you receive a +2 bonus on checks made to attempt a dirty trick. You also receive a +2 bonus to your Combat Maneuver Defense when an opponent tries a dirty trick on you." ],
				"Normal": [ "You provoke an attack of opportunity when performing a dirty trick combat maneuver." ]
			},
			{
				"-id": "Improved Disarm",
				"-title": "Improved Disarm",
				"-groups": "Combat",
				"-description": "You are skilled at knocking weapons from a foe's grasp.",
				"Prerequisites": "Int 13, Combat Expertise.",
				"Benefit": [ "You do not provoke an attack of opportunity when performing a disarm combat maneuver. In addition, you receive a +2 bonus on checks made to disarm a foe. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to disarm you." ],
				"Normal": [ "You provoke an attack of opportunity when performing a disarm combat maneuver." ]
			},
			{
				"-id": "Improved Disarm Partner",
				"-title": "Improved Disarm Partner",
				"-groups": "Combat,Teamwork",
				"-description": "You are ever the opportunist.",
				"Prerequisites": "Disarm Partner, base attack bonus +5.",
				"Benefit": [ "When an ally with this feat fails a disarm combat maneuver check made on his turn against a foe that's within your melee reach, you can make an attack of opportunity against that foe. If that attack of opportunity hits the foe, you can also attempt a disarm combat maneuver check against that opponent as part of that attack of opportunity." ]
			},
			{
				"-id": "Improved Drag",
				"-title": "Improved Drag",
				"-groups": "Combat",
				"-description": "You are skilled at dragging foes around the battlefield.",
				"Prerequisites": "Str 13, Power Attack, base attack bonus +1.",
				"Benefit": [ "You do not provoke an attack of opportunity when performing a drag combat maneuver. In addition, you receive a +2 bonus on checks made to drag a foe. You also receive a +2 bonus to your Combat Maneuver Defense when an opponent tries to drag you." ],
				"Normal": [ "You provoke an attack of opportunity when performing a drag combat maneuver." ]
			},
			{
				"-id": "Improved Drow Nobility",
				"-title": "Improved Drow Nobility",
				"-groups": "Drow",
				"Prerequisites": "Cha 13, Drow Nobility, able to use drow spell-like abilities, drow.",
				"Benefit": [ "You may use your dancing lights, faerie fire, feather fall, and levitate spell-like abilities twice per day. Your darkness spell-like ability instead becomes deeper darkness, which you may use twice per day." ]
			},
			{
				"-id": "Improved Duck and Cover",
				"-title": "Improved Duck and Cover",
				"-groups": "Teamwork",
				"-description": "Your allies' ability to protect you from damage extends to area attacks.",
				"Prerequisites": "Duck and Cover.",
				"Benefit": [ "Whenever you use Duck and Cover, your ally has evasion or improved evasion, and your ally's saving throw roll succeeds, half of the damage you would have taken is transferred to your ally. (This damage is not reduced by the ally's evasion or improved evasion.)" ]
			},
			{
				"-id": "Improved Eldritch Heritage",
				"-title": "Improved Eldritch Heritage",
				"-description": "The power of your discovered bloodline continues to grow.",
				"Prerequisites": "Cha 15, Eldritch Heritage, character level 11th.",
				"Benefit": [ "You gain either the 3rd-level or the 9th-level power (your choice) of the bloodline you selected with the Eldritch Heritage feat. For purposes of using that power, treat your sorcerer level as equal to your character level – 2, even if you have levels in sorcerer. You do not gain any of the other bloodline abilities." ],
				"Special": [ "You may select this feat multiple times. Its effects do not stack. Each time you select the feat, it applies to a different bloodline power for that bloodline available at sorcerer level 3 or 9." ]
			},
			{
				"-id": "Improved Familiar",
				"-title": "Improved Familiar",
				"-description": "This feat allows you to acquire a powerful familiar, but only when you could normally acquire a new familiar.",
				"Prerequisites": "Ability to acquire a new familiar, compatible alignment, sufficiently high level (see below).",
				"Benefit": [
					"When choosing a familiar, the creatures listed here are also available to you. You may choose a familiar with an alignment up to one step away on each alignment axis (lawful through chaotic, good through evil).",
					"Improved familiars otherwise use the rules for regular familiars, with two exceptions: if the creature's type is something other than animal, its type does not change; and improved familiars do not gain the ability to speak with other creatures of their kind (although many of them already have the ability to communicate).",
					"1 Or other celestial, entropic, fiendish, or resolute animal from the standard familiar list. 2 The master must first create the homunculus."
				]
			},
			{
				"-id": "Improved Familiar Bond",
				"-title": "Improved Familiar Bond",
				"-description": "Your familiar gains greater power.",
				"Prerequisites": "Familiar Bond, Iron Will.",
				"Benefit": [ "Your familiar gains all the normal abilities available to a familiar of a wizard with a level equal to your total Hit Dice. You also gain the special ability normally gained by a master of your type of familiar." ]
			},
			{
				"-id": "Improved Feint",
				"-title": "Improved Feint",
				"-groups": "Combat",
				"-description": "You are skilled at fooling your opponents in combat.",
				"Prerequisites": "Int 13, Combat Expertise.",
				"Benefit": [ "You can make a Bluff check to feint in combat as a move action." ],
				"Normal": [ "Feinting in combat is a standard action." ]
			},
			{
				"-id": "Improved Feint Partner",
				"-title": "Improved Feint Partner",
				"-groups": "Combat,Teamwork",
				"-description": "Knowledge of your companions' tricks and techniques allow you to take even greater advantage of your allies' feints.",
				"Prerequisites": "Bluff 1 rank, Combat Reflexes, Feint Partner, base attack bonus +6.",
				"Benefit": [ "Whenever an ally who also has this feat successfully feints against an opponent, that opponent provokes an attack of opportunity from you." ]
			},
			{
				"-id": "Improved Feinting Flurry",
				"-title": "Improved Feinting Flurry",
				"-groups": "Combat",
				"-description": "Your first melee attack throws your opponent completely off guard.",
				"Prerequisites": "Dex 17, flurry of blows class feature, Combat Expertise, Feinting Flurry, base attack bonus +6.",
				"Benefit": [ "While using Feinting Flurry, if you successfully feint, your opponent is denied its Dexterity bonus to AC until the end of your turn." ],
				"Normal": [ "A successful feint causes your opponent to be denied its Dexterity bonus to AC against your next attack." ]
			},
			{
				"-id": "Improved Fiendish Darkness",
				"-title": "Improved Fiendish Darkness",
				"-description": "Your innate ability to shroud others in darkness is further empowered.",
				"Prerequisites": "Fiendish Darkness, darkness spell-like ability, caster level 3rd, tiefling.",
				"Benefit":  [ "You gain a +2 bonus to your effective caster level when using your darkness spell-like ability. In addition, whenever you cast a spell with the [evil] descriptor that targets another creature, you can spend a swift action to apply the effects of your darkness spell-like ability to the spell cast, with the darkness effect centered on the spell's target. Using the darkness spell-like ability in this way expends all three uses of it for the day, and it cannot be used if fewer than three uses of it remain for that day." ]
			},
			{
				"-id": "Improved Fiendish Sorcery",
				"-title": "Improved Fiendish Sorcery",
				"-description": "Your skill with foul sorcery is even more potent than that of others of your race.",
				"Prerequisites": "Fiendish sorcery racial trait, tiefling.",
				"Benefit": [ "If you are a sorcerer and possess the rakshasa bloodline or shadow bloodline, treat your Charisma score as 2 points higher for all sorcerer class abilities." ]
			},
			{
				"-id": "Improved Flexible Wizardry",
				"-title": "Improved Flexible Wizardry",
				"-description": "You possess an impressive flexibility with casting that other wizards lack.",
				"Prerequisites": "Flexible Wizardry, Spell Mastery, wizard level 8th.",
				"Benefit": [ "When you use Flexible Wizardry, you can flexibly prepare a number of spell slots equal to your Intelligence modifier + 4. Furthermore, you can finalize one of these slots with a standard action instead of a full-round action." ]
			},
			{
				"-id": "Improved Forceful Charge",
				"-title": "Improved Forceful Charge",
				"-groups": "Animal Companion Feat",
				"-description": "Enemies fall before this animal's charge.",
				"Prerequisites": "Forceful Charge, Improved Bull Rush, Power Attack, animal companion.",
				"Benefit": [ "This animal can bull rush a target that is up to two size categories larger than itself. If it pushes the target at least 10 feet as a result of this bull rush, it can attempt a trip combat maneuver check against the target as a free action. This trip combat maneuver provokes attacks of opportunity as normal." ]
			},
			{
				"-id": "Improved Fury of the Tainted",
				"-title": "Improved Fury of the Tainted",
				"-groups": "Combat",
				"-description": "Your hatred for goodness is rivaled only by your ability to repel it.",
				"Prerequisites": "Cha 13, Fury of the Tainted, base attack bonus +8, rage class feature, tiefling.",
				"Benefit": [ "While raging, you gain spell resistance equal to 10 + your class level against spells with the [good] descriptor." ]
			},
			{
				"-id": "Improved Grapple",
				"-title": "Improved Grapple",
				"-groups": "Combat",
				"-description": "You are skilled at grappling opponents.",
				"Prerequisites": "Dex 13, Improved Unarmed Strike.",
				"Benefit": [ "You do not provoke an attack of opportunity when performing a grapple combat maneuver. In addition, you receive a +2 bonus on checks made to grapple a foe. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to grapple you." ],
				"Normal": [ "You provoke an attack of opportunity when performing a grapple combat maneuver." ]
			},
			{
				"-id": "Improved Great Fortitude",
				"-title": "Improved Great Fortitude",
				"-description": "You can draw upon an inner reserve to resist diseases, poisons, and other grievous harm.",
				"Prerequisites": "Great Fortitude.",
				"Benefit": [ "Once per day, you may reroll a Fortitude save. You must decide to use this ability before the results are revealed. You must take the second roll, even if it is worse." ]
			},
			{
				"-id": "Improved Hammer Throw",
				"-title": "Improved Hammer Throw",
				"-groups": "Combat",
				"-description": "Your ability to knock down your foes with ranged attacks is impressive.",
				"Prerequisites": "Int 13, Combat Expertise, Hammer Throw, Improved Trip, Point-Blank Shot, Precise Shot, base attack bonus +6, dwarf.",
				"Benefit": [ "You can use the Hammer Throw feat against targets at any range and of any size." ]
			},
			{
				"-id": "Improved Hunter's Bond",
				"-title": "Improved Hunter's Bond",
				"-groups": "Combat",
				"-description": "You deepen your connection to your allies, granting them higher bonuses.",
				"Prerequisites": "Hunter's bond (hunting companions) class feature, ranger level 9th.",
				"Benefit": [ "When you activate hunter's bond, you can grant your allies your full favored enemy bonus against a single target." ],
				"Normal": [ "Your allies receive half your favored enemy bonus against a single target." ]
			},
			{
				"-id": "Improved Impaling Critical",
				"-title": "Improved Impaling Critical",
				"-groups": "Combat",
				"Prerequisites": "Impaling Critical, Critical Focus, Weapon Specialization with selected piercing melee weapon, base attack bonus +13.",
				"Benefit": [ "While you are using Impaling Critical to impale an opponent, and you are still holding onto that weapon, that opponent must succeed at a grapple combat maneuver check against you to pull your weapon out. If you have let go of your weapon, the impaled opponent must spend a standard action to remove the weapon. Until the opponent pulls the weapon out, his speed in all modes is halved and his maneuverability, if any, is reduced by one step. When the weapon comes out, instead of dealing the damage normal for Impaling Critical, you can deal bleed damage equal to your weapon's damage dice result once per round at the start of that opponent's turn." ]
			},
			{
				"-id": "Improved Improvisation",
				"-title": "Improved Improvisation",
				"-groups": "Human",
				"-description": "You are masterful in your improvisation.",
				"Prerequisites": "Int 13, Fast Learner, Improvisation, human.",
				"Benefit": [ "Your nonproficiency penalty with weapons, armor, and shields is halved. In addition, the bonus on all skill checks for skills you have no ranks in increases to +4 instead of +2." ]
			},
			{
				"-id": "Improved Initiative",
				"-title": "Improved Initiative",
				"-groups": "Combat",
				"-description": "Your quick reflexes allow you to react rapidly to danger.",
				"Benefit": [ "You get a +4 bonus on initiative checks." ]
			},
			{
				"-id": "Improved Intercept Blow",
				"-title": "Improved Intercept Blow",
				"-groups": "Animal Companion Feat; Combat",
				"-description": "The animal's intervention completely protects its master from harm.",
				"Prerequisites": "Intercept Blow, base attack bonus +6, animal companion.",
				"Benefit": [ "When the animal companion uses Intercept Blow to intercept an opponent's melee attack and succeeds, it can take all the damage from the intercepted attack, in which case its master takes no damage from the intercepted attack and doesn't suffer effects that trigger on a hit." ]
			},
			{
				"-id": "Improved Iron Will",
				"-title": "Improved Iron Will",
				"-description": "Your clarity of thought allows you to resist mental attacks.",
				"Prerequisites": "Iron Will.",
				"Benefit": [ "Once per day, you may reroll a Will save. You must decide to use this ability before the results are revealed. You must take the second roll, even if it is worse." ]
			},
			{
				"-id": "Improved Ki Throw",
				"-title": "Improved Ki Throw",
				"-groups": "Combat",
				"-description": "Your enemies are living weapons in your hands.",
				"Prerequisites": "Improved Bull Rush, Ki Throw.",
				"Benefit": [
					"When using the Ki Throw feat, you may throw your target into any square you threaten that is occupied by another creature. Make a bull rush combat maneuver check with a -4 penalty against the secondary target. If this check succeeds, the thrown creature lands prone in the secondary target's square, while the secondary target is pushed back and knocked prone in an adjacent square. If the check fails, the thrown creature lands prone in the nearest square you threaten adjacent to the secondary target.",
					"If you throw a Large or larger creature into an area containing multiple secondary targets, you take an additional penalty of -4 on your combat maneuver check for each target after the first."
				],
				"Special": [ "A monk may take this as a bonus feat at 14th level." ]
			},
			{
				"-id": "Improved Legendary Influence",
				"-title": "Improved Legendary Influence",
				"-description": "Each legend grants you more of its power in return for greater influence.",
				"Prerequisites": "Legendary Influence, lesser spirit power and propitiation class features.",
				"Benefit": [ "For each spirit you can channel, choose a second feat other than an item creation feat. Whenever you allow a spirit to gain 1 point of influence over you to gain that spirit's associated feat via Legendary Influence, you can allow that spirit to gain 1 additional point of influence over you to gain the second feat." ]
			},
			{
				"-id": "Improved Lightning Reflexes",
				"-title": "Improved Lightning Reflexes",
				"-description": "You have a knack for avoiding danger all around you.",
				"Prerequisites": "Lightning Reflexes.",
				"Benefit": [ "Once per day, you may reroll a Reflex save. You must decide to use this ability before the results are revealed. You must take the second roll, even if it is worse." ]
			},
			{
				"-id": "Improved Low Blow",
				"-title": "Improved Low Blow",
				"-groups": "Combat,Halfling",
				"-description": "You are adept at hitting larger opponents where it hurts",
				"Prerequisites": "Base attack bonus +4, halfling, low-blow racial trait.",
				"Benefit": [ "Your bonus to confirm critical hits against opponents larger than yourself improves to +2. Furthermore, once per day, after you fail to hit with a critical hit confirmation roll, you can reroll the confirmation roll, but must take the new result even if it is worse." ]
			},
			{
				"-id": "Improved Monster Lore",
				"-title": "Improved Monster Lore",
				"-description": "You are obsessed with the abilities and weaknesses of monsters.",
				"Prerequisites": "Monster lore class feature.",
				"Benefit": [ "You gain a sacred bonus on all skill checks to identify the abilities and weaknesses of creatures equal to 1/2 your level in classes that grant you the monster lore class feature." ]
			},
			{
				"-id": "Improved Natural Poison Harvester",
				"-title": "Improved Natural Poison Harvester",
				"-description": "You excel at harvesting poison from the many toxic creatures of the natural world.",
				"Prerequisites": "Natural Poison Harvester, Craft (alchemy) 9 ranks, Survival 9 ranks.",
				"Benefit": [ "When you successfully harvest poison from a hazard or dead creature, you gain an additional 1d4 doses of poison." ]
			},
			{
				"-id": "Improved Overrun",
				"-title": "Improved Overrun",
				"-groups": "Combat",
				"-description": "You are skilled at running down your foes.",
				"Prerequisites": "Str 13, Power Attack, base attack bonus +1.",
				"Benefit": [ "You do not provoke an attack of opportunity when performing an overrun combat maneuver. In addition, you receive a +2 bonus on checks made to overrun a foe. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to overrun you. Targets of your overrun attempt may not chose to avoid you." ],
				"Normal": [ "You provoke an attack of opportunity when performing an overrun combat maneuver." ]
			},
			{
				"-id": "Improved Parry",
				"-title": "Improved Parry",
				"-groups": "Combat",
				"-description": "A flick of the wrist binds your opponent's weapon.",
				"Prerequisites": "Int 13, Combat Expertise.",
				"Benefit": [ "When you successfully parry a foe's melee attack (with a dueling parry or the parry class feature), your next melee attack against the target does not allow the enemy to apply its Dexterity bonus to AC (if any). This attack must be made before the end of your next turn." ]
			},
			{
				"-id": "Improved Plane Shift",
				"-title": "Improved Plane Shift",
				"-description": "You're an expert at traveling the various realms of the Great Beyond via plane shift.",
				"Prerequisites": "Wizard level 9th.",
				"Benefit": [
					"Add plane shift to your spell list and to your spellbook as a 5th-level wizard spell. The time required for you to identify a portal's destination is reduced to 1 round.",
					"In addition, you automatically identify any plane on which you arrive."
				],
				"Special": [ "A wizard can select this as a wizard bonus feat." ],
				"Normal": [ "Plane shift is a 7th-level wizard spell." ]
			},
			{
				"-id": "Improved Position of Strength",
				"-title": "Improved Position of Strength",
				"-groups": "Combat",
				"-description": "You are particularly skilled in pressing your advantage when negotiating with noncombatants.",
				"Prerequisites": "Position of Strength; Two-Weapon Fighting or Multiattack; Intimidate 5 ranks.",
				"Benefit": [ "As long as you are wielding one or more weapons with which you are proficient, you gain the bonus on Intimidate checks from Position of Strength against creatures that are armed with fewer weapons than you are wielding." ]
			},
			{
				"-id": "Improved Precise Shot",
				"-title": "Improved Precise Shot",
				"-groups": "Combat",
				"-description": "Your ranged attacks ignore anything but total concealment and cover.",
				"Prerequisites": "Dex 19, Point-Blank Shot, Precise Shot, base attack bonus +11.",
				"Benefit": [ "Your ranged attacks ignore the AC bonus granted to targets by anything less than total cover, and the miss chance granted to targets by anything less than total concealment. Total cover and total concealment provide their normal benefits against your ranged attacks." ],
				"Normal": [ "See the normal rules on the effects of cover and concealment in Combat." ]
			},
			{
				"-id": "Improved Precise Strike",
				"-title": "Improved Precise Strike",
				"-groups": "Combat,Teamwork",
				"-description": "Your precise timing and smooth teamwork allow you to strike a foe where it hurts.",
				"Prerequisites": "Dex 13, Precise Strike, base attack bonus +4.",
				"Benefit": [ "Whenever you deal additional damage with Precise Strike, you also deal 1 point of bleed damage. This bleed damage does not stack with itself." ]
			},
			{
				"-id": "Improved Punishing Step",
				"-title": "Improved Punishing Step",
				"-groups": "Combat",
				"-description": "You know how to take advantage of a devastating charge.",
				"Prerequisites": "Dex 13, Dodge, Punishing Step, base attack bonus +8.",
				"Benefit": [ "Your bonus to AC from the Dodge feat increases to +2 against charge attacks. When a creature charges you and misses with its attack, it loses its Dexterity bonus to AC against the next melee attack you make against it before the end of your next turn. If a creature misses with multiple attacks (such as when using the pounce ability), you can make one such attack against the creature's flat-footed AC before the end of your next turn for each of that creature's attacks that missed you." ]
			},
			{
				"-id": "Improved Rending Fury",
				"-title": "Improved Rending Fury",
				"-groups": "Combat",
				"Prerequisites": "Rending Fury, base attack bonus +9, rend special attack.",
				"Benefit": [ "Whenever you successfully rend an opponent, you deal an extra 1d6 damage. This damage is not multiplied on a critical hit." ]
			},
			{
				"-id": "Improved Reposition",
				"-title": "Improved Reposition",
				"-groups": "Combat",
				"-description": "You have learned how to force your enemies to move around the battlefield.",
				"Prerequisites": "Int 13, Combat Expertise.",
				"Benefit": [ "You do not provoke an attack of opportunity when performing a reposition combat maneuver. In addition, you receive a +2 bonus on checks made to reposition a foe. You also receive a +2 bonus to your Combat Maneuver Defense when an opponent tries to reposition you." ],
				"Normal": [ "You provoke an attack of opportunity when performing a reposition combat maneuver." ]
			},
			{
				"-id": "Improved Second Chance",
				"-title": "Improved Second Chance",
				"-groups": "Combat",
				"-description": "You can turn a missed strike into a second chance without sacrificing later attacks.",
				"Prerequisites": "Int 13, Combat Expertise, Second Chance, base attack bonus +11.",
				"Benefit": [ "When you reroll a missed attack using the Second Chance feat, you can still make the rest of your attacks that turn, albeit at a -5 penalty to each attack." ],
				"Normal": [ "When using the Second Chance feat, you must normally forgo the rest of your attacks that turn." ]
			},
			{
				"-id": "Improved Share Spells",
				"-title": "Improved Share Spells",
				"-description": "You can share spells with those you have a magical connection with.",
				"Prerequisites": "Spellcraft 10 ranks, ability to acquire an animal companion, eidolon, familiar, or special mount.",
				"Benefit": [
					"Any non-instantaneous spell (but not any spell-like ability) you cast on yourself can also affect a creature bonded to you (such as an animal companion, eidolon, familiar, or special mount). The creature must be within 5 feet of you at the time of casting to receive the benefit. The spell's duration is halved between you and your bonded creature (for example, a spell with a duration of 1 hour has a duration of 30 minutes for both you and your bonded creature).",
					"If the spell or effect has a duration other than instantaneous, it stops affecting the creature if it moves farther than 5 feet away from you. It does not affect the creature again if it returns before the duration expires. You may share spells in this fashion even if the spells normally do not affect creatures of that type. This feat only applies to animal companions, eidolons, familiars, or special mounts gained through a class feature."
				]
			},
			{
				"-id": "Improved Shield Bash",
				"-title": "Improved Shield Bash",
				"-groups": "Combat",
				"-description": "You can protect yourself with your shield, even if you use it to attack.",
				"Prerequisites": "Shield Proficiency",
				"Benefit": [ "When you perform a shield bash, you may still apply the shield's shield bonus to your AC." ],
				"Normal": [ "Without this feat, a character that performs a shield bash loses the shield's shield bonus to AC until his next turn (see Equipment)." ]
			},
			{
				"-id": "Improved Shield Focus",
				"-title": "Improved Shield Focus",
				"-groups": "Combat",
				"-description": "Your mastery makes the most of your shield.",
				"Prerequisites": "Shield Focus, base attack bonus +6.",
				"Benefit": [ "You reduce the armor check penalty of any shield you are using by 1. You also use your character level in place of your base attack bonus for the purpose of shield mastery feat prerequisites." ]
			},
			{
				"-id": "Improved Sidestep",
				"-title": "Improved Sidestep",
				"-groups": "Combat",
				"-description": "You are adept at sidestepping your opponent's melee attacks without compromising your mobility.",
				"Prerequisites": "Dex 15, Dodge, Mobility, Sidestep.",
				"Benefit": [ "After sidestepping an opponent's missed attack using the Sidestep feat, you may still take a 5-foot step during your next turn, or you may move up to your full speed if you take an action to move during your next turn." ],
				"Normal": [ "If you use the Sidestep feat, you cannot take a 5-foot step during your next turn." ]
			},
			{
				"-id": "Improved Snap Shot",
				"-title": "Improved Snap Shot",
				"-groups": "Combat",
				"-description": "You can take advantage of your opponent's vulnerabilities from a greater distance, and without exposing yourself.",
				"Prerequisites": "Dex 15, Point-Blank Shot, Rapid Shot, Snap Shot, Weapon Focus, base attack bonus +9.",
				"Benefit": [ "You threaten an additional 5 feet with Snap Shot." ],
				"Normal": [ "Making a ranged attack provokes attacks of opportunity." ]
			},
			{
				"-id": "Improved Spell Sharing",
				"-title": "Improved Spell Sharing",
				"-groups": "Teamwork",
				"-description": "Your link with your companion creature allows you to share your magic with it.",
				"Prerequisites": "Ability to acquire an animal companion, eidolon, familiar, or special mount.",
				"Benefit": [
					"When you are adjacent to or sharing a square with your companion creature and that companion creature has this feat, you can cast a spell on yourself and divide the duration evenly between yourself and the companion creature. You can use this feat only on spells with a duration of at least 2 rounds. For example, you could cast bull's strength on yourself, and instead of the spell lasting 1 minute per level on yourself, it lasts 5 rounds per level on yourself and 5 rounds per level on your companion.",
					"Once the spell is cast, you and the companion creature can move farther apart without ending the effect."
				]
			},
			{
				"-id": "Improved Spring Attack",
				"-title": "Improved Spring Attack",
				"-groups": "Combat",
				"-description": "You dart through the press of battle like a breeze, assaulting foes as you pass.",
				"Prerequisites": "Dex 15, Dodge, Mobility, Nimble Moves, Spring Attack, base attack bonus +9.",
				"Benefit": [ "When you use Spring Attack, you can select two targets to attack during your movement instead of one. The second attack made this way is made at your full base attack bonus - 5. All restrictions of Spring Attack apply to both targets, and your movement does not provoke attacks of opportunity from either target. You can't target the same creature twice." ],
				"Special": [ "A monk of at least 14th level can select this feat as a monk bonus feat, but only if he has Spring Attack." ]
			},
			{
				"-id": "Improved Stalwart",
				"-title": "Improved Stalwart",
				"-description": "...",
				"Prerequisites": "Diehard, Endurance, Stalwart, base attack bonus +11.",
				"Benefit": [ "Double the DR you gain from Stalwart, to a maximum of DR 10/—." ]
			},
			{
				"-id": "Improved Steal",
				"-title": "Improved Steal",
				"-groups": "Combat",
				"-description": "You have a knack for snatching items from your opponents.",
				"Prerequisites": "Int 13, Combat Expertise.",
				"Benefit": [ "You do not provoke an attack of opportunity when performing a steal combat maneuver. In addition, you receive a +2 bonus on checks made to steal an item from a foe. You also receive a +2 bonus to your Combat Maneuver Defense when an opponent tries to steal an item from you." ],
				"Normal": [ "You provoke an attack of opportunity when performing a steal combat maneuver." ]
			},
			{
				"-id": "Improved Stonecunning",
				"-title": "Improved Stonecunning",
				"-description": "Your sense for stonework is uncanny.",
				"Prerequisites": "Wis 13, dwarf, stonecunning racial trait.",
				"Benefit": [ "You receive a +4 bonus on Perception checks to notice unusual stonework. This bonus replaces the stonecunning ability's normal bonus on Perception checks." ]
			},
			{
				"-id": "Improved Studied Combatant",
				"-title": "Improved Studied Combatant",
				"-description": "Deep understanding of your foes' tics grants you the upper hand in combat.",
				"Prerequisites": "Int 13, Amateur Investigator, Studied Combatant, base attack bonus +8, 1 rank in at least one Knowledge skill, no levels in a class that has the inspiration class feature.",
				"Benefit": [ "Your bonuses for Studied Combatant increase to a +4 insight bonus on melee attack rolls and a +4 bonus on damage rolls. This feat otherwise works like the Studied Combatant feat." ]
			},
			{
				"-id": "Improved Sunder",
				"-title": "Improved Sunder",
				"-groups": "Combat",
				"-description": "You are skilled at damaging your foes' weapons and armor.",
				"Prerequisites": "Str 13, Power Attack, base attack bonus +1.",
				"Benefit": [ "You do not provoke an attack of opportunity when performing a sunder combat maneuver. In addition, you receive a +2 bonus on checks made to sunder an item. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to sunder your gear." ],
				"Normal": [ "You provoke an attack of opportunity when performing a sunder combat maneuver." ]
			},
			{
				"-id": "Improved Surprise Follow-Through",
				"-title": "Improved Surprise Follow-Through",
				"-groups": "Combat, Orc/Half-Orc",
				"Prerequisites": "Str 13, Cleave, Great Cleave, Power Attack, Surprise Follow Through, base attack bonus +8.",
				"Benefit": [ "When using Great Cleave, each opponent you attack on your turn (other than the first) is denied his Dexterity bonus against you." ]
			},
			{
				"-id": "Improved Swap Places",
				"-title": "Improved Swap Places",
				"-groups": "Combat,Teamwork",
				"-description": "When you switch places with your comrade, your sizes don't matter.",
				"Prerequisites": "Swap Places.",
				"Benefit": [ "When you and your ally use Swap Places, your ally can be up to one size larger or smaller than you, and your movement into the ally's square does not provoke an attack of opportunity. If your ally cannot fit into the space you had been occupying and there are no available adjacent squares to accommodate the rest of the ally's space, the ally must squeeze. Alternatively, as part of its movement, the ally can attempt a bull rush combat maneuver against a creature that occupies a space your ally would occupy, but this bull rush cannot move the creature more than 5 feet." ],
				"Normal": [ "Using Swap Places requires you and your ally to be the same size, and your movement into the ally's square provokes attacks of opportunity." ]
			},
			{
				"-id": "Improved Trip",
				"-title": "Improved Trip",
				"-groups": "Combat",
				"-description": "You are skilled at sending your opponents to the ground.",
				"Prerequisites": "Int 13, Combat Expertise.",
				"Benefit": [ "You do not provoke an attack of opportunity when performing a trip combat maneuver. In addition, you receive a +2 bonus on checks made to trip a foe. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to trip you." ],
				"Normal": [ "You provoke an attack of opportunity when performing a trip combat maneuver." ]
			},
			{
				"-id": "Improved Two-Weapon Feint",
				"-title": "Improved Two-Weapon Feint",
				"-groups": "Combat",
				"-description": "Your primary weapon keeps a foe off balance, allowing you to slip your off-hand weapon past his defenses.",
				"Prerequisites": "Dex 17, Int 13, Combat Expertise, Improved Two-Weapon Fighting, Two-Weapon Feint, Two-Weapon Fighting, base attack bonus +6.",
				"Benefit": [ "While using Two-Weapon Fighting to make melee attacks, you can forgo your first primary-hand melee attack to make a Bluff check to feint an opponent. If you successfully feint, that opponent is denied his Dexterity bonus to AC until the end of your turn." ]
			},
			{
				"-id": "Improved Two-Weapon Fighting",
				"-title": "Improved Two-Weapon Fighting",
				"-groups": "Combat",
				"-description": "You are skilled at fighting with two weapons.",
				"Prerequisites": "Dex 17, Two-Weapon Fighting, base attack bonus +6.",
				"Benefit": [ "In addition to the standard single extra attack you get with an off-hand weapon, you get a second attack with it, albeit at a -5 penalty." ],
				"Normal": [
					"Without this feat, you can only get a single extra attack with an off-hand weapon.",
					"FAQ",
					"If you use Two-Weapon Fighting on your turn to attack with two weapons, do you also take that penalty on attacks of opportunity made before the start of your next turn? How long do the penalties last?",
					"No, the penalties end as soon as you have completed the full-attack action that allowed you to attack with both weapons. Any attacks of opportunity you make are at your normal attack bonus. Generally speaking, penalties on attacks made during your turn do not carry over to attacks of opportunity unless they specifically state otherwise (such as the penalty from using Power Attack).",
					"[Source]"
				]
			},
			{
				"-id": "Improved Umbral Scion",
				"-title": "Improved Umbral Scion",
				"-groups": "Drow",
				"Prerequisites": "Cha 13, Wis 13, Drow Nobility, Greater Drow Nobility, Improved Drow Nobility, Umbral Scion, able to use drow spell-like abilities, drow.",
				"Benefit": [ "You may use dispel magic, divine favor, and suggestion once per day as spell-like abilities. Your caster level is equal to your character level." ]
			},
			{
				"-id": "Improved Unarmed Strike",
				"-title": "Improved Unarmed Strike",
				"-groups": "Combat",
				"-description": "You are skilled at fighting while unarmed.",
				"Benefit": [ "You are considered to be armed even when unarmed—you do not provoke attacks of opportunity when you attack foes while unarmed. Your unarmed strikes can deal lethal or nonlethal damage, at your choice." ],
				"Normal": [ "Without this feat, you are considered unarmed when attacking with an unarmed strike, and you can deal only nonlethal damage with such an attack." ]
			},
			{
				"-id": "Improved Underhanded Teamwork",
				"-title": "Improved Underhanded Teamwork",
				"-groups": "Combat,Teamwork",
				"-description": "You and your allies have trained together long enough to know how to exploit an opponent's disadvantage to make her predicament even worse.",
				"Prerequisites": "Combat Expertise, Improved Dirty Trick, Underhanded Teamwork, base attack bonus +6.",
				"Benefit": [ "Whenever an ally who also has this feat performs the dirty trick combat maneuver against a foe that you both threaten, you may attempt a dirty trick combat maneuver against the same foe as an immediate action to inflict a second condition. If the foe uses an action to remove the first condition, it also removes the condition imposed by your immediate action." ]
			},
			{
				"-id": "Improved Vital Strike",
				"-title": "Improved Vital Strike",
				"-groups": "Combat",
				"-description": "You can make a single attack that deals a large amount of damage.",
				"Prerequisites": "Vital Strike, base attack bonus +11.",
				"Benefit": [ "When you use the attack action, you can make one attack at your highest base attack bonus that deals additional damage. Roll the weapon's damage dice for the attack three times and add the results together before adding bonuses from Strength, weapon abilities (such as flaming), precision-based damage, and other damage bonuses. These extra weapon damage dice are not multiplied on a critical hit, but are added to the total." ]
			},
			{
				"-id": "Improved Weapon of the Chosen",
				"-title": "Improved Weapon of the Chosen",
				"-groups": "Combat",
				"-description": "You gain even greater favor when you use your deity's favored weapon.",
				"Prerequisites": "Weapon Focus with your deity's favored weapon, Weapon of the Chosen.",
				"Benefit": [ "This feat acts as Weapon of the Chosen, except you gain the benefits on all attacks until the start of your next turn. Your attacks gain a single alignment component of your deity—either chaotic, evil, good, or lawful—for the purpose of overcoming damage reduction. If your deity is neutral with no other alignment components, your attacks instead overcome damage reduction as though your weapon were both cold iron and silver." ]
			},
			{
				"-id": "Improved Whip Mastery",
				"-title": "Improved Whip Mastery",
				"-groups": "Combat",
				"-description": "You are able to entangle opponents with the coils of your whip.",
				"Prerequisites": "Weapon Focus (whip), Whip Mastery, base attack bonus +5.",
				"Benefit": [ "While wielding a whip, you threaten the area of your natural reach plus 5 feet. You can also use a whip to grasp an unattended Small or Tiny object within your whip's reach and pull that object into your square. To do so, you must hit AC 10 with a melee touch attack. Further, you can use the whip to grasp onto an object within your whip's reach, using 5 feet of your whip as if it were a grappling hook, allowing you to use the rest of your whip to swing on like a rope. As a free action, you can release the object your whip is grasping, but you cannot use the whip to attack while the whip is grasping an object." ]
			},
			{
				"-id": "Improved Wilding Strike",
				"-title": "Improved Wilding Strike",
				"-groups": "Combat",
				"-description": "You gain greater skill with the natural power of your blows.",
				"Prerequisites": "Str 16, Improved Unarmed Strike, Wilding, Wilding Strike, base attack bonus +11.",
				"Benefit": [ "The damage die of your unarmed strikes increases to 1d8 (or 1d6 if you are Small). This does not stack with any other effects that increase the damage die of your unarmed strikes, including levels in classes such as monk. Increases to your actual size category (such as enlarge person) still increase your damage die as normal." ]
			},
			{
				"-id": "Improvisation",
				"-title": "Improvisation",
				"-groups": "Human",
				"-description": "You can figure out how to do almost anything.",
				"Prerequisites": "Int 13, Fast Learner, human.",
				"Benefit": [ "You gain a +2 bonus on all skill checks for skills you have no ranks in. Furthermore, you can use all skills designated “trained only” untrained." ]
			},
			{
				"-id": "Improvisational Focus",
				"-title": "Improvisational Focus",
				"-groups": "Combat",
				"-description": "A makeshift weapon in your hands is as dangerous as any other instrument of violence.",
				"Prerequisites": "Catch Off-Guard or Throw Anything, base attack bonus +1.",
				"Benefit": [ "You gain a +1 bonus on attack rolls you make using an improvised weapon. You are considered proficient with the improvised weapon and are considered to have Weapon Focus with improvised weapons for the purpose of meeting the prerequisites of feats that specifically select a weapon, such as Weapon Specialization." ],
				"Special": [ "Thrown splash weapons are not considered improvised weapons for the purposes of this feat." ]
			},
			{
				"-id": "Improvisational Healer",
				"-title": "Improvisational Healer",
				"-description": "In any urban or natural setting, you can scavenge for useful medical supplies.",
				"Prerequisites": "Heal 1 rank.",
				"Benefit": [ "When attempting a Heal check that normally requires a healer's kit, you don't take a penalty on the check for not having a healer's kit. When you use a healer's kit, you can augment it with improvised supplies, gaining an additional +2 circumstance bonus on your check. Finally, you can treat any potion of cure light wounds, potion of cure moderate wounds, or potion of cure serious wounds you drink yourself or administer to another character as though its caster level were equal to the number of ranks you have in the Heal skill. The spell's normal limitations apply; for example, a potion of cure light wounds can cure a maximum of 1d8+5 points of damage, even if you have more than 5 ranks in the Heal skill." ]
			},
			{
				"-id": "Improvised Defenses",
				"-title": "Improvised Defenses",
				"-groups": "Combat",
				"-description": "You can deftly defend yourself with makeshift weapons.",
				"Prerequisites": "Catch Off-Guard or Throw Anything, base attack bonus +1.",
				"Benefit": [ "You gain a +1 shield bonus to AC when you are wielding an improvised weapon and have your other hand free." ]
			},
			{
				"-id": "Improvised Weapon Mastery",
				"-title": "Improvised Weapon Mastery",
				"-groups": "Combat",
				"-description": "You can turn nearly any object into a deadly weapon, from a razor-sharp chair leg to a sack of flour.",
				"Prerequisites": "Catch Off-Guard or Throw Anything, base attack bonus +8.",
				"Benefit": [ "You do not suffer any penalties for using an improvised weapon. Increase the amount of damage dealt by the improvised weapon by one step (for example, 1d4 becomes 1d6) to a maximum of 1d8 (2d6 if the improvised weapon is two-handed). The improvised weapon has a critical threat range of 19-20, with a critical multiplier of ×2." ]
			},
			{
				"-id": "In Harm's Way",
				"-title": "In Harm's Way",
				"-groups": "Combat",
				"-description": "You put yourself in danger's path to save your allies.",
				"Prerequisites": "Bodyguard.",
				"Benefit": [ "While using the aid another action to improve an adjacent ally's AC, you can intercept a successful attack against that ally as an immediate action, taking full damage from that attack and any associated effects (bleed, poison, etc.). A creature cannot benefit from this feat more than once per attack." ]
			},
			{
				"-id": "Incite Paranoia",
				"-title": "Incite Paranoia",
				"-groups": "Combat",
				"-description": "You can convince anyone of her allies' ill intent.",
				"Prerequisites": "Int 13, Combat Expertise, Deceitful, Greater Feint, Improved Feint, base attack bonus +6.",
				"Benefit": [
					"When you successfully feint in combat, if you succeed by 5 or more, the target no longer provides flanking to its allies and no longer gains or grants the benefits of teamwork feats until the beginning of your next turn.",
					"In addition, when you attempt a Bluff check to lie and the lie implies that one or more of the target's allies have betrayed her or are secretly against her, your lie is one step more believable than normal, from far-fetched to unlikely and from unlikely to believable (if the lie was already less believable than far-fetched, this feat has no effect)."
				]
			},
			{
				"-id": "Incorporeal Intuition",
				"-title": "Incorporeal Intuition",
				"-description": "You notice incorporeal creatures, even those lurking in walls.",
				"Prerequisites": "Psychic Sensitivity or the ability to cast psychic spells, Spirit Sense.",
				"Benefit": [ "You can sense the presence and movement of incorporeal creatures though solid walls, as long as that incorporeal creature is adjacent to you. When you sense a creature in this way, you can attempt a Knowledge (religion) check to identify the creature and its special powers or vulnerabilities, with a –5 penalty. When you sense an incorporeal creature with this ability and use a readied action to attack it when it attacks from inside the wall, it doesn't gain cover against your attack." ],
				"Normal": [ "Incorporeal creatures are silent unless they choose to make a sound and are thus almost impossible to detect when inside a solid wall. When readying to attack an incorporeal creature in a solid wall, it gains cover against your attack." ]
			},
			{
				"-id": "Incremental Elemental Assault",
				"-title": "Incremental Elemental Assault",
				"-groups": "Suli",
				"-description": "You may activate and quench your elemental assault ability multiple times per day.",
				"Prerequisites": "Suli",
				"Benefit": ["You may use your elemental assault ability in 1-round increments, up to a maximum number of rounds per day equal to your character level. These rounds do not have to be consecutive. Activating the ability is a swift action; ending it is a free action."],
				"Normal": "You can use elemental assault once per day. It lasts a number of rounds equal to your class level."
			},
			{
				"-id": "Indomitable Mount",
				"-title": "Indomitable Mount",
				"-groups": "Combat, Local",
				"-description": "Your skill at riding helps your mount avoid attacks.",
				"Prerequisites": "Mounted Combat, Handle Animal 5 ranks, Ride 5 ranks.",
				"Benefit": [ "Once per round when your mount must make a saving throw, you can make a Ride check as an immediate action. Your mount makes its save if your Ride check result is greater than the DC of the opponent's attack." ]
			},
			{
				"-id": "Indomitable Mountain Avalanche",
				"-title": "Indomitable Mountain Avalanche",
				"-groups": "Combat",
				"-description": "You are an impassable mountain, hurling your enemies back.",
				"Prerequisites": "Wis 15, Combat Reflexes, Improved Unarmed Strike, Indomitable Mountain Peak, Indomitable Mountain Style, base attack bonus +9.",
				"Benefit": [ "If an opponent fails at a combat maneuver against you, you can use an attack of opportunity to make a melee attack against the opponent using your highest attack bonus. If the attack hits, instead of dealing damage, you can push the opponent back 5 feet for every 5 by which it failed its combat maneuver check (minimum 5 feet). Additionally, when you hit with an unarmed melee attack against an opponent who provoked an attack of opportunity by failing its Acrobatics check to move through a space you threaten, you can push the opponent back 5 feet instead of dealing damage. The opponent moves back in a straight line, but stops before hitting any obstacle or hazard." ]
			},
			{
				"-id": "Indomitable Mountain Peak",
				"-title": "Indomitable Mountain Peak",
				"-groups": "Combat",
				"-description": "You become more difficult to move or pass, an elusive peak your enemies cannot surmount.",
				"Prerequisites": "Wis 15, Combat Reflexes, Improved Unarmed Strike, Indomitable Mountain Style, base attack bonus +6.",
				"Benefit": [ "Whenever an opponent succeeds at a combat maneuver against you or at an Acrobatics check to avoid provoking an attack of opportunity when moving through a square you threaten, you immediately gain a +2 morale bonus to your CMD against the next combat maneuver against you or to the DC of the next Acrobatics check to avoid an attack of opportunity when moving through a square you threaten. This bonus stacks until either attempt fails against you." ]
			},
			{
				"-id": "Indomitable Mountain Style",
				"-title": "Indomitable Mountain Style",
				"-groups": "Combat,Style",
				"-description": "Like a rugged mountain, you are impassable and unmovable.",
				"Prerequisites": "Wis 13, Combat Reflexes, Improved Unarmed Strike, base attack bonus +4.",
				"Benefit": [ "As long as you do not take a move action, you gain a +4 morale bonus to your CMD and to the DC of Bluff checks used for feint attempts against you. Additionally, you are considered to be one size category larger for the purpose of calculating your CMD when creatures attempt Acrobatics checks to move through spaces you threaten without provoking attacks of opportunity." ]
			},
			{
				"-id": "Inexplicable Luck",
				"-title": "Inexplicable Luck",
				"-groups": "Human",
				"-description": "...",
				"Prerequisites": "Defiant Luck, human.",
				"Benefit": [ "Once per day, as a free action before a roll is made, you gain a +8 bonus on any single d20 roll. You can also use this ability after the roll is made, but if you do, this bonus is reduced to +4." ]
			},
			{
				"-id": "Infectious Weapons",
				"-title": "Infectious Weapons",
				"-description": "Your weapons spread your sickness.",
				"Prerequisites": "Ability to cause disease with a natural weapon via an extraordinary or supernatural ability.",
				"Benefit": [ "Creatures damaged by your ranged and melee weapon attacks have a chance to contract disease, as though they were damaged with your disease-spreading natural weapon." ]
			},
			{
				"-id": "Infuse Poison",
				"-title": "Infuse Poison",
				"-groups": "Item Creation",
				"-description": "You can infuse a poison with a magical effect.",
				"Prerequisites": "Brew Potion, Craft (alchemy) 5 ranks, caster level 3rd.",
				"Benefit": [
					"You can infuse an ingested poison with any spell of 3rd level or lower that you know and that targets one or more creatures and has a casting time of less than 1 minute.",
					"Infusing a poison takes 2 hours if its base price is 250 gp or less; otherwise, infusing a poison takes 1 day for each 1,000 gp in its base price. When you infuse a poison, you set the caster level, which must be sufficient to cast the spell in question and no higher than your own caster level. To infuse a poison, you must use up raw materials costing half of its base price.",
					"When you create an infused poison, you make any choices that you would normally make when casting the spell.",
					"Whoever ingests the infused poison is the target of the spell."
				]
			},
			{
				"-id": "Infused Spell Cartridges",
				"-title": "Infused Spell Cartridges",
				"-groups": "Combat",
				"-description": "You can improve your arcane ammunition with more powerful magic.",
				"Prerequisites": "Int 15, Arcane Strike, Spell Cartridges, ability to cast 4th-level arcane spells, proficient with firearms.",
				"Benefit": [ "While your gun is imbued with power from the Arcane Strike feat, you can spend a standard action to cast a spell of 3rd level or lower and deliver it via a force bullet. The spell must have a range of touch or produce a ray; if the spell would produce multiple rays, the bullet delivers the effect of only one ray. If the force bullet strikes a target, it deals its force damage and also delivers the effects of the spell. If the force bullet critically hits a target, the spell deals double damage." ]
			},
			{
				"-id": "Inner Breath",
				"-title": "Inner Breath",
				"-groups": "Sylph",
				"Prerequisites": "Character level 11th, sylph.",
				"Benefit": [ "You no longer need to breathe. You are immune to effects that require breathing (such as inhaled poison). This does not give you immunity to cloud or gas attacks that do not require breathing, such as cloudkill." ]
			},
			{
				"-id": "Inner Flame",
				"-title": "Inner Flame",
				"-groups": "Combat, Ifrit",
				"-description": "Your body generates so much heat that your mere touch scorches your enemies.",
				"Prerequisites": "Scorching Weapons, character level 7th, Ifrit.",
				"Benefit": [ "Your bonus on saves against fire attacks and spells with the fire descriptor or light descriptor increases to +4. When you use Scorching Weapons, the affected weapons deal an additional 1d6 points of fire damage instead of 1, and when you are grappling, you deal this damage to your grappling opponent on your turn." ]
			},
			{
				"-id": "Inner Light",
				"-title": "Inner Light",
				"-groups": "BoA",
				"-description": "Even when your innate powers over light fail you, you and your allies prove vigilant against dark forces, fighting until the end.",
				"Prerequisites": "Aasimar, daylight spell-like ability.",
				"Benefit": [
					"Whenever you cast your daylight spell-like ability, you do so as if your caster level were one higher.",
					"Whenever an enemy successfully counters or dispels your daylight spell-like ability, you and any allies within a 20-foot radius gain darkvision 60 feet for a number of rounds equal to your character level. This is a supernatural effect."
				]
			},
			{
				"-id": "Inscribe Magical Tattoo",
				"-title": "Inscribe Magical Tattoo",
				"-groups": "Item Creation",
				"-description": "You can craft magical tattoos.",
				"Prerequisites": "Craft (calligraphy, paintings, or tattoos) 5 ranks, caster level 5th.",
				"Benefit": [
					"You can create magical tattoos, magic items inked directly into the flesh of a willing or helpless creature. Both you and the recipient of the tattoo (if the recipient is not yourself) must be present during the entire tattooing process. Magic tattoos must be placed on a part of the body normally able to hold a magic item slot, but they do not count against or interfere with magic items worn on those slots. A single slot can only hold one magical tattoo (non-magical tattoos and tattoos acquired from the tattooed sorcerer archetype do not count against this limit). Tattoos may be inscribed on the following slots: belt, body, chest, feet, hands, head, neck, shoulder, ring (up to two), or wrist. They cannot be inscribed on armor, eye, headband, or shield slots.",
					"Magical tattoos are difficult to destroy, though they count as magic items for the purposes of dispel magic. The spell erase can permanently destroy a magical tattoo, but the bearer of the tattoo can resist the spell with a Will save, in addition to the caster needing to make a successful caster level check to erase the tattoo. Physically removing a magical tattoo with a sharp instrument or defacing it with fire or acid can destroy it as well. Doing so is a full-round action that not only requires the target to be willing or helpless, but also provokes attacks of opportunity. At least 2 points of damage per caster level of the tattoo must be dealt to destroy a magical tattoo in this manner.Magical tattoos follow the rules for magic item creation as though they were wondrous items, except that they can use the Craft (calligraphy, paintings, tattoos) skill. New magical tattoos can be researched and designed using the guidelines for pricing new magic items. Magical tattoos are treated as slotless magical items for pricing purposes.Tattoo magic binds magic into intricate patterns and sometimes into sentient art (see tattooed sorcerer archetype). Yet the wonders of tattoo magic are not limited to sorcerers—any spellcaster can craft magical tattoos, given the proper training."
				]
			},
			{
				"-id": "Inscribe Rune",
				"-title": "Inscribe Rune",
				"-groups": "Item Creation",
				"-description": "You can tattoo arcane runes upon your flesh or the flesh of others.",
				"Prerequisites": "Caster level 3rd.",
				"Benefit": [ "You can create runes. Inscribing a rune takes one day for each 1,000 gp in its base price. To inscribe a rune, you must use up raw materials costing half of its base price." ]
			},
			{
				"-id": "Insightful Advice",
				"-title": "Insightful Advice",
				"-description": "You teach others how to make the most of their skills.",
				"Prerequisites": "Perform (oratory) 3 ranks.",
				"Benefit": [ "You can attempt a skill check to aid an ally within 30 feet with a skill in which you are trained. This takes 1 minute, and during that time, you need only speak and be heard by your chosen ally to offer this aid. The bonus you grant is +2, regardless of any other effects that would alter your aid another bonus. This bonus applies to all checks the ally attempts with that skill for 1 day and does not stack with any other aid another bonus. Whether you succeed at or fail the skill check to aid another, you can attempt to use this ability only once per day for each ally." ]
			},
			{
				"-id": "Insightful Delivery",
				"-title": "Insightful Delivery",
				"-description": "Your knowledge of where to strike makes your poisons more deadly.",
				"Prerequisites": "Poison use class feature, studied strike +4d6.",
				"Benefit": [ "When you use a poisoned weapon to attempt an attack in conjunction with studied strike, the DC to resist the poison increases by half the number of your studied strike dice." ]
			},
			{
				"-id": "Insightful Gaze",
				"-title": "Insightful Gaze",
				"-description": "In your personal interactions, you notice what others don't. It's hard to get anything past you.",
				"Prerequisites": "Stern gaze class feature, Sense Motive 5 ranks.",
				"Benefit": [ "Whenever you make a Sense Motive check to oppose someone's Bluff check, you can roll two dice and take the higher result." ]
			},
			{
				"-id": "Inspired Alchemy",
				"-title": "Inspired Alchemy",
				"-description": "With some inspiration and elbow grease, you can recreate a consumed extract in a pinch.",
				"Prerequisites": "Ability to create 2nd-level extracts, alchemy class feature, inspiration class feature.",
				"Benefit": [ "You can recreate an extract that you consumed during the past hour. You must spend 10 minutes and expend a number of uses of inspiration equal to the level of the extract's formula to do so. When you recreate an extract in this way, it does not count toward the number of extracts you can prepare in a day." ]
			},
			{
				"-id": "Inspired Strike",
				"-title": "Inspired Strike",
				"-description": "You can turn your natural talent as easily to weapon-work as to skills.",
				"Prerequisites": "Studied combat class feature.",
				"Benefit": [ "When you damage a creature by using the studied combat class feature, you can expend one use of inspiration to roll an inspiration die and increase the damage by the number rolled." ]
			},
			{
				"-id": "Inspired by Fear",
				"-title": "Inspired by Fear",
				"-description": "When spreading fear to your enemies, you further embolden your allies.",
				"Prerequisites": "Ability to perform dirge of doom.",
				"Benefit": [ "Allies in the area of your dirge of doom receive a +4 morale bonus on saving throws against fear effects. At least one enemy must be in the dirge's area and become shaken by the dirge for you and your allies to receive this bonus." ]
			},
			{
				"-id": "Inspiring Bravery",
				"-title": "Inspiring Bravery",
				"-groups": "Combat",
				"-description": "Your bravery inspires bravery in others.",
				"Prerequisites": "Cha 13, bravery class feature.",
				"Benefit": [
					"As long as you are conscious and not stunned, dazed, or confused, allies within 30 feet who can see and hear you gain your bravery bonus on saving throws against fear.",
					"If you have Improved Bravery, they gain your bravery bonus on saving throws against all mind-affecting effects. If you have Social Bravery, your bravery bonus is added to the DC of checks to demoralize them, feint against them, change their attitude, or convince them to perform a request."
				]
			},
			{
				"-id": "Inspiring Mentor",
				"-title": "Inspiring Mentor",
				"-description": "Others listen to your words of encouragement and perform acts above and beyond as a result.",
				"Prerequisites": "Cha 13, inspire competence bardic performance.",
				"Benefit": [ "Inspire competence now affects all allies within 30 feet who can hear your performance, as long as they are attempting the skill you've selected." ],
				"Normal": [ "Inspire competence only affects one ally." ]
			},
			{
				"-id": "Inspiring Talent",
				"-title": "Inspiring Talent",
				"-groups": "Teamwork",
				"-description": "Your innate adaptability allows you to imitate others of your kind nearly flawlessly, to the extent that you can utilize their mastery over skills almost as if you had personally trained in their use.",
				"Prerequisites": "Half-elf, adaptability or ancestral arms racial trait.",
				"Benefit": [
					"Whenever you are within 30 feet of an ally who also has this feat, you gain the following benefits. If the ally has a Skill Focus feat, you also count as having that feat for the purpose of the following skill uses: Acrobatics checks to move through threatened squares, Bluff checks to feint, Escape Artist checks to escape a grapple, Intimidate checks to demoralize, Knowledge checks to identify a monster, and Perception checks to notice a creature using Stealth.",
					"Furthermore, if the ally has a weapon proficiency gained through the ancestral arms racial trait, you also count as having that weapon proficiency."
				]
			},
			{
				"-id": "Instant Judgment",
				"-title": "Instant Judgment",
				"-description": "...",
				"Prerequisites": "Second judgment class feature.",
				"Benefit": [ "You can spend an immediate action to pronounce a judgment or change an active judgment." ],
				"Normal": [ "Pronouncing or changing a judgment requires a swift action." ]
			},
			{
				"-id": "Intense Pain",
				"-title": "Intense Pain",
				"-groups": "Combat",
				"-description": "You deal additional damage when using your painful stare.",
				"Prerequisites": "Mesmerist level 7th, painful stare class feature.",
				"Benefit": [
					"When you use your painful stare ability to increase your own damage, you deal an additional 1d6 points of damage. This damage increases to 2d6 at mesmerist level 12th and to 3d6 at mesmerist level 18th.",
					"When you use painful stare to augment an ally's damage, the target of the painful stare takes 1 additional point of damage for every 4 mesmerist levels you possess."
				]
			},
			{
				"-id": "Intensified Spell",
				"-title": "Intensified Spell",
				"-groups": "Metamagic",
				"-description": "Your spells can go beyond several normal limitations.",
				"Benefit": [
					"An intensified spell increases the maximum number of damage dice by 5 levels. You must actually have sufficient caster levels to surpass the maximum in order to benefit from this feat. No other variables of the spell are affected, and spells that inflict damage that is not modified by caster level are not affected by this feat.",
					"Level Increase: +1 (an intensified spell uses up a spell slot one level higher than the spell's actual level.)"
				]
			},
			{
				"-id": "Intercept Blow",
				"-title": "Intercept Blow",
				"-groups": "Animal Companion Feat; Combat",
				"-description": "The animal willingly throws itself in harm's way to defend its master.",
				"Prerequisites": "Base attack bonus +1, animal companion.",
				"Benefit": [
					"Whenever the animal companion is adjacent to its master and its master is the target of a melee attack, the animal companion can expend an attack of opportunity as a free action, even if it isn't its turn, to attempt to intercept the attack. The animal companion makes an attack roll at its highest attack bonus with one of its natural attacks, as if it were making an attack of opportunity, with a –2 penalty for each size category the attacking creature is larger than the animal companion. If the result of this attack roll is greater than the attacking creature's attack roll result, the animal companion's master takes only half damage from the attack, and the other half of the damage is dealt to the animal companion. Effects that trigger on every successful hit (such as bleed or the trip special ability) affect both the animal companion and the master, as if both were hit by the attack; however, if it matters (such as for a touch spell that expires after a single hit), treat the animal companion as if it had been hit first.",
					"If the animal companion knows the defend trick, the animal companion can use Intercept Blow and any feat that lists it as a prerequisite to protect any ally that it is adjacent to and defending (as per the defend trick)."
				]
			},
			{
				"-id": "Intercept Charge",
				"-title": "Intercept Charge",
				"-groups": "Combat,Teamwork",
				"-description": "You can get in the way of an opponent charging your ally.",
				"Benefit": [ "When an opponent charges your ally with this feat, as an immediate action you can move up to your speed toward any square in the path of the charge. If you end your movement in the path of the charge, the opponent must stop when it becomes adjacent to you and then attack you instead of your ally. Your movement from using this feat counts toward your movement on your next turn." ]
			},
			{
				"-id": "Intimidate Animals",
				"-title": "Intimidate Animals",
				"-groups": "Combat",
				"-description": "You are skilled at intimidating animals with your bluster and fury.",
				"Prerequisites": "Greater Wild Empathy, Intimidate 5 ranks, Knowledge (nature) 5 ranks, wild empathy class feature.",
				"Benefit": [ "You add your Wisdom modifier on Intimidate checks against animals in addition to your Charisma modifier. an animal with 4 or fewer Hit Dice is frightened instead of shaken on a successful Intimidate check to demoralize it." ]
			},
			{
				"-id": "Intimidating Bane",
				"-title": "Intimidating Bane",
				"-description": "Your bane weapon strikes fear into your enemies.",
				"Prerequisites": "Bane class feature, Dazzling Display, Weapon Focus, character level 8th.",
				"Benefit": [ "Whenever you use Dazzling Display while your bane feature is active, you gain a +2 bonus on the Intimidate check that Dazzling Display allows against creatures of the type your bane weapon currently affects. Such creatures remain shaken while your bane feature is still active and effective against their creature type." ]
			},
			{
				"-id": "Intimidating Confidence",
				"-title": "Intimidating Confidence",
				"-groups": "Human",
				"Prerequisites": "Cha 13, Fearless Curiosity, Intimidate 5 ranks, human.",
				"Benefit": [ "You gain a +1 bonus on saving throws against effects with the emotion descriptor; this bonus stacks with the bonus granted by Fearless Curiosity. When you confirm a critical hit, as a free action you can make an Intimidate check to demoralize one creature you threaten. If you have the Dazzling Display feat, you can make Intimidate checks to demoralize all creatures you threaten instead. You gain a +2 bonus on this check if your weapon has a ×3 critical modifier, or +4 if it has a ×4 critical modifier." ]
			},
			{
				"-id": "Intimidating Gaze",
				"-title": "Intimidating Gaze",
				"-description": "There is something in your eyes that scares people.",
				"Prerequisites": "Cha 13+, stern gaze class feature, Intimidate 5 ranks.",
				"Benefit": [ "Once per day, as a free action, when making an Intimidate skill check, you can roll two dice and take the higher result." ]
			},
			{
				"-id": "Intimidating Glance",
				"-title": "Intimidating Glance",
				"-groups": "Combat",
				"-description": "Your gaze strikes fear into your enemies.",
				"Prerequisites": "Hypnotic stare class feature.",
				"Benefit": [ "You can attempt to demoralize the target of your hypnotic stare as a swift action." ],
				"Normal": [ "Attempting to demoralize an opponent is a standard action." ]
			},
			{
				"-id": "Intimidating Performance",
				"-title": "Intimidating Performance",
				"-description": "Your performance strikes fear in the hearts of foes.",
				"Prerequisites": "Ability to start a performance (or raging song) as a move action, bardic performance or raging song class feature.",
				"Benefit": [
					"When you start a performance (or a raging song) as a move or swift action, you can use a standard action to demoralize a foe, attempting a Perform check appropriate to your performance in place of the Intimidate check. Your performance must be one with an audible component.",
					"If you can start a performance as a swift action and you have the Dazzling Display feat, you can gain the benefit of Dazzling Display by succeeding at a Perform check in place of an Intimidate check."
				]
			},
			{
				"-id": "Intimidating Prowess",
				"-title": "Intimidating Prowess",
				"-groups": "Combat",
				"-description": "Your physical might is intimidating to others.",
				"Benefit": [ "Add your Strength modifier to Intimidate skill checks in addition to your Charisma modifier." ]
			},
			{
				"-id": "Intoxicating Flattery",
				"-title": "Intoxicating Flattery",
				"-description": "You know how to compromise a target's judgment with lies.",
				"Prerequisites": "Deceitful, Bluff 5 ranks.",
				"Benefit": [
					"You can flatter a creature in a protracted interaction (taking at least 1 minute) to bestow in them an inflated sense of self worth that muddles their judgment.",
					"At the end of the tirade of flattery, attempt a Bluff check against a DC equal to 10 + the creature's HD + the creature's Wisdom modifier or equal to 10 + the creature's Sense Motive modifier, whichever is higher. If you succeed, the target takes a –2 penalty on Will saving throws, Wisdom-based skill checks, and Wisdom ability checks for 1 hour plus an additional hour for every 5 by which your result exceeds the DC. The target can remove the effect early by taking 10 minutes to compose herself. If you fail this check, any creature who witnesses the failure is immune to your flattery from this feat for 24 hours. If you fail by 5 or more, the target's attitude toward you decreases by 1 step."
				]
			},
			{
				"-id": "Intrepid Rescuer",
				"-title": "Intrepid Rescuer",
				"-groups": "Combat",
				"-description": "You instinctively react to interfere with foes that attack your allies or innocents.",
				"Prerequisites": "Combat Reflexes",
				"Benefit": [
					"Whenever an opponent you threaten makes an attack against a helpless, prone, or stunned ally or any attack against a noncombatant, that opponent provokes an attack of opportunity from you. If your attack of opportunity hits your foe, she takes a - 4 penalty on the attack roll that provoked this attack of opportunity.",
					"Combat Trick",
					"Note If using the optional Stamina Pool rules, the following trick may be used with this feat.",
					"Combat Trick: When an opponent provokes an attack of opportunity from you as a result of the Intrepid Rescuer feat, if your attack of opportunity hits, you can spend 5 stamina points to cause the opponent's attack to automatically miss your ally."
				]
			},
			{
				"-id": "Intrusive Presence",
				"-title": "Intrusive Presence",
				"-description": "You can rifle through the thoughts and memories of your host.",
				"Prerequisites": "Int or Cha 21, Hidden Presence, Manipulative Presence, ability to cast possession or greater possession.",
				"Benefit": [
					"You can use detect thoughts at will as a spell-like ability against a host creature you possess. The host receives no saving throw, and the effect functions as if you had concentrated for 3 rounds. You can also use seek thoughts on your host as a spell-like ability once during the possession. The host can attempt a Will save with a DC equal to the DC of the original possession effect.",
					"If the host succeeds, the effect fails and the host become aware of the possession if it wasn't already."
				]
			},
			{
				"-id": "Intuitive Spell",
				"-title": "Intuitive Spell",
				"-groups": "Metamagic",
				"-description": "You can avoid the need for thought components by trusting your instincts.",
				"Benefit": [
					"An intuitive spell can be cast with no thought components. Spells without thought components are not affected.",
					"Level Increase: +1 (an intuitive spell uses up a spell slot 1 level higher than the spell's actual level."
				]
			},
			{
				"-id": "Invoke Primal Instinct",
				"-title": "Invoke Primal Instinct",
				"-description": "You can use your ability to take the shape of an animal to enhance your bluff skill, giving yourself an aura of danger or meekness that influences nearby creatures into doing what you want.",
				"Prerequisites": "Bluff 1 rank, wild shape class feature, gnome.",
				"Benefit": [ "As a standard action, you can pantomime or describe predator- or prey-like behavior, expend one of your uses of wild shape, and make a Bluff check. All creatures within 30 feet that fail a Will save against your Bluff check DC regard you as a figure of either fear or contempt (your choice applies to all affected creatures). If you choose fear, the targets are frightened for 1 round per druid level. If you choose contempt, the targets consider you harmless for 1 minute, ignoring you unless you attack them or take a threatening action." ]
			},
			{
				"-id": "Iron Will",
				"-title": "Iron Will",
				"-description": "You are more resistant to mental effects.",
				"Benefit": [ "You get a +2 bonus on all Will saving throws." ]
			},
			{
				"-id": "Ironclad Logic",
				"-title": "Ironclad Logic",
				"-description": "You appeal to sound reasoning and fact, rather than to emotion, when attempting to sway others.",
				"Prerequisites": "Int 19, Diplomacy 3 ranks.",
				"Benefit": [
					"You gain a +4 bonus on Diplomacy checks whenever you add your Charisma modifier on those checks.",
					"If you have at least 10 ranks in Diplomacy and an Intelligence score of 27 or more, this bonus increases to +8. This bonus doesn't stack with the bonus from Skill Focus (Diplomacy), but this feat counts as Skill Focus (Diplomacy) for the purpose of feats and other elements with Skill Focus (Diplomacy) as a prerequisite. In verbal duels, when using tactics to which you assigned an Intelligence-based skill, you can add your Intelligence modifier instead of your Charisma modifier to the associated skill check."
				]
			},
			{
				"-id": "Ironguts",
				"-title": "Ironguts",
				"-description": "You have an especially strong stomach.",
				"Prerequisites": "Con 13; dwarf, half-orc, or orc.",
				"Benefit": [ "You gain a +2 racial bonus on saving throws against any effect causing the nauseated or sickened conditions and against all ingested poisons (but not other poisons). In addition, you receive a +2 bonus on Survival skill checks to find food for yourself (and only yourself )." ]
			},
			{
				"-id": "Ironhide",
				"-title": "Ironhide",
				"-description": "Your skin is thicker and more resilient than that of most of your people.",
				"Prerequisites": "Con 13; dwarf, half-orc, or orc.",
				"Benefit": [ "You gain a +1 natural armor bonus due to your unusually tough hide." ]
			},
			{
				"-id": "Island Blood",
				"-title": "Island Blood",
				"-description": "You are the descendant of someone recruited to the Island or the bastard result of an Islander's illicit pairing with someone foreign to that land.",
				"Prerequisites": "You may only gain this feat at 1st level.",
				"Benefit": [ "Though you may not know it, the blood of greatness flows in your veins. Pick two skills that share the same associated ability score. Those skills are always considered class skills for you. It's possible that Island agents may come looking for you, either to evaluate you for an invitation or to cover up an embarrassing dalliance, as determined by the GM's whim." ]
			},
			{
				"-id": "Jabbing Dancer",
				"-title": "Jabbing Dancer",
				"-groups": "Combat",
				"-description": "You've learned to bend and shift your body to avoid attacks and reposition yourself advantageously.",
				"Prerequisites": "Dodge, Improved Unarmed Strike, Jabbing Style, Mobility; base attack bonus +9, brawler level 5th, or monk level 5th.",
				"Benefit": [ "Each time you hit with an unarmed strike while using Jabbing Style, you can move 5 feet without provoking an attack of opportunity as long as you move to a space adjacent to the opponent you hit with the unarmed strike. If you use this feat, you cannot take a 5-foot step during your next turn." ]
			},
			{
				"-id": "Jabbing Master",
				"-title": "Jabbing Master",
				"-groups": "Combat",
				"-description": "Your quick punches become even more lethal.",
				"Prerequisites": "Dodge, Improved Unarmed Strike, Jabbing Dancer, Jabbing Style, Mobility, Power Attack; base attack bonus +12, brawler level 8th, or monk level 8th.",
				"Benefit": [ "While using Jabbing Style, the extra damage you deal when you hit a single target with two unarmed strikes increases to 2d6, and the extra damage when you hit a single target with three or more unarmed strikes increases to 4d6." ]
			},
			{
				"-id": "Jabbing Style",
				"-title": "Jabbing Style",
				"-groups": "Combat,Style",
				"-description": "A cluster of quick strikes deals more damage than a single roundhouse swing.",
				"Prerequisites": "Improved Unarmed Strike; base attack bonus +6, brawler's flurry class feature, or flurry of blows class feature.",
				"Benefit": [ "When you hit a target with an unarmed strike and you have hit that target with an unarmed strike previously that round, you deal an extra 1d6 points of damage to that target." ]
			},
			{
				"-id": "Jaguar Pounce",
				"-title": "Jaguar Pounce",
				"-groups": "Combat",
				"-description": "Your ambushes are especially lethal.",
				"Prerequisites": "Base attack bonus +4.",
				"Benefit": [ "When making a charge or using Spring Attack against an opponent who is flat-footed or helpless, you treat your first melee attack against that target as if you had the Improved Critical feat." ]
			},
			{
				"-id": "Janni Rush",
				"-title": "Janni Rush",
				"-groups": "Combat",
				"-description": "When you leap to the attack, your blows are like bolts from on high.",
				"Prerequisites": "Improved Unarmed Strike, Janni Style, Janni Tempest, Acrobatics 8 ranks, Perform (dance) 8 ranks.",
				"Benefit": [ "While using Janni Style, you are always considered to have a running start when jumping. Further, if you jump as part of a charge and make an unarmed strike against the designated opponent, a hit allows you to roll the unarmed strike's damage dice twice and add the results together before adding modifiers (such as from Strength) or extra dice (such as precision-based damage or dice from weapon abilities). The extra damage dice are not multiplied on a successful critical hit." ]
			},
			{
				"-id": "Janni Style",
				"-title": "Janni Style",
				"-groups": "Combat,Style",
				"-description": "Your whirling fighting technique makes you difficult to hit.",
				"Prerequisites": "Improved Unarmed Strike, Acrobatics 3 ranks, Perform (dance) 3 ranks.",
				"Benefit": [ "While using this style, you take only a -1 penalty to AC for charging. Further, opponents that flank you gain only a +1 bonus on attack rolls against you." ]
			},
			{
				"-id": "Janni Tempest",
				"-title": "Janni Tempest",
				"-groups": "Combat",
				"Prerequisites": "Improved Unarmed Strike, Janni Style, Acrobatics 5 ranks, Perform (dance) 5 ranks.",
				"Benefit": [ "While you are using the Janni Style feat, whenever you make an unarmed attack and hit an opponent, you gain a +4 bonus on checks made to bull rush or trip that opponent, as long as the combat maneuver is your next attack by the end of your turn. You do not provoke an attack of opportunity from the target of the maneuver." ]
			},
			{
				"-id": "Jawbreaker",
				"-title": "Jawbreaker",
				"-groups": "Combat",
				"Prerequisites": "Improved Unarmed Strike, Stunning Fist, Heal 6 ranks.",
				"Benefit": [ "When you make a successful Stunning Fist attempt against an opponent that is grappled, helpless, or stunned, instead of imparting any other Stunning Fist effect, you can cripple that opponent's mouth, dealing normal unarmed strike damage and 1d4 points of bleed damage. Until the bleed damage ends, the target is unable to use its mouth to attack, speak clearly, and employ verbal spell components. A creature that is immune to critical hits or that has no discernible mouth is immune to the effects of this feat." ]
			},
			{
				"-id": "Jinx Alchemy",
				"-title": "Jinx Alchemy",
				"-description": "With your knowledge of alchemy, creatures you jinx cannot benefit from most sorts of alchemical compounds.",
				"Prerequisites": "Swift alchemy class feature, Halfling Jinx alternate racial trait.",
				"Benefit": [ "A jinxed creature cannot benefit from the effects of potions, elixirs, or any other substance that he must ingest in order to activate. This includes alchemical substances such as antitoxin, but not extracts, mutagens, or other alchemist class abilities that only affect the alchemist. A jinxed creature still takes any penalties and detrimental effects from ingested compounds or poisons." ]
			},
			{
				"-id": "Jinxed Spell",
				"-title": "Jinxed Spell",
				"-groups": "Metamagic",
				"-description": "You can make a creature that fails its spell save suffer your jinx as well.",
				"Prerequisites": "Any two metamagic feats, Halfling Jinx alternate racial trait.",
				"Benefit": [
					"Any creature that fails its saving throw against a jinxed spell also suffers the effects of your jinx. This feat has no effect on spells that do not allow a saving throw. If the spell affects an area or multiple creatures, you must select one creature to take the jinx, unless you have the Area Jinx feat; if you have the Area Jinx feat, choose a jinx burst area within the spell's area or among its targets and apply the jinx to those in the burst that failed their save.",
					"Level Increase: +1 (a jinxed spell uses up a spell slot one level higher than the spell's actual level.)"
				]
			},
			{
				"-id": "Joyless Toil",
				"-title": "Joyless Toil",
				"-groups": "Combat",
				"-description": "Your strikes render your enemy distracted and unable to focus on productive action.",
				"Prerequisites": "Dex 13, Wis 13, Improved Unarmed Strike, base attack bonus +8.",
				"Benefit": [ "Joyless Toil forces a foe damaged by your unarmed attack to attempt a Fortitude saving throw (DC = 10 + half your character level + your Wisdom modifier) in addition to taking damage normally. You must declare that you are using this feat before you make your attack roll—thus, a failed attack roll wastes the attempt. An opponent who fails this saving throw is nauseated for 1 round or until the opponent is attacked. You can attempt to use Joyless Toil once per day for every 4 character levels you have, but you can use it no more than once per round. Constructs, incorporeal creatures, mindless creatures, plants, undead, and creatures that are immune to critical hits cannot be affected by this ability." ]
			},
			{
				"-id": "Judgment Surge",
				"-title": "Judgment Surge",
				"-description": "Once per day, the power of your faith surges, further empowering your judgments.",
				"Prerequisites": "Judgment class feature",
				"Benefit": [ "Once per day, you can treat your class level for your judgment class feature as if it were 3 higher than normal. If you have multiple judgments active at the same time, this benefit applies to all of them." ]
			},
			{
				"-id": "Juggle Load",
				"-title": "Juggle Load",
				"-groups": "Combat",
				"-description": "Your fingers are so nimble that reloading your sling is almost effortless for you.",
				"Prerequisites": "Ammo Drop, Sleight of Hand 1 rank, proficient with sling.",
				"Benefit": [ "You can load a sling or double sling as a free action. This does not provoke attacks of opportunity. This feat allows you to fire your sling as many times in a full-attack action as you could attack if you were using a bow." ]
			},
			{
				"-id": "Juju Way",
				"-title": "Juju Way",
				"-groups": "Teamwork",
				"-description": "You can use spirits of the unseen world to carry your spells for you.",
				"Prerequisites": "Knowledge (religion) 3 ranks, human.",
				"Benefit": [ "You can cast spells with the range of “touch” at a range of 20 feet if the recipient is a willing ally who also has this feat." ]
			},
			{
				"-id": "Juke",
				"-title": "Juke",
				"-groups": "Combat",
				"-description": "You can avoid a charge, leaving your opponent vulnerable to attacks by you or your allies.",
				"Prerequisites": "Dex 13, Dodge, Mobility, Sidestep.",
				"Benefit": [ "When an opponent charges you, you gain a +4 dodge bonus to your AC. If the charger's attack roll misses you and his movement ends while he is adjacent to you, you can switch places with the opponent as an immediate action, and he is considered to be flanked by you until the end of your next turn. You can't use the benefits of Juke if you ready an action to set a weapon with the brace special quality against a charging foe." ]
			},
			{
				"-id": "Jumper",
				"-title": "Jumper",
				"-groups": "Animal Companion Feat",
				"-description": "You are a natural leaper.",
				"Prerequisites": "Acrobatics 1 rank, creature type other than humanoid or outsider.",
				"Benefit": [ "You always count as having a running start when making jump checks using Acrobatics. Acrobatics becomes a class skill for you." ]
			},
			{
				"-id": "Jungle Survivalist",
				"-title": "Jungle Survivalist",
				"-description": "Normally pestilential rain forests are a safe haven and home to you.",
				"Prerequisites": "Favored terrain (jungle) class feature.",
				"Benefit": [ "You gain a +2 bonus on saving throws against diseases, poisons, and the distraction ability of creatures with the swarm subtype. You also gain a +2 bonus on Acrobatics and Climb checks when climbing trees and a +2 bonus on Perception checks against creatures that gain a racial bonus on Stealth checks in vegetation." ]
			},
			{
				"-id": "Just out of Reach",
				"-title": "Just out of Reach",
				"-groups": "Combat",
				"-description": "The farther an attacker is from you, the more easily you avoid its melee attacks.",
				"Prerequisites": "Dex 13, Dodge, Mobility.",
				"Benefit": [ "When a foe more than 5 feet away from you makes a melee attack against you using reach, you gain a +4 dodge bonus to your AC against the attack." ]
			},
			{
				"-id": "Keen Scent",
				"-title": "Keen Scent",
				"-description": "Your nose is as sensitive as that of a wild predator.",
				"Prerequisites": "Wis 13, half-orc or orc.",
				"Benefit": [ "You gain the scent special ability." ]
			},
			{
				"-id": "Keif Euphoria",
				"-title": "Keif Euphoria",
				"-description": "The calming effects of keif make you difficult to disturb.",
				"Prerequisites": "Sahir-Afiyun or keif addict.",
				"Benefit": [ "When you take a dose of keif, in addition to its normal initial effect, you gain a +2 bonus on saves against emotion and fear effects. Once per day, if you fail a saving throw against an emotion or fear effect while you are under the initial effect of keif, you can attempt another saving throw 1 round later at the same DC." ]
			},
			{
				"-id": "Keif Healing",
				"-title": "Keif Healing",
				"-description": "Consuming keif makes you feel healthier.",
				"Prerequisites": "Sahir-Afiyun or keif addict.",
				"Benefit": [ "When you take a dose of keif, in addition to its normal initial effect, you gain a number of temporary hit points equal to your total Hit Dice for 1 hour. Temporary hit points gained from additional doses of keif do not stack." ]
			},
			{
				"-id": "Keif Magic",
				"-title": "Keif Magic",
				"-description": "You have intertwined your familiarity with keif and magic to unlock strange powers of enchantment and necromancy.",
				"Prerequisites": "Able to cast 2nd-level spells, keif user, and Spell Focus (enchantment) or Spell Focus (necromancy).",
				"Benefit": [
					"You can easily recognize all forms of keif, including tainted or false forms, and gain a +5 competence bonus to Appraise checks made to determine the value of keif or realize that a substance is not the real thing. You gain a +1 bonus on Fortitude saving throws and a +2 bonus on saving throws against poison. This feat counts as the Endurance feat for the purpose of qualifying for the Diehard feat.",
					"Note: “Keif” is a fictional drug much like cannabis."
				]
			},
			{
				"-id": "Keif Rejuvenation",
				"-title": "Keif Rejuvenation",
				"-description": "When you are close to death, your body can convert keif into lifesaving medicine.",
				"Prerequisites": "Sahir-Afiyun or keif addict.",
				"Benefit": [
					"If you are brought to 0 or fewer hit points while under the initial effect of keif, you can end the drug's initial effect as an immediate action. If you do, you gain a number of temporary hit points equal to your Constitution score.",
					"These temporary hit points last 1 hour. Upon using this feat, you are sickened for 1d6 hours."
				]
			},
			{
				"-id": "Ki Diversity",
				"-title": "Ki Diversity",
				"-groups": "Combat,Faction",
				"-description": "...",
				"Prerequisites": "Ki pool class feature, Wis 13, Kusari-Gama 25 TPA. ",
				"Benefit": [
					"You learn how to channel your ki in a new ability. Choose one of the following ki powers:",
					"Bone Crusher: When you succeed at a trip or disarm combat maneuver, you may spend 1 point from your ki pool as a swift action to deal damage to your opponent as if you had hit them with an unarmed strike.",
					"Dim Mak: You may spend 1 point from your ki pool as a swift action to execute your next Stunning Fist attack as a melee touch attack rather than a normal melee attack.",
					"Mind of the Kensai: You may spend 1 point from your ki pool as a swift action to imbue a single melee weapon in your hands with the ki focus weapon special ability until your next turn.",
					"Wings of the Crane: If you have the Deflect Arrows feat, you may spend 1 point from your ki pool as an immediate action to use that feat to deflect a second missile weapon that round. If you have the Snatch Arrows feat, you may use this ability to catch a second weapon, but not throw it back.",
					"Zen Combatant: You may spend 1 point from your ki pool as a swift action to substitute your Wisdom score for your Strength or Dexterity for all melee or ranged attacks you make that round. "
				],
				"Special": [ "You can gain this feat multiple times. Its effects do not stack. Each time you take the feat, you may choose an additional ability from the list above. Monks can select this feat as a monk bonus feat." ]
			},
			{
				"-id": "Ki Stand",
				"-title": "Ki Stand",
				"-description": "If an opponent knocks you down, you swiftly rebound with an attack.",
				"Prerequisites": "Ki pool.",
				"Benefit": [
					"While you have at least 1 ki point in your ki pool, you can stand up as a swift action that provokes attacks of opportunity.",
					"You may spend 1 point of your ki pool to stand up as a swift action without provoking attacks of opportunity."
				]
			},
			{
				"-id": "Ki Throw",
				"-title": "Ki Throw",
				"-groups": "Combat",
				"-description": "Your physical control and mastery of momentum allows you to throw enemies.",
				"Prerequisites": "Improved Trip, Improved Unarmed Strike.",
				"Benefit": [ "On a successful unarmed trip attack against a target your size or smaller, you may throw the target prone in any square you threaten rather than its own square. This movement does not provoke attacks of opportunity, and you cannot throw the creature into a space occupied by other creatures." ],
				"Special": [ "A monk may gain Ki Throw as a bonus feat at 10th level. A monk with this feat can affect creatures larger than his own size by spending 1 ki point per size category difference." ]
			},
			{
				"-id": "Kick Up",
				"-title": "Kick Up",
				"-groups": "Combat",
				"-description": "You have learned how to kick items on the ground to a ready hand.",
				"Prerequisites": "Dex 12, Acrobatic, Acrobatics 1 rank; slayer level 1st or swashbuckler level 1st.",
				"Benefit": [ "As long as you have at least one hand free, you can use a swift action to retrieve a single unattended item or weapon that weighs 10 pounds or less from the ground, either in your square or in any adjacent square not occupied or threatened by an enemy. Additionally, when you kick up a weapon and attempt a feint before the end of your turn, you receive a +2 circumstance bonus on the feint attempt." ]
			},
			{
				"-id": "Killing Flourish",
				"-title": "Killing Flourish",
				"-groups": "Combat",
				"-description": "You inspire dread in other foes when you slay an enemy.",
				"Prerequisites": "Intimidating Prowess, Intimidate 4 ranks, slayer level 4th.",
				"Benefit": [ "When you reduce your target to below 0 hit points with a melee attack, as a swift action you can attempt an Intimidate check to demoralize all foes within 30 feet who can see your attack." ]
			},
			{
				"-id": "Kinetic Counter",
				"-title": "Kinetic Counter",
				"-description": "You can use your kinetic blast to counter your enemy's opposing elemental abilities.",
				"Prerequisites": "Cold simple blast, fire simple blast, or water simple blast; kinetic blast class feature.",
				"Benefit": [ "You can ready an action to use your blast to counter an opponent's elemental abilities. If you ready a fire simple blast, you can counter any spell or activated extraordinary, supernatural, or spell-like ability that has the water or ice descriptor, and if you ready a cold or water simple blast, you can counter any spell or activated extraordinary, supernatural, or spell-like ability that has the fire descriptor. In order to successfully counter the effect, you must succeed at a caster level check with a DC equal to either 11 + the opponent's caster level (for spells and spell-like abilities) or 11 + the opponent's Hit Dice (for extraordinary and supernatural abilities). Against spells and spell-like abilities, treat a success as if you had counterspelled the effect using dispel magic. Against activated supernatural and extraordinary abilities, a successful kinetic counter negates the ability's effect entirely while still expending the ability. For example, if a pyrokineticist succeeds at her caster level check against a white dragon's breath weapon, she negates the breath weapon's effect in the entire area, and the dragon must wait 1d4 rounds to use its breath weapon again." ]
			},
			{
				"-id": "Kinetic Leap",
				"-title": "Kinetic Leap",
				"-description": "Kinetic energy propels you when you jump.",
				"Prerequisites": "Acrobatics 3 ranks, kinetic blast class feature.",
				"Benefit": [ "Once per day as a swift action, you can conjure a burst of energy from your kinetic blast to help you jump a long distance, adding a +10 bonus on your Acrobatics check to jump; if you have at least 10 ranks in Acrobatics, the bonus increases to +20. By accepting 1 point of burn, you can use this ability at will until your burn is removed." ]
			},
			{
				"-id": "Kinslayer",
				"-title": "Kinslayer",
				"-description": "Your intimate knowledge of anatomy, deep hatred of your own kind, and delight in spilling your people's blood make you a lethal combatant against your own race.",
				"Prerequisites": "Knowledge 3 ranks (see special), evil alignment.",
				"Benefit": [ "Your attacks deal an additional 1d6 points of precision damage against creatures that have the same creature type (and subtype, if applicable) as you. This bonus damage stacks with other sources of precision damage, such as sneak attack. If you have more than one subtype, you must choose one of them—this feat applies only to targets of that subtype. Once made, this choice can't be changed." ],
				"Special": [ "The Knowledge skill used to qualify for this feat must be appropriate for identifying creatures of your type." ]
			},
			{
				"-id": "Kirin Path",
				"-title": "Kirin Path",
				"-groups": "Combat",
				"-description": "You turn knowledge of your enemy into a flawless defense.",
				"Prerequisites": "Int 13, Kirin Strike, Kirin Style, Improved Unarmed Strike, Knowledge (arcana) 12 ranks, Knowledge (dungeoneering, local, nature, planes, or religion) 5 ranks.",
				"Benefit": [ "Whenever you make a Knowledge check to identify a creature, even when using Kirin Style, you can take 10 even if stress and distractions would normally prevent you from doing so. While using Kirin Style against a creature you have identified using that feat, if the creature ends its turn within your threatened area, you can spend a use of your attacks of opportunity that round to move up to 5 feet times your Intelligence modifier (minimum 1). You must end your move in a square threatened by the creature. This move does not provoke attacks of opportunity." ]
			},
			{
				"-id": "Kirin Strike",
				"-title": "Kirin Strike",
				"-groups": "Combat",
				"-description": "You have read the texts of the perfect way, and know how identify to your enemies' weak spot.",
				"Prerequisites": "Int 13, Kirin Style, Improved Unarmed Strike, Knowledge (arcana) 9 ranks, Knowledge (dungeoneering, local, nature, planes, or religion) 3 ranks.",
				"Benefit": [ "You gain a +2 insight bonus on Knowledge checks made to identify creatures, including the one Kirin Style allows. While using Kirin Style against a creature you have identified using that feat, as a swift action after you have hit a creature with a melee or ranged attack, you can add twice your Intelligence modifier in damage (minimum 2)." ]
			},
			{
				"-id": "Kirin Style",
				"-title": "Kirin Style",
				"-groups": "Combat,Style",
				"-description": "Your study and your grace allows you to exploit your enemies' weaknesses.",
				"Prerequisites": "Improved Unarmed Strike, Knowledge (arcana) 6 ranks, Knowledge (dungeoneering, local, nature, planes, or religion) 1 rank.",
				"Benefit": [ "While using this style, you can spend a swift action to make a Knowledge check to identify a single creature (DC 15 + the creature's CR for this purpose). If you succeed at the check, while using this style, you gain a +2 bonus on saving throws against that creature's attacks, as well as a +2 dodge bonus to AC against that creature's attacks of opportunity. These bonuses last for as long as you use this style. If you cease combat with the creature during this time and resume it later, you can attempt the check again." ]
			},
			{
				"-id": "Kitsune Style",
				"-title": "Kitsune Style",
				"-groups": "Combat,Style",
				"-description": "Your quick movement and trickery allow you to catch opponents off guard.",
				"Prerequisites": "Int 13, Combat Expertise, Improved Dirty Trick.",
				"Benefit": [ "While using this style, you can attempt to perform a dirty trick in place of an attack at the end of a charge." ]
			},
			{
				"-id": "Kitsune Tricks",
				"-title": "Kitsune Tricks",
				"-groups": "Combat",
				"-description": "Your quick wit and even quicker maneuvers leave your opponents reeling.",
				"Prerequisites": "Int 13; Combat Expertise; Improved Dirty Trick; Kitsune Style; base attack bonus +3 or monk level 3rd.",
				"Benefit": [ "While you are using the Kitsune Style feat, you can apply two different conditions with a single dirty trick combat maneuver check. Removing both conditions imparted in this way requires only one action." ]
			},
			{
				"-id": "Kitsune Vengeance",
				"-title": "Kitsune Vengeance",
				"-groups": "Combat",
				"-description": "You cleverly hide your attacks within your devious antics.",
				"Prerequisites": "Int 13; Combat Expertise; Improved Dirty Trick; Kitsune Style; Kitsune Tricks; base attack bonus +6 or monk level 6th.",
				"Benefit": [ "While using the Kitsune Style feat, when a foe provokes an attack of opportunity from you, you can attempt to perform a dirty trick combat maneuver in place of making a melee attack." ]
			},
			{
				"-id": "Knockout Artist",
				"-title": "Knockout Artist",
				"-description": "You are great at the surprise knockout.",
				"Prerequisites": "Sneak attack class feature, Improved Unarmed Strike.",
				"Benefit": [ "When you use your unarmed strike to deal nonlethal damage and sneak attack damage to an opponent denied his Dexterity bonus to AC, you gain a +1 bonus on the damage roll per each sneak attack damage die you roll." ]
			},
			{
				"-id": "Knotted Nets Combat Teamwork",
				"-title": "Knotted Nets Combat Teamwork",
				"-description": "You are capable of entangling far greater prey with the help of your allies.",
				"Prerequisites": "Exotic Weapon Proficiency (net), base attack bonus +1.",
				"Benefit": [
					"If you ready an attack with a net to entangle a creature when an ally of your size who also has this feat attempts to entangle that creature with a net, the two of you can entangle the creature as if you were one size category larger. The entangled creature can attempt to escape both nets as though they were a single net, using the lower of the nets' hit points, hardness (if any), and DCs to break or escape. Only you or your ally can attempt to control the entangled creature's movement with an opposed Strength check, but your ally grants you a +1 bonus on the check.",
					"If you work with three other allies of the same size who have this feat, you can entangle a creature as if you were two size categories larger. If you work with seven other allies in this way, you can instead entangle a creature as if you were three size categories larger."
				],
				"Normal": [ "A net is useful against only creatures within one size category of you." ]
			},
			{
				"-id": "Know Weakness",
				"-title": "Know Weakness",
				"-groups": "Combat",
				"-description": "You are well versed in the susceptibilities of your foes.",
				"Prerequisites": "Bardic knowledge class feature.",
				"Benefit": [ "When you successfully identify a creature with the appropriate Knowledge check, you gain a +1 bonus on attack and damage rolls against that creature for 1 round." ]
			},
			{
				"-id": "Kobold Ambusher",
				"-title": "Kobold Ambusher",
				"-groups": "Combat,Kobold",
				"-description": "...",
				"Prerequisites": "Stealth 4 ranks, kobold.",
				"Benefit": [ "You take no penalty on Stealth checks when you move up to your full speed. You can use the run or charge action and remain hidden, taking a –10 penalty on the check to do so." ],
				"Normal": [ "When moving greater than half speed up to your full speed, you take a –5 penalty on Stealth checks. When you are able to run or charge while using Stealth, you take a –20 penalty on the Stealth check." ]
			},
			{
				"-id": "Kobold Confidence",
				"-title": "Kobold Confidence",
				"-groups": "Kobold",
				"-description": "Your cunning, confidence, or faith in the draconic power in your blood allows you to overcome your physical frailty.",
				"Prerequisites": "Charisma 13, kobold.",
				"Benefit": [ "You use your Charisma, Intelligence, or Wisdom in place of Constitution to determine your bonus to Fortitude saves and your maximum negative hit points before death. Once this choice has been made, it can't be changed." ]
			},
			{
				"-id": "Kobold Flood",
				"-title": "Kobold Flood",
				"-groups": "Combat",
				"-description": "You are an expert at keeping creatures on the ground.",
				"Prerequisites": "Combat Expertise, Kobold Groundling, Kobold Style, Small size or smaller.",
				"Benefit": [ "You can make a grapple combat maneuver check to mount a prone Medium or Large foe. If you're successful, you move into the target's square and are considered to be on top of the target. For the target to stand, it must succeed at a combat maneuver check to break your grapple." ]
			},
			{
				"-id": "Kobold Groundling",
				"-title": "Kobold Groundling",
				"-groups": "Combat",
				"-description": "Your small size grants you superiority over grounded foes.",
				"Prerequisites": "Combat Expertise, Kobold Style, Small size or smaller.",
				"Benefit": [ "Prone creatures are denied their Dexterity bonus to AC against your attacks." ]
			},
			{
				"-id": "Kobold Sniper",
				"-title": "Kobold Sniper",
				"-groups": "Combat, Kobold",
				"Prerequisites": "Stealth 1 rank, kobold.",
				"Benefit": [ "When you are sniping, you only take a –10 penalty on your Stealth checks to stay hidden." ],
				"Normal": [ "You take a –20 penalty on your Stealth check to maintain your obscured location while sniping." ]
			},
			{
				"-id": "Kobold Style",
				"-title": "Kobold Style",
				"-groups": "Combat,Style",
				"-description": "You're able to manipulate foes that are caught off guard.",
				"Prerequisites": "Combat Expertise, Small size or smaller.",
				"Benefit": [ "You gain a +4 bonus on combat maneuver checks against enemies denied their Dexterity bonus to AC." ]
			},
			{
				"-id": "Kraken Style",
				"-title": "Kraken Style",
				"-groups": "Combat,Style",
				"-description": "You savagely squeeze and twist when grappling.",
				"Prerequisites": "Wis 13, Improved Grapple, Improved Unarmed Strike, base attack bonus +3 or monk level 3rd.",
				"Benefit": [ "When you succeed at a grapple check while using this style, your opponent takes an amount of bludgeoning damage equal to your Wisdom modifier in addition to any damage your grapple deals, such as when you choose to harm your opponent as part of a successful check to maintain a grapple. In addition, you gain a +2 bonus on combat maneuver checks to maintain a grapple." ]
			},
			{
				"-id": "Kraken Throttle",
				"-title": "Kraken Throttle",
				"-groups": "Combat",
				"-description": "You tighten your grip around your target's throat.",
				"Prerequisites": "Wis 13, Improved Grapple, Improved Unarmed Strike, Kraken Style, base attack bonus +5 or monk level 5th.",
				"Benefit": [
					"The damage that you deal with the Kraken Style feat on a successful grapple combat maneuver check increases to an amount equal to your Wisdom bonus + 2.",
					"While using this style, you can choke your opponent when you successfully maintain a grapple instead of choosing to damage, move, pin, or tie up your opponent. This suffocates your opponent. The grappled opponent can take a breath during any round in which you do not maintain the grapple."
				]
			},
			{
				"-id": "Kraken Wrack",
				"-title": "Kraken Wrack",
				"-groups": "Combat",
				"-description": "You squeeze your opponent tightly enough to crush armor or items between you.",
				"Prerequisites": "Wis 13, Improved Grapple, Improved Unarmed Strike, Kraken Style, base attack bonus +7 or monk level 7th.",
				"Benefit": [
					"The damage you deal with the Kraken Style feat on a successful grapple combat maneuver check increases to an amount equal to your Wisdom modifier + 4. While using this style, you can crush your opponent when you successfully maintain a grapple instead of choking, damaging, moving, pinning, or tying up your opponent.",
					"When you do, you deal an amount of damage equal to that of your unarmed strike or one of your natural attacks to your foe's armor or an item held in your foe's hand. This crushing damage bypasses half of the hardness of the armor or item."
				]
			},
			{
				"-id": "Kudzu Invasion",
				"-title": "Kudzu Invasion",
				"-groups": "Combat",
				"-description": "In addition to obscuring creatures' vision, your vines crush their bodies.",
				"Prerequisites": "Dex 13, Greater Grapple, Improved Grapple, Improved Unarmed Strike, Kudzu Grappler, base attack bonus +6 or monk level 6th, vine leshy.",
				"Benefit": [ "When you blind a creature using your Kudzu Grappler feat, you can also deal your unarmed strike damage to it." ]
			},
			{
				"-id": "Kudzu Takeover",
				"-title": "Kudzu Takeover",
				"-groups": "Combat",
				"-description": "Your magical nature infuses your vines, further obscuring grappled foes' vision—even for opponents with enhanced senses.",
				"Prerequisites": "Dex 13, base attack bonus +6 or monk level 6th, Greater Grapple, Improved Grapple, Improved Unarmed Strike, Kudzu Grappler, Kudzu Invasion, vine leshy.",
				"Benefit": [ "Opponents blinded by your Kudzu Grappler feat increase their miss chance against creatures they attack by 20%. If the opponent has means of ignoring blindness, such as blindsight, they instead treat other creatures as if these creatures had normal concealment (20% miss chance)." ],
				"Normal": [ "All opponents are considered to have total concealment (50% miss chance) against blinded creatures." ]
			},
			{
				"-id": "Kyton Cut",
				"-title": "Kyton Cut",
				"-groups": "Combat",
				"-description": "You lash yourself and share the pain with your opponent.",
				"Prerequisites": "Wis 17, Exotic Weapon Proficiency (spiked chain), Kyton Shield, Kyton Style, base attack bonus +8 or monk level 6th, Knowledge (planes) 3 ranks, ki pool class feature.",
				"Benefit": [ "When using Kyton Style, your spiked chain attacks can be brutal, both to yourself and your foe. Before attempting an attack roll with a spiked chain attack, you can choose to make a Kyton Cut. Before making the attack, you take 1d6 points of nonlethal damage. This damage cannot be avoided or reduced in any way. If you are immune to nonlethal damage, you take normal damage instead. If the attack hits, its target takes an additional 1d6 points of nonlethal damage and a -4 penalty on concentration checks for 1 round. The penalty is a pain effect." ]
			},
			{
				"-id": "Kyton Shield",
				"-title": "Kyton Shield",
				"-groups": "Combat",
				"-description": "Whether in your hand or draped around your body, the spiked chain serves as both weapon and shield.",
				"Prerequisites": "Wis 15, Exotic Weapon Proficiency (spiked chain), Kyton Style, base attack bonus +5, Knowledge (planes) 3 ranks, ki pool class feature.",
				"Benefit": [ "When using Kyton Style, you gain a +1 shield bonus to your Armor Class as long as you are wielding a spiked chain. If the spiked chain is magical, add 1/2 its enhancement bonus to this shield bonus. If the spiked chain has the vicious ability, instead add its full enhancement bonus to the shield bonus." ]
			},
			{
				"-id": "Kyton Style",
				"-title": "Kyton Style",
				"-groups": "Combat,Style",
				"-description": "Your fighting style emulates the disciplined nature of the kytons, with passion and pain held tightly in chains.",
				"Prerequisites": "Wis 13, Exotic Weapon Proficiency (spiked chain), Knowledge (planes) 3 ranks, ki pool class feature.",
				"Benefit": [ "When using this style, you treat spiked chains as if they had the monk special weapon feature. Additionally, if you have Stunning Fist, you can spend 1 point from your ki pool to make a Stunning Fist attack with your spiked chain instead of an unarmed strike. This still costs a use of Stunning Fist as normal." ]
			},
			{
				"-id": "Landing Roll",
				"-title": "Landing Roll",
				"-groups": "Combat",
				"Prerequisites": "Dex 13, Dodge, Mobility.",
				"Benefit": [ "If you are tripped, you can spend an immediate action to move 5 feet without provoking an attack of opportunity. This does not count as taking a 5-foot step. You fall prone after this movement." ]
			},
			{
				"-id": "Lantern Glare",
				"-title": "Lantern Glare",
				"-groups": "Combat",
				"-description": "Like an archon's aura, the light of your thrown weapons can shake even the fiercest of foes.",
				"Prerequisites": "Light, Lantern Style, Point-Blank Shot, Precise Shot, good or lawful alignment, caster level 11th or monk level 11th.",
				"Benefit": [ "Creatures you hit with a thrown weapon as well as creatures within 20 feet of your target must succeed at a Will save (DC = 10 + half your character level + your Charisma modifier) or become shaken until they damage you or 24 hours have passed. A creature that succeeds at its saving throw or that damages you after becoming shaken becomes immune to this effect for 24 hours." ]
			},
			{
				"-id": "Large Target",
				"-title": "Large Target",
				"-groups": "Combat",
				"-description": "The larger a creature is, the easier you find it to strike a vulnerable spot when attacking with a sling.",
				"Prerequisites": "Proficient with sling.",
				"Benefit": [ "Your attacks with all kinds of slings add a +1 bonus on damage rolls for every size category your opponent is larger than you. For example, if you are Small and your opponent Large (a difference of two sizes), you gain a +2 damage bonus. This is considered precision damage and is not multiplied on a critical hit." ]
			},
			{
				"-id": "Lashing Tail",
				"-title": "Lashing Tail",
				"-groups": "Combat",
				"-description": "Your tail is either thick and heavy enough to serve as a weapon, or else is adorned with barbs or quills that weaponize its lashing length.",
				"Prerequisites": "Grasping Tail, you must have a tail.",
				"Benefit": [ "You gain a tail slap natural attack that deals damage as appropriate for your size (1d6 points for a Medium creature, or 1d4 points for a small creature). When you first gain this feat, choose bludgeoning, piercing, or slashing; this is the type of damage your tail inflicts, and it cannot be later changed. Due to the inherent awkwardness of attacking with your tail, you can't make a tail slap attack and other natural weapon attacks as part of the same full attack. Treat your tail slap attack as a secondary attack if you also attack with a manufactured weapon as part of a full-attack action." ]
			},
			{
				"-id": "Latching Horror",
				"-title": "Latching Horror",
				"-groups": "Combat, Monster",
				"-description": "You induce fear and loathing when you latch onto another living creature.",
				"Prerequisites": "Attach universal monster ability.",
				"Benefit": [ "When you use your attach ability, your opponent must succeed at a Will save (DC = 10 + 1/2 your Hit Dice + your Constitution modifier) to avoid becoming shaken while you remain attached. This is a mind-affecting fear effect." ]
			},
			{
				"-id": "Latent Curse",
				"-title": "Latent Curse",
				"-groups": "Metamagic",
				"-description": "You can imbue curse magic into objects.",
				"Benefit": [
					"You can alter a spell with the curse descriptor to target an object rather than a person. Your spell immediately targets the next creature to pick up, handle, or interact with the object as if that creature were the spell's original target.",
					"The curse affects only the first creature to use the item, even if the curse originally affected multiple targets. An object invested with a latent curse detects as magical, with an aura appropriate for the spell's original level and school.As with all cursed items, someone studying the object's magic aura recognizes that it is cursed only if her Spellcraft check exceeds the target DC by 10 or more. So long as a latent curse remains active in an item, you cannot recover the spell slot used to cast that spell. A latent curse remains active in an item for 1 day per caster level, but you can dispel the latent curse whenever you recover your spells as a free action, rending the cursed object harmless and regaining the expended spell slot.A latent curse spell uses up a spell slot 1 level higher than the spell's actual level."
				]
			},
			{
				"-id": "Lay of the Land",
				"-title": "Lay of the Land",
				"-description": "Your affinity to nature grants you greater insight into specific biomes.",
				"Prerequisites": "Animal focus class feature, wild empathy class feature.",
				"Benefit": [ "You gain a favored terrain as the ranger ability of the same name, though the favored terrain bonuses you receive do not increase with your level. This ability counts as the favored terrain class feature for the purposes of prerequisites and other effects." ],
				"Special": [ "You can select this feat up to four times. Each time you take it, you apply it to a different terrain. Unlike with the ranger's favored terrain class feature, the bonuses you gain for previously chosen terrains do not increase." ]
			},
			{
				"-id": "Lead by Example",
				"-title": "Lead by Example",
				"-groups": "Combat",
				"-description": "You have been placed in positions of importance since a young age, and others naturally follow your example.",
				"Prerequisites": "Cha 15, half-orc.",
				"Benefit": [ "Whenever you confirm a critical hit in combat, all allies within 30 feet gain a +2 morale bonus on attack rolls for the next round." ]
			},
			{
				"-id": "Lead from the Back",
				"-title": "Lead from the Back",
				"-groups": "Combat, Goblin",
				"-description": "You allies depend far too much on your leadership and encouraging words for you to actually put yourself in harms' way.",
				"Prerequisites": "Goblin, Intimidate 1 rank.",
				"Benefit": [ "During any round in which you gain the benefit of cover or concealment against at least one opponent, and you are not threatened by any opponent, you can bark orders and encouragement to your allies as a standard action. Doing so grants all allies within 30 feet a +1 bonus on all weapon damage rolls for 1 round." ]
			},
			{
				"-id": "Leadership",
				"-title": "Leadership",
				"-description": "You attract followers to your cause and a companion to join you on your adventures.",
				"Prerequisites": "Character level 7th.",
				"Benefit": [ "This feat enables you to attract a loyal cohort and a number of devoted subordinates who assist you. A cohort is generally an NPC with class levels, while followers are typically lower level NPCs. See Table: Leadership for what level of cohort and how many followers you can recruit.Leadership Modifiers: Several factors can affect your Leadership score, causing it to vary from the base score (character level + Cha modifier). Your reputation (from the point of view of the cohort or follower you are trying to attract) raises or lowers your Leadership score:Other modifiers may apply when you try to attract a cohort, as listed below.* Cumulative per cohort killed.Followers have different priorities from cohorts. When you try to attract a follower, use the following modifiers.Leadership Score: Your base Leadership score equals your level plus your Charisma modifier. In order to take into account negative Charisma modifiers, this table allows for very low Leadership scores, but you must still be 7th level or higher in order to gain the Leadership feat. Outside factors can affect your Leadership score, as detailed above.Cohort Level: You can attract a cohort of up to this level. Regardless of your Leadership score, you can only recruit a cohort who is two or more levels lower than yourself. The cohort should be equipped with gear appropriate for its level (see Creating NPCs). A cohort can be of any race or class. The cohort's alignment may not be opposed to your alignment on either the law/chaos or good/evil axis, and you take a –1 penalty to your Leadership score if you recruit a cohort of an alignment different from your own.Source: PPC:KotISSome characters garner the aid of particularly powerful, intelligent, or magical creatures to serve them. A character must have the Leadership feat in order to enlist such a creature.The following examples are some of the most common monstrous cohorts and where the stats for each can be found, as well as the creature's effective cohort level for the purpose of determining a character's requisite Leadership score and character level in order to enlist the aid of the creature.Many classes grant characters access to animal companions. When they reach 7th level such characters can also acquire a cohort through the Leadership feat. This may lead to a single character having both an animal companion and a cohort, which can significantly slow down gameplay and cause the character to be less important than the allies at her side. The Monstrous Companion feat allows a character to combine a monster cohort and an animal companion, gaining benefits over either without having to keep track of both." ],
				"Special": [
					"The feat Monstrous Companion counts as the Leadership feat for the purposes of prerequisites. A character cannot have both Leadership and Monstrous Companion.",
					"If a magical beast's effective cohort level is lower than what is allowed by your effective druid level, the cohort gains class levels equal to the difference. A cohort with 1 class level gains the link and share spells abilities of an animal companion. A cohort with 3 class levels gains the evasion animal companion ability. A cohort with 6 class levels gains the devotion animal companion ability. If the class feature you use as a prerequisite for this feat does not grant one of those abilities (such as a cavalier's mount, which does not gain share spells), your monstrous mount also does not gain the ability. The magical beast does not gain any abilities not listed here.* Must have been slain in battle and returned to life at least once in order to attract an einherji or valkyrie as a cohort.",
					"See Also: Monstrous Mounts, Monstrous Companion (feat)"
				]
			},
			{
				"-id": "Leaf Singer",
				"-title": "Leaf Singer",
				"-description": "Your songs recount the ways and mysteries of your people.",
				"Prerequisites": "Cha 13, bardic performance class feature, elf or half-elf.",
				"Benefit": [ "When you use bardic performance with audible components in a forest, the range or area of your chosen performance is doubled. In addition, the DC for saving throws against your bardic performance is increased by +2 for creatures of the fey type, regardless of where the performance occurs." ]
			},
			{
				"-id": "Leaf Singer",
				"-title": "Leaf Singer",
				"-description": "Your songs recount the ways and mysteries of your people.",
				"Prerequisites": "Cha 13, bardic performance class feature, elf or half-elf.",
				"Benefit": [ "When you use bardic performance with audible components in a forest, the range or area of your chosen performance is doubled. In addition, the DC for saving throws against your bardic performance is increased by +2 for creatures of the fey type, regardless of where the performance occurs." ]
			},
			{
				"-id": "Leapfrog",
				"-title": "Leapfrog",
				"-groups": "Combat, Performance",
				"-description": "You can use an opponent as a springboard.",
				"Prerequisites": "Acrobatics 3 ranks.",
				"Benefit": [ "When you spend a swift action to attempt a performance combat check after a successful charge attack or combat maneuver, you gain a +2 bonus on your performance combat check and gain a +4 bonus on your next Acrobatics, Climb, Fly, Ride, or Swim check attempted before the end of your next turn." ]
			},
			{
				"-id": "Leaping Evasion",
				"-title": "Leaping Evasion",
				"-groups": "Combat",
				"-description": "You jump out of the way of dangerous effects.",
				"Prerequisites": "Lightning Reflexes, evasion class feature.",
				"Benefit": [
					"When you succeed at a Reflex save against a spell or effect that affects an area, as an immediate action you can attempt an Acrobatics check to jump out of the effect's area.",
					"You must move to the nearest space you can see outside of the affected area. The DC for this Acrobatics check is equal to the number of feet you must move to escape the area, and you can't travel farther than your normal movement. If you use this feat, you are staggered on your next turn. This movement doesn't provoke attacks of opportunity from creatures in the area of the effect you are escaping."
				]
			},
			{
				"-id": "Leaping Shot Deed",
				"-title": "Leaping Shot Deed",
				"-groups": "Grit",
				"-description": "...",
				"Prerequisites": "Dex 13, grit class feature or Amateur Gunslinger feat, Dodge, Mobility, base attack bonus +4.",
				"Benefit": [ "You gain a +2 bonus on Acrobatics checks made to jump. As a full-round action, you can move up to your speed and make firearm attacks at your highest base attack bonus with each loaded firearm you are wielding. You can make these attacks at any point during your movement, and if you are wielding two firearms, you can make the attacks at different points during the movement. At the end of this movement, you fall prone. This deed costs 1 grit point to perform." ]
			},
			{
				"-id": "Learn Ranger Trap",
				"-title": "Learn Ranger Trap",
				"-description": "You learn how to create one kind of ranger trap.",
				"Prerequisites": "Survival 5 ranks.",
				"Benefit": [
					"Select one ranger trap. You may use this trap a number of times per day equal to your Wisdom bonus (minimum 1). The DC for your trap is equal to 10 + 1/2 your character's level + your Wisdom bonus, and it lasts 1 day per two character levels.",
					"If you are not a ranger, you can only set extraordinary traps with this feat; like all extraordinary ranger traps, this decreases the trap DC by 2."
				],
				"Special": [ "A ranger may use ranger traps a number of times per day equal to 1/2 his ranger level plus his Wisdom bonus." ]
			},
			{
				"-id": "Ledge Walker",
				"-title": "Ledge Walker",
				"-groups": "Dwarf",
				"Prerequisites": "Dex 13, dwarf, mountaineer or stability racial trait.",
				"Benefit": [ "You can move at full speed while using Acrobatics to balance on narrow surfaces, and you gain a +4 bonus on Climb checks to catch yourself or another creature while falling. You also gain a +4 bonus on saving throws against effects that would cause you to fall prone (such as earthquakes). This bonus does not apply to your CMD against bull rush or trip attacks." ]
			},
			{
				"-id": "Legendary Influence",
				"-title": "Legendary Influence",
				"-description": "Each legend grants you more of its power in return for greater influence.",
				"Prerequisites": "Lesser spirit power class feature.",
				"Benefit": [ "Immediately select one feat (other than an item creation feat) for each spirit you can channel. Whenever you perform a seance to channel a spirit, you can allow the spirit to gain 1 point of influence over you to gain access to that spirit's Legendary Influence feat for as long as you channel that spirit. You can use this bonus feat as a prerequisite for any feats granted by a spirit power (such as the champion's legendary champion ability), but not for any other feats." ]
			},
			{
				"-id": "Legendary Teamwork",
				"-title": "Legendary Teamwork",
				"-groups": "Mythic",
				"-description": "You and your allies fight with great coordination.",
				"Prerequisites": "Any two teamwork feats.",
				"Benefit": [ "Any fixed numeric bonuses you gain from teamwork feats are increased by 1. This doesn't apply to variable numeric bonuses or to effects that are not numeric bonuses, such as additional attacks of opportunity, movement, or other extra actions." ]
			},
			{
				"-id": "Let Them Come",
				"-title": "Let Them Come",
				"-groups": "Combat,Faction",
				"-description": "You have trained to fight onrushing enemy hordes. With a carefully timed strike you ensure that their reckless charge will be their undoing. ",
				"Prerequisites": "Dwarf, Ninth Battalion TPA 25. ",
				"Benefit": [ "You treat all one- or two-handed melee weapons as if they had the brace special feature. " ],
				"Normal": [ "Only weapons with the brace special feature can be readied against charges." ]
			},
			{
				"-id": "Letter Fury",
				"-title": "Letter Fury",
				"-groups": "Goblin",
				"-description": "You go wild when someone tries to steal the words from your head.",
				"Prerequisites": "Goblin, rage class feature.",
				"Benefit": [ "If someone reads or writes in your presence (including casting spells like glyph of warding or symbol) you can, as an immediate action, choose to activate your rage class ability for 1 round. This round of rage does not count toward the total number of rounds which you can rage each day, but if you wish to continue your rage beyond that single round you must expend rounds from your daily rage allotment as normal. Once you use this feat you must wait at least 1 minute after you cease raging before you can use it again." ]
			},
			{
				"-id": "Lie Low",
				"-title": "Lie Low",
				"-description": "You're even harder to see when prone than most are.",
				"Benefit": [
					"If you have been prone since the end of your last turn, the penalty on Perception checks for others to notice you increases by 1 for every 20 feet between you and the observer, to a maximum increase of 5 at 100 feet.",
					"This stacks with the normal modifier for distance."
				]
			},
			{
				"-id": "Life Lure",
				"-title": "Life Lure",
				"-description": "Your channeled positive energy is irresistibly sweet to nearby undead.",
				"Prerequisites": "Channel positive energy class feature.",
				"Benefit": [ "As a standard action, you can channel positive energy to fascinate all undead within 30 feet for a number of rounds equal to your Charisma modifier (minimum of 1). Undead that succeed at a Will save (DC 10 + 1/2 your cleric level + your Charisma modifier) are unaffected. Channeling energy for this purpose does not heal or harm creatures." ]
			},
			{
				"-id": "Life's Blood",
				"-title": "Life's Blood",
				"-groups": "Samsaran",
				"-description": "...",
				"Prerequisites": "Samsaran.",
				"Benefit": [ "At will as a full-round action, you may perform a special bloodletting ritual through which you sacrifice some of your own vitality to heal another creature. When using this feat, you take 1d4 points of damage and apply your blood to the wounds of a living creature, healing it for a number of hit points equal to the amount of damage you took from the ritual. This is a supernatural ability. Only you can perform this bloodletting. A creature cannot be healed by this ability more than once per day." ]
			},
			{
				"-id": "Life-Dominant Soul",
				"-title": "Life-Dominant Soul",
				"-description": "You gain unusual resiliency from your mortal heritage.",
				"Prerequisites": "Dhampir",
				"Benefit": [ "You are healed by channeled positive energy used to heal living creatures and channeled negative energy used to heal undead, but both only heal half the normal amount. You still take damage from positive energy used to harm undead, such as that from channeled energy and lay on hands." ]
			},
			{
				"-id": "Lifeless Gaze",
				"-title": "Lifeless Gaze",
				"-description": "Your cold visage and eyes devoid of sentiment cause fear in those making contact with your gaze.",
				"Prerequisites": "Iron Will, Bluff 5 ranks.",
				"Benefit": [ "Your haunting gaze grants horrifying insights to the darker places of your inner psyche. You gain a +2 insight bonus on Will saving throws against emotion effects and a +2 insight bonus on Bluff checks. Additionally, if a humanoid creature attempts to read your mind using an ability like detect thoughts, it is shaken for 2d4 rounds regardless of whether the mind-reading attempt succeeds. If a humanoid fails a Diplomacy check against you by 5 or more, it becomes shaken for 2d4 rounds by your emotionless gaze." ]
			},
			{
				"-id": "Light Gravity Acclimation",
				"-title": "Light Gravity Acclimation",
				"-description": "A realm's light gravity lets you reach your full potential.",
				"Prerequisites": "Dex 13, Acrobatics 3 ranks.",
				"Benefit": [ "Your land speed increases by 10 feet while on a plane with light gravity, and other creatures do not gain a circumstance bonus on attack rolls against you from light gravity. At the GM's discretion, these effects might apply to certain environments on the Material Plane, such as low-gravity planets. In addition, you gain a +2 bonus on Acrobatics checks; if you have 10 or more ranks in Acrobatics, this bonus increases to +4. This bonus does not stack with that provided by the Acrobatic feat." ]
			},
			{
				"-id": "Light Step",
				"-title": "Light Step",
				"-description": "You pick your way nimbly through even the most dangerous and uneven terrain.",
				"Prerequisites": "Acrobatic Steps, Nimble Moves, elf.",
				"Benefit": [ "You can ignore the effects of difficult terrain in natural environments, as if it were normal terrain." ]
			},
			{
				"-id": "Lightning Draw",
				"-title": "Lightning Draw",
				"-groups": "Combat, Panache",
				"-description": "You can draw your weapon with startling speed.",
				"Prerequisites": "Quick Draw, swashbuckler initiative deed, swashbuckler level 7th.",
				"Benefit": [
					"You can spend 1 panache point to draw one or more light or one-handed piercing weapons, whether hidden or not, when you roll initiative, even at the start of a surprise round in which you can't act. Drawing these weapons does not take an action.",
					"If you have the instant unveil deed, it doesn't cost any panache to use the ability described in the previous paragraph as long as you have at least 1 point of panache, and you can spend 1 panache point to draw a single light or one-handed piercing weapon, hidden or not, as an immediate action whenever a creature attacks you."
				]
			},
			{
				"-id": "Lightning Reflexes",
				"-title": "Lightning Reflexes",
				"-description": "You have faster reflexes than normal.",
				"Benefit": [ "You get a +2 bonus on all Reflex saving throws." ]
			},
			{
				"-id": "Lightning Stance",
				"-title": "Lightning Stance",
				"-groups": "Combat",
				"-description": "The speed at which you move makes it nearly impossible for opponents to strike you.",
				"Prerequisites": "Dex 17, Dodge, Wind Stance, base attack bonus +11.",
				"Benefit": [ "If you take two actions to move or a withdraw action in a turn, you gain 50% concealment for 1 round." ]
			},
			{
				"-id": "Lingering Invisibility",
				"-title": "Lingering Invisibility",
				"-groups": "Duergar",
				"Prerequisites": "Duergar.",
				"Benefit": [ "When your invisibility ends, you gain concealment for 1 round per minute of duration the invisibility effect had remaining (minimum 1 round). This only occurs if the invisibility is from your racial spell-like ability or a spell you cast. Effects that negate invisibility negate this concealment." ]
			},
			{
				"-id": "Lingering Performance",
				"-title": "Lingering Performance",
				"-description": "The effects of your bardic performance carry on, even after you have stopped performing.",
				"Prerequisites": "Bardic performance class feature.",
				"Benefit": [ "The bonuses and penalties from your bardic performance continue for 2 rounds after you cease performing. Any other requirement, such as range or specific conditions, must still be met for the effect to continue. If you begin a new bardic performance during this time, the effects of the previous performance immediately cease." ]
			},
			{
				"-id": "Lingering Spell",
				"-title": "Lingering Spell",
				"-groups": "Metamagic",
				"-description": "Your spell clings to existence, slowly fading from the world.",
				"Benefit": [
					"You may cause an instantaneous spell that affects an area to persist until the beginning of your next turn. Those already in the area suffer no additional harm, but other creatures or objects entering the area are subject to its effects. A lingering spell with a visual manifestation obscures vision, providing concealment (20% miss chance) beyond 5 feet and total concealment (50% miss chance) beyond 20 feet.",
					"Level Increase: +1 (a lingering spell uses up a spell slot one level higher than the spell's actual level.)"
				]
			},
			{
				"-id": "Linnorm Hunter Coordination",
				"-title": "Linnorm Hunter Coordination",
				"-groups": "Combat,Teamwork",
				"-description": "You are adept at working with your animal companion to strike the same location and deal increased damage.",
				"Prerequisites": "Cha 13, Dex 13, Dodge, Linnorm Hunter Retreat, Linnorm Hunter Style, base attack bonus +6, must have or be an animal companion.",
				"Benefit": [ "When you and an ally with this feat are using Linnorm Hunter Style and threatening the same target, you can make a single melee attack at your highest base attack bonus against that target as a full-round action. If your attack is successful, you deal extra damage with this feat equal to the damage of one of your ally's natural attacks. This extra damage is not multiplied on a critical hit." ],
				"Special": [ "Animal companions with an Intelligence score of 1 or 2 can take this feat." ]
			},
			{
				"-id": "Linnorm Hunter Retreat",
				"-title": "Linnorm Hunter Retreat",
				"-groups": "Combat,Teamwork",
				"-description": "You and your animal companion have learned to cover each other in combat.",
				"Prerequisites": "Cha 13, Dex 13, Dodge, Linnorm Hunter Style, base attack bonus +4, must have or be an animal companion.",
				"Benefit": [ "When an ally with this feat uses Linnorm Hunter Style and hits a target with a melee attack, you can move 5 feet as an immediate action without provoking an attack of opportunity from that target." ],
				"Special": [ "Animal companions with an Intelligence score of 1 or 2 can take this feat." ]
			},
			{
				"-id": "Linnorm Hunter Style",
				"-title": "Linnorm Hunter Style",
				"-groups": "Combat,Style,Teamwork",
				"-description": "You and your animal companion work together to make coordinated strikes against your enemies.",
				"Prerequisites": "Cha 13, must have or be an animal companion.",
				"Benefit": [ "Once per round while using this style, when an ally with this feat hits a target that you both threaten using a melee attack, you gain a +2 bonus on attacks of opportunity made against that target for 1 round. Enemies that provoke attacks of opportunity from your ally also provoke attacks of opportunity from you so long as you threaten them (even if the situation or an ability would normally deny you the attack of opportunity)." ],
				"Special": [ "Animal companions with an Intelligence score of 1 or 2 can take this feat." ]
			},
			{
				"-id": "Linnorm Style",
				"-title": "Linnorm Style",
				"-groups": "Combat,Style",
				"-description": "Your open stance invites opponents to attack you, and like a linnorm's Death Curse, your retributive strikes punish those foolish enough to accept the invitation.",
				"Prerequisites": "Wis 13, Improved Unarmed Strike, base attack bonus +3 or monk level 3rd.",
				"Benefit": [ "While using this style, you take a -2 penalty to your AC against melee attacks. After a creature makes a melee attack against you, you can choose to add your Wisdom bonus to the damage from your unarmed strikes against that creature, rather than your Strength bonus. If you can normally add your Dexterity bonus to the attack's damage, you can instead replace it with your Wisdom bonus. This lasts until the beginning of the target creature's next turn." ]
			},
			{
				"-id": "Linnorm Vengeance",
				"-title": "Linnorm Vengeance",
				"-groups": "Combat",
				"-description": "Your rigorous training allows you to redirect some of the energy from blows you take, turning your enemies' strength against them. Even death can't stop you from having your revenge.",
				"Prerequisites": "Wis 13, Improved Unarmed Strike, Linnorm Style, base attack bonus +6 or monk level 6th.",
				"Benefit": [
					"While you're using the Linnorm Style feat and an enemy hits you with a melee attack, you gain a +2 bonus on unarmed strike attack rolls you make against that creature until the beginning of that creature's next turn.",
					"If a creature's melee attack would normally miss you, you can allow it to hit you to gain this bonus; the attack deals the minimum amount of damage (as though the attacker had rolled a natural 1 on each damage die).",
					"Furthermore, if a melee attack deals enough damage to knock you unconscious or kill you, you can make a single retaliatory unarmed strike attack against that opponent as a free action before you drop unconscious or die. If you do so, when you are restored to consciousness or to life, you are stunned for 1 round."
				]
			},
			{
				"-id": "Linnorm Wrath",
				"-title": "Linnorm Wrath",
				"-groups": "Combat",
				"-description": "With practiced ease, you answer a blow with a blow. Even when you are overwhelmed, your body deflects the force of the strike back to the attacker as a stunning wave of energy.",
				"Prerequisites": "Wis 13, Improved Unarmed Strike, Linnorm Style, Linnorm Vengeance, base attack bonus +9 or monk level 9th.",
				"Benefit": [ "When you use the Linnorm Vengeance feat to allow an enemy to hit you, you can make a retaliatory unarmed strike attack against that opponent as an immediate action. This acts as an attack of opportunity, and counts against the number of attacks of opportunity you can make each round. Additionally, once per day when a melee attack deals enough damage to knock you unconscious or kill you, the attacker must succeed at a Fortitude saving throw (DC = 10 + 1/2 your character level + your Wisdom modifier) or be stunned for 1 round. This save occurs after you make the retaliatory unarmed strike granted by the Linnorm Vengeance feat." ]
			},
			{
				"-id": "Lithe Attacker",
				"-title": "Lithe Attacker",
				"-groups": "Animal Companion Feat",
				"-description": "Your unmatched grace allows you to strike even from the tightest crevices.",
				"Prerequisites": "Narrow Frame, Escape Artist 5 ranks, animal or magical beast.",
				"Benefit": [ "You can attack from nooks and crannies, even while using Escape Artist to squeeze through or into a narrow space less than half as wide as your normal space, and you do not lose your Dexterity bonus to AC while using Escape Artist to squeeze through or into a narrow space. You still take a –4 penalty to AC while using Escape Artist in this way." ]
			},
			{
				"-id": "Live Off the Land",
				"-title": "Live Off the Land",
				"-description": "You can easily pluck what you need from nature's bounty as you travel.",
				"Prerequisites": "Favored terrain class feature.",
				"Benefit": [ "You (and any allies whom you assist with the Survival skill) can move at full speed while using Survival to gather food and water, and you gain a +4 bonus on Survival checks to do so. If you cast create food and drink, create water, or any similar spell that creates edible and potable provisions while you are in your favored terrain, your caster level increases by an amount equal to half your favored terrain bonus." ]
			},
			{
				"-id": "Living Fortress",
				"-title": "Living Fortress",
				"-groups": "Teamwork",
				"-description": "Stubborn, tenacious, and proud, you're all but immovable when you have kin to back you up.",
				"Prerequisites": "Dwarf, hardy racial trait.",
				"Benefit": [ "Whenever you fight defensively and you're adjacent to an ally who also has this feat, your racial bonus on saving throws against spells and spell-like abilities increases by 2." ]
			},
			{
				"-id": "Lob Shot",
				"-title": "Lob Shot",
				"-groups": "Combat",
				"-description": "You can make a high, arcing shot to strike your opponents from above.",
				"Prerequisites": "Far Shot, Point-Blank Shot.",
				"Benefit": [ "While making a ranged attack, you can ignore any cover bonuses to AC, including total cover, unless the target also has cover from above, such as a roof or forest canopy. When using this feat, treat your target as if it were one range increment farther away. You can't use this feat unless you have headroom equal to at least half the attack's range." ]
			},
			{
				"-id": "Logical Spell",
				"-title": "Logical Spell",
				"-groups": "Metamagic",
				"-description": "You can eschew emotional components by exercising logic.",
				"Benefit": [
					"A logical spell can be cast without emotion components. Spells that don't require emotion components are not affected.",
					"Level Increase: +1 (a logical spell uses up a spell slot 1 level higher than the spell's actual level."
				]
			},
			{
				"-id": "Long-Nose Form",
				"-title": "Long-Nose Form",
				"-groups": "Tengu",
				"Prerequisites": "Character level 3rd, tengu.",
				"Benefit": [ "Once per day, you can assume the form of a human whose nose is the length of your beak. This spell-like ability functions as alter self with a caster level equal to your level. While in this form you gain the scent ability and a +2 bonus to your Strength score. Because your long nose in this form clearly indicates you are not fully human, you do not gain the normal bonus to Disguise checks for using a polymorph effect (however, you could possibly explain the nose as an unfortunate curse or deformity, or hide it with an item such as a plague doctor's mask)." ]
			},
			{
				"-id": "Lookout",
				"-title": "Lookout",
				"-groups": "Combat,Teamwork",
				"-description": "Your allies help you avoid being surprised.",
				"Benefit": [ "Whenever you are adjacent to an ally who also has this feat, you may act in the surprise round as long as your ally would normally be able to act in the surprise round. If you would normally be denied the ability to act in the surprise round, your initiative is equal to your initiative roll or the roll of your ally –1, whichever is lower. If both you and your ally would be able to act in the surprise round without the aid of this feat, you may take both a standard and a move action (or a full-round action) during the surprise round." ]
			},
			{
				"-id": "Low Profile",
				"-title": "Low Profile",
				"-groups": "Combat",
				"-description": "Yours small stature helps you avoid ranged attacks.",
				"Prerequisites": "Dex 13, Small size or smaller.",
				"Benefit": [ "You gain a +1 dodge bonus to AC against ranged attacks. In addition, you do not provide soft cover to creatures when ranged attacks pass through your square." ]
			},
			{
				"-id": "Loyal To The Death",
				"-title": "Loyal To The Death",
				"-groups": "Teamwork",
				"-description": "You're so loyal to your family or friends that you're willing to suffer for them.",
				"Prerequisites": "Human.",
				"Benefit": [ "Whenever an opponent makes a melee or ranged attack against one of your allies who is adjacent to you and who also has this feat, you can spend an immediate action to shield the ally with your own body. You become the target of the attack, and the opponent gains a +4 bonus on her attack roll. For the purpose of determining distance, cover and concealment, you count as being in your ally's square when the attack is resolved. If the attack misses you due to concealment, blink, or a similar effect, it instead targets your ally as if you had not used this feat's ability." ]
			},
			{
				"-id": "Lucid Dreamer",
				"-title": "Lucid Dreamer",
				"-description": "The Dimension of Dreams is open to those willing to risk crossing the threshold.",
				"Prerequisites": "Cha 13, Knowledge (planes) 3 ranks.",
				"Benefit": [
					"You have greater control of the highly morphic qualities and wild magic of the Dimension of Dreams.",
					"You gain a +4 bonus on Charisma checks to determine your initial condition when your lucid body enters a dream and when attempting impossible feats in a dreamscape, and a +2 bonus on caster level checks to prevent a spell or spell-like ability from going awry because of wild magic. If someone casts a dream council spell that includes you as a target while you are dreaming, You can enter a shared dreamscape as described in that spell without spending a casting of dream or dream council.If your lucid body dies while in a dreamscape, you wake up fatigued."
				]
			},
			{
				"-id": "Luck of Heroes",
				"-title": "Luck of Heroes",
				"-groups": "Luck",
				"-description": "To others, it seems that you always have a bit of luck around you.",
				"Prerequisites": "Hero's Fortune.",
				"Benefit": [
					"Whenever you spend a hero point to reroll a die roll or to grant yourself a bonus before a die roll is made, there is a chance that the hero point is not spent. Whenever you spend a hero point, roll a d20. If the result is greater than 15, the hero point is not spent. You cannot use this Feat when you use the cheat death Hero Point option.",
					"Note: See Hero Points for full details."
				]
			},
			{
				"-id": "Lucky Halfling",
				"-title": "Lucky Halfling",
				"-description": "You bring luck to those with whom you travel.",
				"Prerequisites": "Halfling.",
				"Benefit": [ "Once per day, when one of your allies within 30 feet makes a saving throw, you may roll the same saving throw as if you were the one subject to the effect requiring it. You may use this ability after your ally has rolled, but before the GM declares if the roll was a success or failure. Your ally may choose to use your saving throw in place of his own." ]
			},
			{
				"-id": "Lucky Healer",
				"-title": "Lucky Healer",
				"-groups": "Halfling",
				"-description": "Your luck allows you to draw from magical healing far more efficiently than most.",
				"Prerequisites": "Adaptive luck racial trait, halfling.",
				"Benefit": [ "When a magical healing effect (such as a spell with “cure” in the title or channel energy) cures you, you can spend one use of your adaptable luck racial trait to reroll the amount of damage cured. You regain a number of hit points equal to the new roll or the original roll, whichever is greater. Other creatures healed by the effect do not gain this benefit." ]
			},
			{
				"-id": "Lucky Strike",
				"-title": "Lucky Strike",
				"-groups": "Combat, Halfling",
				"-description": "Your luck increases the potency of your weapon attacks.",
				"Prerequisites": "Base attack bonus +5, adaptive luck racial trait, halfling.",
				"Benefit": [ "Spend a use of your adaptive luck racial trait to reroll the damage from a single weapon attack. You deal damage equal to the new damage roll, or the original roll, whichever is greater." ]
			},
			{
				"-id": "Lucky Surge",
				"-title": "Lucky Surge",
				"-groups": "Mythic",
				"-description": "Your surges defy the odds.",
				"Prerequisites": "Potent Surge, 3rd mythic tier.",
				"Benefit": [ "Whenever you use your surge ability, you can roll your surge dice twice and take the higher result. If you can already roll your surge dice twice and take the higher result, you roll your surge dice three times and take the highest result." ]
			},
			{
				"-id": "Lunge",
				"-title": "Lunge",
				"-groups": "Combat",
				"-description": "You can strike foes that would normally be out of reach.",
				"Prerequisites": "Base attack bonus +6.",
				"Benefit": [ "You can increase the reach of your melee attacks by 5 feet until the end of your turn by taking a -2 penalty to your AC until your next turn. You must decide to use this ability before any attacks are made." ]
			},
			{
				"-id": "Lunging Spell Touch",
				"-title": "Lunging Spell Touch",
				"-description": "You can extend your reach to touch foes that would normally be too far away.",
				"Prerequisites": "Spellcraft 6 ranks.",
				"Benefit": [ "You can increase the reach of your spells' melee touch attacks by 5 feet until the end of your turn by taking a –2 penalty to your AC until your next turn. You must decide to use this ability before you attempt any attacks on your turn." ]
			}
		]
	}
}