[
	{
		"-id": "Mad Magic",
		"-title": "Mad Magic",
		"-groups": "Combat",
		"-description": "Magic is in your blood, allowing you to cast spells no matter how furious you become.",
		"Prerequisites": "Bloodrage class feature or perfect clarity rage power.",
		"Benefit": [
			"You can cast spells from any class that grants you spells while in a bloodrage, and you keep your rage benefits when using moment of clarity during a rage.",
			"If you have the greater bloodrage class feature, you also gain a +1 bonus to the save DCs of spells you cast while in a bloodrage."
		]
	},
	{
		"-id": "Maddening Obliteration",
		"-title": "Maddening Obliteration",
		"-groups": "Combat",
		"-description": "With a mighty killing blow, your unsettling punch vaporizes your foe.",
		"Prerequisites": "Wis 19, Cha 15, Improved Unarmed Strike, Maddening Strike, Maddening Style, Stunning Fist, Knowledge (arcana) 10 ranks, ki pool class feature, nongood alignment.",
		"Benefit": [ "As a swift action, you can spend 1 point from your ki pool to imbue the next unarmed strike you make on this turn with the maddening power of the spaces between the stars. If that attack doesn't hit, you take 2 points of Wisdom damage. If the attack hits, your opponent takes damage from your unarmed strike + 1d4+1 points of Wisdom damage. A successful Will save (DC = 10 + 1/2 your character level + your Wisdom modifier) reduces this to 2 points of Wisdom damage." ],
		"Special": [ "If you are using the sanity system, when you miss with a Maddening Strike, you take 4 points of sanity damage. If you hit, the target takes damage from the unarmed strike plus 8 points of sanity damage (or 4 points of sanity damage on a successful Will save)." ]
	},
	{
		"-id": "Maddening Strike",
		"-title": "Maddening Strike",
		"-groups": "Combat",
		"-description": "Your fists are weapons of mind-devouring madness.",
		"Prerequisites": "Wis 17, Cha 13, Improved Unarmed Strike, Maddening Style, Stunning Fist, Knowledge (arcana) 8 ranks, ki pool class feature, nongood alignment.",
		"Benefit": [ "You gain one additional use of Stunning Fist per day. When using this style, if you have at least 1 point in your ki pool, you increase the DCs of your confusion, madness, and insanity effects (including Maddening Strike) by 1. Additionally, when you successfully stun an opponent with your Stunning Fist attack, your target takes 1 point of Wisdom damage." ],
		"Special": [ "If you are using the sanity rules, when you successfully stun an opponent with your Stunning Fist attack, the target takes 1d4 points of sanity damage instead of 1 point of Wisdom damage." ]
	},
	{
		"-id": "Maddening Style",
		"-title": "Maddening Style",
		"-groups": "Combat,Style",
		"-description": "When you clobber an opponent with your fists, you inundate its mind with visions of madness and horror.",
		"Prerequisites": "Wis 15, Cha 11, Improved Unarmed Strike, Stunning Fist, Knowledge (arcana) 4 ranks, ki pool class feature, nongood alignment.",
		"Benefit": [ "When you damage a living creature with an unarmed strike while using Maddening Style, and you have at least 1 point in your ki pool, that creature suffers a -2 penalty on saving throws against any confusion, madness, and insanity effects (including your Maddening Strike) for 1 round. Additionally, if you reduce a creature to fewer than 0 hit points with a Stunning Fist attack, you can spend 2 points from your ki pool as a free action to obliterate your opponent, reducing their body to fine dust as per disintegrate. A living creature can attempt a Fortitude save (DC = 10 + 1/2 your character level + your Wisdom modifier) to negate this effect." ]
	},
	{
		"-id": "Mage of the Wild",
		"-title": "Mage of the Wild",
		"-groups": "Elf",
		"Prerequisites": "Attuned to the Wild, elf.",
		"Benefit": [ "When you are in a terrain type you have selected the Attuned to the Wild feat for, you gain a +2 bonus on caster level checks, concentration checks, and, Knowledge (arcana) and Spellcraft checks. If you are in an area that qualifies as more than one kind of terrain, these bonuses do not stack; you receive the bonus for only one of the terrain types." ]
	},
	{
		"-id": "Mage's Tattoo",
		"-title": "Mage's Tattoo",
		"-description": "...",
		"Prerequisites": "Spell Focus.",
		"Benefit": [ "Select a school of magic (other than divination) in which you have Spell Focus—you cast spells from this school at +1 caster level. Additionally, you gain a single spell-like ability usable up to three times per day. The spell-like ability gained are as follows:" ]
	},
	{
		"-id": "Magical Aptitude",
		"-title": "Magical Aptitude",
		"-description": "You are skilled at spellcasting and using magic items.",
		"Benefit": [ "You get a +2 bonus on all Spellcraft checks and Use Magic Device checks. If you have 10 or more ranks in one of these skills, the bonus increases to +4 for that skill." ]
	},
	{
		"-id": "Magical Heart",
		"-title": "Magical Heart",
		"-groups": "Combat",
		"-description": "Through intense focus, your magical strikes reinforce your ioun heart.",
		"Prerequisites": "Arcane Strike, Improved Unarmed Strike, wyrwood.",
		"Benefit": [ "While your unarmed strikes are imbued with power from the Arcane Strike feat, a successful hit with an unarmed strike grants you a number of temporary hit points equal to the bonus damage granted by Arcane Strike." ]
	},
	{
		"-id": "Magical Tail",
		"-title": "Magical Tail",
		"-groups": "Kitsune",
		"-description": "You grow an extra tail that represents your growing magical powers.",
		"Prerequisites": "Kitsune.",
		"Benefit": [
			"You gain a new spell-like ability, each usable twice per day, from the following list, in order:",
			"For example, the first time you select this feat, you gain disguise self 2/day; the second time you select this feat, you gain charm person 2/day. Your caster level for these spells is equal to your Hit Dice. The DCs for these abilities are Charisma-based."
		],
		"Special": [ "You may select this feat up to eight times. Each time you take it, you gain an additional ability as described above." ]
	},
	{
		"-id": "Major Spell Expertise",
		"-title": "Major Spell Expertise",
		"-description": "You can cast a single low-level spell as a spell-like ability.",
		"Prerequisites": "Minor Spell Expertise, ability to cast 9th-level spells.",
		"Benefit": [ "Choose one spell that you know of 5th level or lower. You may cast that spell twice per day as a spell-like ability. The caster level for this spell-like ability is equal to your caster level in the class from whose spell list the spell is taken. The spell-like ability's save DC is Charisma-based. If the spell has an expensive focus or material component, it may not be chosen for this feat. You cannot apply metamagic feats to this spell." ],
		"Special": [ "You can gain this feat multiple times. Its effects do not stack. Each time you take the feat, it applies to a new spell." ]
	},
	{
		"-id": "Makeshift Maneuvers",
		"-title": "Makeshift Maneuvers",
		"-groups": "Combat",
		"-description": "Your skill with improvised weapons allows you to use them to hamper your opponents.",
		"Prerequisites": "Catch Off-Guard or Throw Anything, base attack bonus +1.",
		"Benefit": [ "When you wield an improvised weapon, it gains the disarm and trip weapon properties." ]
	},
	{
		"-id": "Malicious Eye",
		"-title": "Malicious Eye",
		"-description": "You can combine the effects of your evil eye and your jinx.",
		"Prerequisites": "Evil eye witch hex, Halfling Jinx trait.",
		"Benefit": [ "When a creature fails its save against your evil eye hex, add the effect of your jinx to the effect of the hex. The save penalties from the hex and jinx stack. Using your jinx on another creature does not end the hex or the jinx effect on the hexed target." ]
	},
	{
		"-id": "Manifested Blood",
		"-title": "Manifested Blood",
		"-description": "You can use the power of your bloodline to surround yourself in its element.",
		"Prerequisites": "Cha 13; draconic or elemental bloodline.",
		"Benefit": [ "Once per day, you can surround yourself with the element associated with your bloodline. For a number of rounds equal to your Charisma modifier (minimum 1), you gain resistance 5 to that energy type, and all creatures that attempt a natural weapon attack or an unarmed strike against you take 2 points of damage of that same energy type. If you already have resistance to that energy type, the resistance increases by 5." ],
		"Special": [ "You can take this feat multiple times. Each time you do, you gain an additional daily use of this feat." ]
	},
	{
		"-id": "Manifold Stare",
		"-title": "Manifold Stare",
		"-groups": "Combat",
		"-description": "Your hypnotic gaze causes tremendous pain in its victims.",
		"Prerequisites": "Mesmerist level 3rd, painful stare class feature.",
		"Benefit": [ "You can trigger your painful stare one additional time per round." ],
		"Special": [ "This feat can be taken once by a 3rd-level mesmerist, and again when he reaches 9th and 15th levels. Its effects stack. A mesmerist can take this feat in place of a bold stare improvement." ]
	},
	{
		"-id": "Manipulative Agility",
		"-title": "Manipulative Agility",
		"-description": "You can use your agility to manipulate people as well as small objects.",
		"Prerequisites": "Bluff 1 rank, Sleight of Hand 1 rank.",
		"Benefit": [ "You can use Sleight of Hand in place of Bluff for checks to feint in combat, as well as for checks to pass secret messages without being noticed (by using gestures and body language). In both cases, the effects become visual and don't work if the target or recipient is blind or cannot see you. In the case of secret messages, the limitations of hand gestures and body language might impact what sorts of messages you can pass, at the GM's discretion." ]
	},
	{
		"-id": "Manipulative Presence",
		"-title": "Manipulative Presence",
		"-description": "When you discard your host, you alter or obliterate its memory of your handiwork.",
		"Prerequisites": "Int or Cha 19, Hidden Presence, ability to cast possession or greater possession.",
		"Benefit": [ "Upon completion of your possession, you can alter up to 5 minutes of your host's memories as you see fit. This functions as the modify memory spell. Your host's awareness of the possession doesn't impact this ability, and if your control of the host lasted less than 5 minutes, You can cause it to forget the possession entirely. The host can attempt a Will save with a DC equal to that of the original possession effect to resist this alteration." ]
	},
	{
		"-id": "Mantis Style",
		"-title": "Mantis Style",
		"-groups": "Combat,Style",
		"-description": "You have learned to target vital areas with crippling accuracy.",
		"Prerequisites": "Improved Unarmed Strike, Stunning Fist, Heal 3 ranks.",
		"Benefit": [ "You gain one additional Stunning Fist attempt per day. While using this style, you gain a +2 bonus to the DC of effects you deliver with your Stunning Fist." ]
	},
	{
		"-id": "Mantis Torment",
		"-title": "Mantis Torment",
		"-groups": "Combat",
		"Prerequisites": "Heal 9 ranks, Improved Unarmed Strike, Mantis Style, Mantis Wisdom, Stunning Fist.",
		"Benefit": [ "You gain one additional Stunning Fist attempt per day. While using Mantis Style, you make an unarmed attack that expends two daily attempts of your Stunning Fist. If you hit, your opponent must succeed at a saving throw against your Stunning Fist or become dazzled and staggered with crippling pain until the start of your next turn, and at that point the opponent becomes fatigued." ]
	},
	{
		"-id": "Mantis Wisdom",
		"-title": "Mantis Wisdom",
		"-groups": "Combat",
		"Prerequisites": "Improved Unarmed Strike, Mantis Style, Stunning Fist, Heal 6 ranks.",
		"Benefit": [
			"Treat half your levels in classes other than monk as monk levels for determining effects you can apply to a target of your Stunning Fist per the Stunning Fist monk class feature. You can also use a standard action and a successful melee touch attack to remove any Stunning Fist effect you have applied to a target.",
			"While using Mantis Style, you gain a +2 bonus on unarmed attack rolls with which you are using Stunning Fist attempts."
		]
	},
	{
		"-id": "Manyshot",
		"-title": "Manyshot",
		"-groups": "Combat",
		"-description": "You can fire multiple arrows at a single target.",
		"Prerequisites": "Dex 17, Point-Blank Shot, Rapid Shot, base attack bonus +6.",
		"Benefit": [
			"When making a full-attack action with a bow, your first attack fires two arrows. If the attack hits, both arrows hit. Apply precision-based damage (such as sneak attack) and critical hit damage only once for this attack. Damage bonuses from using a composite bow with a high Strength bonus apply to each arrow, as do other damage bonuses, such as a ranger's favored enemy bonus. Damage reduction and resistances apply separately to each arrow.",
			"Editor's Note",
			"How does Manyshot work with Deflect Arrows?",
			"'Deflect Arrows works only once per round. Manyshot allows an archer to shoot multiple arrows, but you only make one attack roll, so Deflect Arrows would block all arrows grouped in anyone particular Manyshot attack.'"
		]
	},
	{
		"-id": "Marid Coldsnap",
		"-title": "Marid Coldsnap",
		"-groups": "Combat",
		"Prerequisites": "Con 15, Wis 17, Elemental Fist, Marid Spirit, Marid Style, Improved Unarmed Strike, base attack bonus +13 or monk level 11th.",
		"Benefit": [ "While using Marid Style, as a standard action, you can spend two Elemental Fist attempts to unleash a 30-foot line of frigid water. Creatures caught in the line take your unarmed strike damage plus the cold damage from your Elemental Fist attack and are entangled in ice as per the Marid Spirit feat. A successful Reflex save (DC 10 + 1/2 your character level + your Wis modifier) reduces the damage by half and prevents a target from becoming entangled." ]
	},
	{
		"-id": "Marid Spirit",
		"-title": "Marid Spirit",
		"-groups": "Combat",
		"Prerequisites": "Con 15, Wis 15, Elemental Fist, Marid Style, Improved Unarmed Strike, base attack bonus +11 or monk level 9th.",
		"Benefit": [ "You gain one additional Elemental Fist attempt per day. While using Marid Style, you gain cold resistance equal to your base attack bonus, or monk level plus base attack bonus gained from levels in classes other than monk, whichever is higher. While denied your Dexterity bonus to AC you are also denied this resistance. Creatures that take cold damage from your Elemental Fist attack must succeed at a Fortitude save (DC 10 + 1/2 your character level + your Wis modifier) or become entangled in ice for 1d4 rounds. The ice has hit points equal to three times your base attack bonus or monk level, whichever is higher, and a break DC of 15 + your base attack bonus or monk level, whichever is higher. Destroying or breaking the ice ends the entangled condition." ]
	},
	{
		"-id": "Marid Style",
		"-title": "Marid Style",
		"-groups": "Combat,Style",
		"-description": "You conjure tendrils of icy water to strike your enemies from a distance.",
		"Prerequisites": "Con 13, Wis 15, Elemental Fist, Improved Unarmed Strike, base attack bonus +9 or monk level 5th.",
		"Benefit": [ "You gain one additional Elemental Fist attempt per day. While using this style and Elemental Fist to deal cold damage, you gain a bonus on cold damage rolls equal to your Wisdom modifier, and your reach with your unarmed strike increases by 5 feet." ]
	},
	{
		"-id": "Marked for Glory",
		"-title": "Marked for Glory",
		"-description": "You're destined for glory beyond the ken of ordinary adventurers and mere mortals.",
		"Prerequisites": "Great Fortitude, Iron Will, or Lightning Reflexes.",
		"Benefit": [ "You can use the surge ability once per day (adding 1d6). If you are or become mythic, you can use your surge one additional time per day." ]
	},
	{
		"-id": "Martial Dominance",
		"-title": "Martial Dominance",
		"-groups": "Combat",
		"-description": "Your skill at arms intimidates your foes.",
		"Prerequisites": "Base attack bonus +5, Intimidate 1 rank.",
		"Benefit": [ "You can use your base attack bonus in place of your ranks in Intimidate to determine your Intimidate skill bonus. When you confirm a critical hit against a creature, you can attempt an Intimidate check to demoralize that creature as an immediate action." ]
	},
	{
		"-id": "Martial Focus",
		"-title": "Martial Focus",
		"-groups": "Combat",
		"-description": "You have honed your skills with a group of related weapons.",
		"Prerequisites": "Base attack bonus +5.",
		"Benefit": [ "Choose one fighter weapon group. While wielding a weapon from this group with which you are proficient, you gain a +1 bonus on damage rolls." ],
		"Special": [ "The Martial Focus feat counts as the weapon training class feature with the chosen fighter weapon group for the purpose of weapon mastery feat prerequisites and what weapons you can use with weapon mastery feats." ]
	},
	{
		"-id": "Martial Mastery",
		"-title": "Martial Mastery",
		"-groups": "Combat,Human",
		"-description": "You further broaden your study of weapons to encompass multiple similar weapons.",
		"Prerequisites": "Martial Versatility, fighter level 16th, human.",
		"Benefit": [ "Each combat feat you have that applies to a specific weapon (e.g., Weapon Focus) can be used with all weapons in the same weapon group." ]
	},
	{
		"-id": "Martial Versatility",
		"-title": "Martial Versatility",
		"-groups": "Combat, Human",
		"-description": "You broaden your study of weapons to encompass multiple similar weapons.",
		"Prerequisites": "Fighter level 4th, human.",
		"Benefit": [ "Choose one combat feat you know that applies to a specific weapon (e.g., Weapon Focus). You can use that feat with any weapon within the same weapon group." ],
		"Special": [ "You may take this feat more than once. Each time it applies to a different feat." ]
	},
	{
		"-id": "Martial Weapon Proficiency",
		"-title": "Martial Weapon Proficiency",
		"-groups": "Combat",
		"-description": "Choose a type of martial weapon. You understand how to use that type of martial weapon in combat.",
		"Benefit": [ "You make attack rolls with the selected weapon normally (without the non-proficient penalty)." ],
		"Normal": [ "When using a weapon with which you are not proficient, you take a -4 penalty on attack rolls." ],
		"Special": [
			"Barbarians, fighters, paladins, and rangers are proficient with all martial weapons. They need not select this feat.",
			"You can gain Martial Weapon Proficiency multiple times. Each time you take the feat, it applies to a new type of weapon."
		]
	},
	{
		"-id": "Massed Charge",
		"-title": "Massed Charge",
		"-groups": "Combat, Local",
		"-description": "You are trained in the methods of heavy cavalry and can steer your mount with great accuracy, even in tight confines.",
		"Prerequisites": "Mounted Combat, Handle Animal 1 rank, Ride 6 ranks.",
		"Benefit": [ "When mounted on a horse, you and your mount suffer no penalties for squeezing when you share a 10-foot space with another mount and rider with this feat. In addition, you and your mount gain a +2 bonus on CMD versus bull rush, overrun, and trip attempts." ],
		"Normal": [ "Horses and other Large mounts occupy a 10 foot square area. For two horses to share that space requires them to squeeze, halving their movement rate and imposing a -4 penalty on attack rolls and AC." ]
	},
	{
		"-id": "Master Alchemist",
		"-title": "Master Alchemist",
		"-description": "Your mastery of alchemy is nearly supernatural.",
		"Prerequisites": "Craft (alchemy) 5 ranks.",
		"Benefit": [
			"You receive a +2 bonus on Craft (alchemy) checks, and you may create mundane alchemical items much more quickly than normal. When making poisons, you can create a number of doses equal to your Intelligence modifier (minimum 1) at one time. These additional doses do not increase the time required, but they do increase the raw material cost.",
			"In addition, whenever you make alchemical items or poisons using Craft (alchemy), use the item's gp value as its sp value when determining your progress (do not multiply the item's gp cost by 10 to determine its sp cost)."
		]
	},
	{
		"-id": "Master Combat Performer",
		"-title": "Master Combat Performer",
		"-groups": "Combat",
		"-description": "You are a master of the techniques and weapons of the arena and the stage.",
		"Prerequisites": "Performing Combatant or at least three performance feats, base attack bonus +6.",
		"Benefit": [ "You can make performance combat checks as a free action. You are proficient in all weapons with the performance special quality." ]
	},
	{
		"-id": "Master Craftsman",
		"-title": "Master Craftsman",
		"-description": "Your superior crafting skills allow you to create simple magic items.",
		"Prerequisites": "5 ranks in any Craft or Profession skill.",
		"Benefit": [ "Choose one Craft or Profession skill in which you possess at least 5 ranks. You receive a +2 bonus on your chosen Craft or Profession skill. Ranks in your chosen skill count as your caster level for the purposes of qualifying for the Craft Magic Arms and Armor and Craft Wondrous Item feats. You can create magic items using these feats, substituting your ranks in the chosen skill for your total caster level. You must use the chosen skill for the check to create the item. The DC to create the item still increases for any necessary spell requirements (see the magic item creation rules in Magic Items). You cannot use this feat to create any spell-trigger or spell-activation item." ],
		"Normal": [ "Only spellcasters can qualify for the Craft Magic Arms and Armor and Craft Wondrous Item feats." ]
	},
	{
		"-id": "Master Hammer Throw",
		"-title": "Master Hammer Throw",
		"-groups": "Combat",
		"-description": "Your ability to knock down foes with thrown weapons is second to none.",
		"Prerequisites": "Int 13, Combat Expertise, Hammer Throw, Improved Hammer Throw, Improved Trip, Point-Blank Shot, Precise Shot, base attack bonus +6, dwarf.",
		"Benefit": [ "You can immediately attempt a trip combat maneuver against a target that you successfully hit and damage with a thrown bludgeoning weapon with any attack, even as part of a full-attack action." ]
	},
	{
		"-id": "Master Siege Engineer",
		"-title": "Master Siege Engineer",
		"-groups": "Combat",
		"-description": "You are significantly faster at loading a siege engine, as well as a better shot.",
		"Prerequisites": "Siege Engineer, Knowledge (engineering) 10 ranks.",
		"Benefit": [ "If you are the crew lead on a siege engine, your crew can use move actions to load a siege engine. When you spend actions to aim a siege engine, you and your crew can use move actions instead of full-round actions to aim the siege engine." ],
		"Normal": [ "Full-round actions are required to load and aim siege engines." ]
	},
	{
		"-id": "Master Sniper",
		"-title": "Master Sniper",
		"-groups": "Combat",
		"-description": "Your sniping is quick enough that you can fire a small volley unnoticed.",
		"Prerequisites": "Expert Sniper, Rapid Shot, Stealth 6 ranks.",
		"Benefit": [ "While hiding, you can make two ranged attacks at your highest attack bonus as a full-round action and then immediately use Stealth again. You take the normal penalties on your Stealth check to remain hidden. Effects that modify sniping apply to this full-round action. These attack rolls take a -2 penalty." ],
		"Normal": [ "You can fire only once when sniping." ]
	},
	{
		"-id": "Master of Falconry",
		"-title": "Master of Falconry",
		"-description": "...",
		"Prerequisites": "Charisma 13, Animal Affinity, Animal companion class feature.",
		"Benefit": [ "You improve your affinity with birds of prey, such as eagles, falcons, hawks, and owls. You gain a +2 bonus on Handle Animal checks made to train or control birds of prey. In addition, if you have a bird of prey as an animal companion, your animal companion gains one of the following bonuses chosen at the time this animal companion is gained: a +1 dodge bonus to AC, a +1 morale bonus on all attack rolls, or a +2 morale bonus on all Will saves." ]
	},
	{
		"-id": "Master of Wonders",
		"-title": "Master of Wonders",
		"-description": "Having seen the wonders of the world, you know how to tweak more chaos out of a rod of wonder.",
		"Prerequisites": "Iron Will, member of a faction, gnome.",
		"Benefit": [ "When you activate a rod of wonder, roll d% to determine what effect the rod would create. If you desire to do so, you can roll d% again and use this second result. You can only use this ability once per round." ]
	},
	{
		"-id": "Master of Your Kind",
		"-title": "Master of Your Kind",
		"-groups": "Animal Companion Feat",
		"-description": "When you speak to other animals of your kind, you can influence them to act according to your wishes and those of your master.",
		"Prerequisites": "Familiar, speak with animals of its kind ability.",
		"Benefit": [ "Your master gains a +2 bonus on Handle Animal checks with animals of your kind. In addition, once per day you can use animal messenger, animal trance, or charm animal as a spell-like ability, using your master's caster level but your own Charisma modifier. These abilities affect only animals of your kind, and you gain only one use of this ability per day (not one of each ability); however, you can gain one additional use of any one of these three abilities by having your master sacrifice a prepared spell or spell slot of the same level or higher as a standard action." ]
	},
	{
		"-id": "Master of the Ledger",
		"-title": "Master of the Ledger",
		"-description": "Your long experience balancing books has given you insight into the world of business.",
		"Prerequisites": "Appraise 6 ranks, Profession (any one) 6 ranks",
		"Benefit": [
			"You get a +2 bonus on Appraise checks, a +2 bonus on any one Profession skill, and when dealing with anyone of your profession, you get a +4 bonus on Sense Motive checks when using the hunch task (see the Sense Motive skill). Your ability to accurately and carefully invest money gives you insight into the movements of coin though the marketplace. If you have access to a marketplace in a settlement of village size or larger, you may invest up to 100 gp in that market; the exact nature of your investments isn't important but is usually divided among several businesses. Once invested, you do not have access to this money for at least 1 month.",
			"As often as once per month you can visit the marketplace to see if your investments were successful. Flip a coin. If heads, that marketplace earns you 25% of your investment there; if tails, your investments made no significant profit for that period. Your skill with business means you never actually lose money from these investments unless disaster strikes the settlement (such as a plague or dragon attack), in which case your investment is lost. If more than a month passes between your visits to the marketplace, you only make one check to see if you make a 25% profit. If you send an agent to collect profits on your behalf, you keep half the profits and the agent keeps half. You may close out your investments during any visit, which ends your relationship with that market and returns you the full amount of your investment.",
			"You gain a +1 bonus on all Diplomacy, and Intimidate checks when dealing with someone associated with your invested marketplace (shopkeepers, local guards, and so on). Very large or trade oriented cities may have multiple marketplaces, allowing you to invest in each, though local laws (particularly relating to guilds) may restrict what you can do."
		]
	},
	{
		"-id": "Masterful Display",
		"-title": "Masterful Display",
		"-groups": "Combat, Performance",
		"-description": "You craft a special victory performance that causes the crowd to go wild.",
		"Prerequisites": "Dazzling Display, any two performance feats.",
		"Benefit": [ "Choose the effects of any two performance feats you have. When you make a performance combat check, you gain the benefits of those two feats, but you only gain a +2 bonus on the performance combat check." ]
	},
	{
		"-id": "Masterful Flourish",
		"-title": "Masterful Flourish",
		"-groups": "Combat, Performance",
		"-description": "Your training with gladiatorial weapons gives you the upper hand when using them in performance combat.",
		"Prerequisites": "Weapon training class feature",
		"Benefit": [ "When wielding a weapon with the performance weapon special quality that belongs to a category of weapons in which you have weapon training, you may add the bonus from your weapon training to any performance combat checks made as a result of using the weapon." ]
	},
	{
		"-id": "Maximize Spell",
		"-title": "Maximize Spell",
		"-groups": "Metamagic",
		"-description": "Your spells have the maximum possible effect.",
		"Benefit": [
			"All variable, numeric effects of a spell modified by this feat are maximized. Saving throws and opposed rolls are not affected, nor are spells without random variables.",
			"Level Increase: +3 (a maximized spell uses up a spell slot three levels higher than the spell's actual level.)",
			"An empowered, maximized spell gains the separate benefits of each feat: the maximum result plus half the normally rolled result."
		]
	},
	{
		"-id": "Maximize Surge",
		"-title": "Maximize Surge",
		"-groups": "Mythic",
		"-description": "In times of dire need, you can burn your mythic power to ensure success.",
		"Prerequisites": "6th mythic tier.",
		"Benefit": [ "Once per day when you surge, you can expend two uses of mythic power to treat your surge die as though it rolled the maximum result." ],
		"Special": [ "You can take this feat multiple times. Each time you do, you gain an extra use of this feat per day." ]
	},
	{
		"-id": "Maximized Spellstrike",
		"-title": "Maximized Spellstrike",
		"-description": "You deal brutal damage against opponents caught unawares.",
		"Prerequisites": "Maximized magic magus arcana, weapon expertise class feature or Quick Draw.",
		"Benefit": [ "When you make a melee attack and successfully use your spellstrike ability against an opponent denied his Dexterity bonus to AC, you can spend 3 points from your arcane pool to maximize the spell delivered through your spellstrike as if using the Maximize Spell metamagic feat." ]
	},
	{
		"-id": "Measured Response",
		"-title": "Measured Response",
		"-groups": "Combat",
		"-description": "You believe that a conservative but consistent response guarantees success.",
		"Prerequisites": "Base attack bonus +1, worshiper of the associated deity.",
		"Benefit": [
			"When you hit an opponent with a melee or ranged weapon attack, you may choose to deal average damage (rounded down), as if you had rolled exactly the average amount on the damage die or dice. You add your damage bonuses and penalties as normal.",
			"Combat Trick",
			"Source PPC:WMH",
			"Note If using the optional Stamina Pool rules, the following trick may be used with this feat.",
			"Combat Trick: You can spend 5 stamina points before making a melee or ranged attack with Measured Response to treat the attack roll's result as a 10."
		]
	},
	{
		"-id": "Medusa's Wrath",
		"-title": "Medusa's Wrath",
		"-groups": "Combat",
		"-description": "You can take advantage of your opponent's confusion, delivering multiple blows.",
		"Prerequisites": "Improved Unarmed Strike, Gorgon's Fist, Scorpion Style, base attack bonus +11.",
		"Benefit": [ "Whenever you use the full-attack action and make at least one unarmed strike, you can make two additional unarmed strikes at your highest base attack bonus. These bonus attacks must be made against a dazed, flat-footed, paralyzed, staggered, stunned, or unconscious foe." ]
	},
	{
		"-id": "Menacing Bane",
		"-title": "Menacing Bane",
		"-description": "You are deadly when you team up with allies against a single foe.",
		"Prerequisites": "Bane class feature.",
		"Benefit": [ "You can use your bane class feature to imbue a melee weapon with the menacing special weapon ability instead of bane. You can spend a swift action to switch between the two special weapon abilities. Doing so otherwise works according to your bane class feature." ],
		"Special": [ "If you have the Double Bane feat, you can imbue each weapon you wield with either bane or menacing. No single weapon can have both." ]
	},
	{
		"-id": "Mercenary Company Tattoos",
		"-title": "Mercenary Company Tattoos",
		"-description": "You have quite the impressive collection of tattoos that commemorate your connection to and achievements within a notable mercenary company.",
		"Benefit": [
			"You have an impressive collection of tattoos, which are visible unless you wear concealing clothing or succeed at a DC 10 Disguise check. You can take 10 on Intimidate checks against creatures able to see your tattoos, even when stress or distractions would normally prevent you from doing so.",
			"You add Knowledge (local) to the skills associated with the presence tactic for verbal duels, and the first time you win an exchange with that tactic you do not take a penalty on associated skill checks if you repeat the tactic in the same duel."
		]
	},
	{
		"-id": "Merciful Bane",
		"-title": "Merciful Bane",
		"-description": "You can use your bane ability to inflict nonlethal damage.",
		"Prerequisites": "Bane class feature.",
		"Benefit": [ "While a weapon you wield is under the effect of your bane class feature, you can spend a swift action to switch between dealing lethal or nonlethal damage with bane. While your bane effect allows you to deal nonlethal damage in this way, you take no penalty on your attack roll for using a lethal weapon to deal nonlethal damage." ],
		"Normal": [ "When using a lethal weapon to deal nonlethal damage, you take a –4 penalty on attack rolls." ]
	},
	{
		"-id": "Merciful Spell",
		"-title": "Merciful Spell",
		"-groups": "Metamagic",
		"-description": "Your damaging spells subdue rather than kill.",
		"Benefit": [
			"You can alter spells that inflict damage to inflict nonlethal damage instead. Spells that inflict damage of a particular type (such as fire) inflict nonlethal damage of that same type.",
			"Level Increase: None (a merciful spell does not use up a higher-level spell slot than the spell's actual level.)"
		]
	},
	{
		"-id": "Merciful Takedown",
		"-title": "Merciful Takedown",
		"-groups": "Combat",
		"-description": "You are adept at removing your defeated opponents from the fight while avoiding their deaths.",
		"Benefit": [ "When you perform a coup de grace and deal only nonlethal damage, instead of attempting a Fortitude save to avoid death, the target must instead attempt a Fortitude save to avoid falling unconscious for 1 hour. The DC of this save is the same as that of a lethal coup de grace." ]
	},
	{
		"-id": "Merciless Beating",
		"-title": "Merciless Beating",
		"-groups": "Combat",
		"-description": "When you have the numbers on your side, you can lend your strength to the group to give your shared enemy a savage pummeling.",
		"Prerequisites": "Int 13, Combat Expertise, Gang Up.",
		"Benefit": [ "Whenever you and two or more allies threaten an opponent, you can choose to forgo your flanking bonus to grant each of your allies a +1 flanking bonus on their attack rolls against the threatened creature. This bonus stacks with any flanking bonuses your allies might already have." ]
	},
	{
		"-id": "Merciless Butchery",
		"-title": "Merciless Butchery",
		"-groups": "Combat",
		"-description": "Your talent for slaughter lets you dispatch helpless opponents before they can recover.",
		"Prerequisites": "Dastardly Finish, sneak attack +5d6, studied target class feature.",
		"Benefit": [ "As a standard action that does not provoke attacks of opportunity, you can attempt a coup de grace against a cowering, helpless, or stunned opponent that you have designated as your studied target." ]
	},
	{
		"-id": "Merciless Magic",
		"-title": "Merciless Magic",
		"-groups": "Kobold",
		"-description": "Your spellcasting is strongest against those in peril.",
		"Prerequisites": "Ability to cast spells, kobold.",
		"Benefit": [ "The DC to resist your spells increases by 1 for targets that are already afflicted with any of the following conditions: blinded, dying, entangled, exhausted, frightened, helpless, nauseated, panicked, paralyzed, or stunned." ]
	},
	{
		"-id": "Merciless Precision",
		"-title": "Merciless Precision",
		"-groups": "Kobold",
		"-description": "You delight and excel in bringing down hobbled targets.",
		"Prerequisites": "Sneak attack class feature, kobold.",
		"Benefit": [ "Your sneak attack damage increases by 1d6 against targets that are already afflicted with any of the following conditions: blinded, dying, entangled, exhausted, frightened, helpless, nauseated, panicked, paralyzed, or stunned." ]
	},
	{
		"-id": "Merciless Rush",
		"-title": "Merciless Rush",
		"-groups": "Combat",
		"-description": "Though hordes stand against you, they rarely stand long.",
		"Prerequisites": "Improved Bull Rush, worshiper of the associated deity.",
		"Benefit": [ "When you bull rush a creature and your check exceeds the target's CMD by 5 or more, you deal damage equal to your Strength modifier to that target." ]
	},
	{
		"-id": "Mesmerizing Feint",
		"-title": "Mesmerizing Feint",
		"-groups": "Combat",
		"-description": "You're adept at feinting against even the least imaginative of creatures.",
		"Prerequisites": "Hypnotic stare class feature.",
		"Benefit": [ "You take only a –2 penalty when feinting against a non-humanoid and a –4 penalty when feinting against creatures with animal intelligence, as long as the target is a subject of your hypnotic stare. If you have at least 10 ranks in Bluff, you instead take no penalty when feinting against non-humanoids and creatures of animal intelligence under your hypnotic stare." ],
		"Normal": [ "When feinting against a non-humanoid, you take a –4 penalty. Against a creature of animal intelligence, you take a –8 penalty." ]
	},
	{
		"-id": "Metallic Wings",
		"-title": "Metallic Wings",
		"-groups": "Aasimar",
		"-description": "Your wing feathers are made of gleaming metal",
		"Prerequisites": "Angelic Blood, Angelic Flesh, Angel Wings, Aasimar, character level 11th.",
		"Benefit": [ "You gain two wing attacks. These are secondary natural attacks that deal 1d4 points of slashing damage (or 1d3 if you are Small)." ]
	},
	{
		"-id": "Meteor Swing",
		"-title": "Meteor Swing",
		"-groups": "Combat",
		"-description": "The power of your blow leaves your enemies reeling.",
		"Prerequisites": "Weapon Focus with bludgeoning weapon, base attack bonus +6.",
		"Benefit": [
			"As a standard action, make a single attack with your chosen weapon. If the attack hits, the target must succeed at a Reflex save with a DC equal to 10 + your base attack bonus or lose its ability to make attacks of opportunity until the beginning of your next turn. When your base attack bonus reaches +11, you can instead cause the target to lose its Dexterity bonus to AC. When your base attack bonus reaches +16, you can instead cause the target to become flat footed.",
			"You can use this feat's benefits only once per minute."
		]
	},
	{
		"-id": "Mighty Bite",
		"-title": "Mighty Bite",
		"-groups": "Combat",
		"-description": "Your rending claws expose your opponent's vital organs to your teeth.",
		"Prerequisites": "Base attack bonus +6, bite attack, rend, troll.",
		"Benefit": [ "If you deal damage to a creature with your rend ability, the critical threat range of your bite attack becomes 18-20 until the start of your next turn. This increase does not stack with other effects that increase your bite's critical threat range (such as the keen weapon special ability or the Improved Critical feat)." ]
	},
	{
		"-id": "Mind Strike",
		"-title": "Mind Strike",
		"-groups": "Combat",
		"-description": "Your sneak attacks strike not only your target's body but also their willpower.",
		"Prerequisites": "Ranged legerdemain class feature.",
		"Benefit": [ "Whenever you deal sneak attack damage, you fluster your foe, causing your target to take a penalty on Will saves equal to the number of sneak attack dice you rolled on the attack for 1 round. This penalty does not stack with itself, but each time you deal sneak attack damage to an affected target, the duration is extended by 1 round." ]
	},
	{
		"-id": "Minor Spell Expertise",
		"-title": "Minor Spell Expertise",
		"-description": "You are able to cast a 1st-level spell as a spell-like ability.",
		"Prerequisites": "Ability to cast 4th-level spells.",
		"Benefit": [ "Choose one 1st-level spell that you know. You may cast that spell twice per day as a spell-like ability. The caster level for this spell-like ability is equal to your caster level in the class from whose spell list the spell is taken. The spell-like ability's save DC is Charisma-based. If the spell has an expensive focus or material component, it may not be chosen for this feat. You cannot apply metamagic feats to this spell." ],
		"Special": [ "You can gain this feat multiple times. Its effects do not stack. Each time you take the feat, it applies to a new spell." ]
	},
	{
		"-id": "Minotaur's Charge",
		"-title": "Minotaur's Charge",
		"-description": "Your charge sends foes reeling away, knocking them to the ground.",
		"Prerequisites": "Strength 13, Improved Bull Rush, powerful charge.",
		"Benefit": [ "When you hit an opponent with a charge attack, you might also initiate a bull rush as a free action. This does not require you to move into your opponent's square and does not provoke an attack of opportunity. If you successfully push your opponent 15 feet or more, he is also knocked prone." ]
	},
	{
		"-id": "Mirror Kin",
		"-title": "Mirror Kin",
		"-groups": "Teamwork",
		"-description": "Combining your cunning with illusion magic makes you and your allies nearly indistinguishable.",
		"Prerequisites": "Bluff 8 ranks, gnome, gnome magic racial trait.",
		"Benefit": [
			"Whenever you're adjacent to any gnome allies who also have this feat, your appearance and mannerisms change into an amalgam of the features of you and your allies, making you and your allies look exactly alike.",
			"Your shapes occasionally appear to blend into each other, making it impossible to distinguish you and granting you and any affected allies a 20% miss chance due to concealment. This is an illusion (figment) effect.",
			"Spells and effects that don't require an attack roll, such as area spells, affect you normally. An attacker must be able to see and reach both you and your ally to be fooled.",
			"If you're invisible or the attacker is blind, the feat has no effect. Because this feat relies on the fact that both you and your ally are blending together to create the visual illusion, it doesn't function with effects like the inquisitor's solo tactics class feature; both you and the ally must possess the feat. If you have more than one adjacent ally with this feat, this feat applies to all allies who qualify."
		]
	},
	{
		"-id": "Mirror Move",
		"-title": "Mirror Move",
		"-groups": "Combat",
		"-description": "By tracking an opponent's movements, you can attempt to duplicate his techniques.",
		"Prerequisites": "Int 13, Combat Expertise, base attack bonus +4.",
		"Benefit": [
			"If you are the only character threatening an opponent and that opponent uses a combat feat (including taking an action that benefits from a combat feat, or gaining any bonus to AC, attack rolls, damage rolls, or saving throws from a combat feat), you can take an immediate action to gain the benefit of that feat until the end of your next turn. You must meet all the feat's prerequisites. If a feat has a daily use limitation, as does Stunning Fist, any uses of that feat while you're using Mirror Move count toward that feat's daily limit for you.",
			"You can use Mirror Move once per day for every 4 levels you have attained."
		]
	},
	{
		"-id": "Mischievous Tail",
		"-title": "Mischievous Tail",
		"-description": "Your tail seems to have a mind of its own.",
		"Prerequisites": "Dex 15, Grasping Tail, you must have a tail.",
		"Benefit": [ "You can use your tail for all purposes as though it were a free hand, though you cannot effectively wield weapons or shields with it (you can still carry such objects with your tail, as long as such an object could also be comfortably carried in a hand normally). In addition, you gain a +2 bonus on disarm and steal combat maneuvers and Sleight of Hand checks performed using only your tail, and combat maneuvers performed this way do not provoke attacks of opportunity." ]
	},
	{
		"-id": "Misdirection Attack",
		"-title": "Misdirection Attack",
		"-groups": "Combat",
		"-description": "After misdirecting your opponent's weapon attack, you leave your opponent open to further violence.",
		"Prerequisites": "Int 13, Combat Expertise, Deceitful, Misdirection Redirection, Misdirection Tactics, Bluff 10 ranks.",
		"Benefit": [ "When you successfully use the Misdirection Tactics feat to negate a melee weapon attack, the opponent whose attack you negated provokes an attack of opportunity from you, even though you normally can't take attacks of opportunity while using the total defense action. This effect is in addition to the effect gained from Misdirection Redirection." ]
	},
	{
		"-id": "Misdirection Redirection",
		"-title": "Misdirection Redirection",
		"-groups": "Combat",
		"-description": "After misdirecting your opponent's weapon attack, you trick it into striking someone else.",
		"Prerequisites": "Int 13, Combat Expertise, Misdirection Tactics, Deceitful, Bluff 10 ranks.",
		"Benefit": [ "When you successfully use the Misdirection Tactics feat to negate a melee weapon attack, you redirect your foe's attack and trick your foe into striking another creature of your choice within the foe's melee reach. To resolve this attack, your foe must make a new attack roll against the new target." ]
	},
	{
		"-id": "Misdirection Tactics",
		"-title": "Misdirection Tactics",
		"-groups": "Combat",
		"-description": "You have learned to use deception and trickery to misdirect your opponent's weapon attack.",
		"Prerequisites": "Int 13, Combat Expertise, Deceitful, Bluff 4 ranks.",
		"Benefit": [ "While you are using the total defense action, if a melee attack would still hit your AC, you can attempt a Bluff check with a DC equal to the foe's attack roll as an immediate action. If you succeed at the check, you negate the attack (treat it as a miss). If the attack still hits, you cannot use this feat against the same opponent for 24 hours." ]
	},
	{
		"-id": "Missile Shield",
		"-title": "Missile Shield",
		"-groups": "Combat",
		"-description": "You are skilled at deflecting ranged attacks with your shield.",
		"Prerequisites": "Dex 13, Shield Focus.",
		"Benefit": [ "You must be using a light, heavy, or tower shield to use this feat. Once per round when you would normally be hit with an attack from a ranged weapon (not including spell effects, natural attacks, or massive ranged weapons), you may deflect it so that you take no damage, as if you had the Deflect Arrows feat. You must be aware of the attack and not flat-footed." ]
	},
	{
		"-id": "Mixed Scales",
		"-title": "Mixed Scales",
		"-groups": "Kobold",
		"-description": "You have two colors of scales, which mark you as special.",
		"Prerequisites": "Draconic Aspect or dragon-scaled racial trait, kobold.",
		"Benefit": [ "Choose an additional color for your Draconic Aspect feat or dragon-scaled racial trait. You gain the benefits of both this color and the color you originally chose. (If you have both Draconic Aspect and dragon-scaled, this benefit applies to both.) If you gain abilities that rely on scale color, choose which color gains the benefits." ]
	},
	{
		"-id": "Mobile Bulwark Style",
		"-title": "Mobile Bulwark Style",
		"-groups": "Combat,Style",
		"-description": "You are able to swing your tower shield around quickly.",
		"Prerequisites": "Str 13, Shield Focus, Tower Shield Proficiency, base attack bonus +1.",
		"Benefit": [ "While using a tower shield, add the shield's bonus to AC (including its enhancement bonus) to your CMD against bull rush and overrun combat maneuvers. While using this style, you can use a tower shield to grant you total cover along one edge of your space as a move action." ]
	},
	{
		"-id": "Mobile Fortress",
		"-title": "Mobile Fortress",
		"-groups": "Combat",
		"-description": "You use your tower shield to defend yourself or an ally at a moment's notice.",
		"Prerequisites": "Str 15, Mobile Bulwark Style, Shield Focus, Tower Shield Proficiency, base attack bonus +4.",
		"Benefit": [ "While using a tower shield, you add half of the shield's bonus to AC (including its enhancement bonus) to your touch AC and take only a -1 penalty on attack rolls because of the shield's encumbrance. While using Mobile Bulwark Style, whenever you would use a tower shield to gain total cover, you also grant any adjacent ally total cover against attacks passing through the selected edge of your space." ]
	},
	{
		"-id": "Mobile Stronghold",
		"-title": "Mobile Stronghold",
		"-groups": "Combat",
		"-description": "You can use your tower shield to block magical attacks.",
		"Prerequisites": "Str 17, Mobile Bulwark Style, Mobile Fortress, Shield Focus, Tower Shield Proficiency, base attack bonus +7.",
		"Benefit": [
			"While using a tower shield, you do not suffer a penalty on attack rolls because of the shield's encumbrance.",
			"While using Mobile Bulwark Style, whenever you use a tower shield to gain total cover, you also gain partial cover (and grant partial cover to adjacent allies) against spells passing through the selected edge of your space. Also, while using this style, you can gain total cover against a single attack made against you as an immediate or swift action."
		]
	},
	{
		"-id": "Mobility",
		"-title": "Mobility",
		"-groups": "Combat",
		"-description": "You can easily move through a dangerous melee.",
		"Prerequisites": "Dex 13, Dodge.",
		"Benefit": [
			"You get a +4 dodge bonus to Armor Class against attacks of opportunity caused when you move out of or within a threatened area. A condition that makes you lose your Dexterity bonus to Armor Class (if any) also makes you lose dodge bonuses.",
			"Dodge bonuses stack with each other, unlike most types of bonuses."
		]
	},
	{
		"-id": "Mocking Dance",
		"-title": "Mocking Dance",
		"-groups": "Combat, Performance",
		"-description": "You do a little dance that mocks your foe and entertains the crowd.",
		"Prerequisites": "Acrobatics 4 ranks or Perform (dance) 4 ranks.",
		"Benefit": [ "When you spend a swift action to make a performance combat check, before making that check you can either move 5 feet without provoking attacks of opportunity, or you can move your speed and provoke attacks of opportunity. You cannot end this move in a space where you threaten an enemy. If you do move at least 5 feet, you gain a +2 bonus on the performance combat check." ]
	},
	{
		"-id": "Modification Mastery",
		"-title": "Modification Mastery",
		"-groups": "Combat",
		"-description": "You can create inconceivable bastardizations of the smith's art.",
		"Prerequisites": "Creative Armorsmith, Armor Adept, and Craft (armor) 7 ranks, or Creative Weaponsmith, Weapon Adept, and Craft (weapons) 7 ranks; Knowledge (engineering) 7 ranks.",
		"Benefit": [ "You can use Creative Armorsmith or Creative Weaponsmith to add a modification to a weapon or suit of armor that already has a modification. The modification you are adding must be one that you have selected with Armor Adept or Weapon Adept. In addition, others can use armor or weapons with your temporary modifications." ]
	},
	{
		"-id": "Modification Trainer",
		"-title": "Modification Trainer",
		"-groups": "Combat",
		"-description": "You can drill others in the use of modified weapons or armor.",
		"Prerequisites": "Cha 13, Armor Adept or Weapon Adept, fighter level 4th.",
		"Benefit": [
			"Choose a modification that you have selected with the Armor Adept or Weapon Adept feat. Once per day with 10 minutes of drilling, you can instruct a number of allies equal to your Charisma modifier in the use of that modification.",
			"The allies to be trained must have an Intelligence of at least 3. The instructed allies gain the benefit of Armor Adept or Weapon Adept with that modification for 8 hours."
		]
	},
	{
		"-id": "Modified Weapon Proficiency",
		"-title": "Modified Weapon Proficiency",
		"-groups": "Combat",
		"-description": "You know how to use a specific weapon skillfully, even when it has undergone modification.",
		"Prerequisites": "Proficiency with the selected weapon.",
		"Benefit": [ "Select one type of weapon, such as longsword. You are always considered to be proficient with modified weapons of that type." ],
		"Normal": [ "A modified weapon is treated as one category more difficult to wield." ],
		"Special": [ "A warpriest with the focus weapon class feature can gain this feat with his deity's favored weapon in place of his bonus Weapon Focus feat. A magus with the kensai archetype can gain this feat with his chosen weapon in place of his bonus Weapon Focus feat." ]
	},
	{
		"-id": "Monastic Legacy",
		"-title": "Monastic Legacy",
		"-groups": "Combat",
		"Prerequisites": "Still mind class feature, Improved Unarmed Strike.",
		"Benefit": [ "Add half the levels you have in classes other than monk to your monk level to determine your effective monk level for your base unarmed strike damage. This feat does not make levels in classes other than monk count toward any other monk class features." ]
	},
	{
		"-id": "Monkey Lunge",
		"-title": "Monkey Lunge",
		"-groups": "Combat",
		"-description": "You can quickly recover from your lunges, helping you to avoid counterattacks.",
		"Prerequisites": "Lunge, Acrobatics 1 rank.",
		"Benefit": [ "As a standard action, you can use the Lunge feat to increase the reach of your melee attacks by 5 feet until the end of your turn, without suffering a penalty to your AC. You cannot use this feat if you carry a medium or heavy load." ],
		"Normal": [ "You take a -2 penalty to your AC until your next turn when making a lunge attack." ]
	},
	{
		"-id": "Monkey Moves",
		"-title": "Monkey Moves",
		"-groups": "Combat",
		"-description": "You scramble around your foes, moving and striking in an erratic fashion.",
		"Prerequisites": "Wis 13, Improved Unarmed Strike, Monkey Style, Acrobatics 8 ranks, Climb 8 ranks.",
		"Benefit": [ "While using Monkey Style, you gain a Wisdom bonus on Climb checks. You can also can climb and crawl at half your speed; you can take a 5-foot step by jumping, crawling, or climbing; and you retain your Dexterity bonus to AC while climbing. Further, while using Monkey Style, when you use your unarmed strike to hit an opponent twice or more on your turn, you can spend a swift action to take a 5-foot step even if you have moved this round." ],
		"Normal": [ "You climb at one-quarter your speed, and you lose your Dexterity bonus to AC while doing so. A 5-foot step is made using your normal movement modes, and you can take one only if you have not otherwise moved this round." ]
	},
	{
		"-id": "Monkey Shine",
		"-title": "Monkey Shine",
		"-groups": "Combat",
		"-description": "You combine acrobatics and opportunity to devastating effect against your opponent.",
		"Prerequisites": "Wis 13, Improved Unarmed Strike, Monkey Moves, Monkey Style, Stunning Fist, Acrobatics 11 ranks, Climb 11 ranks.",
		"Benefit": [ "While using Monkey Style, if you successfully deliver a Stunning Fist attempt, in addition to the normal effect of Stunning Fist, you can spend a free action to enter a square adjacent to you that is within your opponent's space. This movement does not provoke attacks of opportunity. While you are in your opponent's space, you gain a +4 dodge bonus to AC and a +4 bonus on melee attack rolls against that opponent. If otherwise unhindered, the opponent can move away from you, but if he does, he provokes an attack of opportunity from you even if his choice of movement does not normally do so." ],
		"Normal": [ "You cannot enter an opponent's space." ]
	},
	{
		"-id": "Monkey Style",
		"-title": "Monkey Style",
		"-groups": "Combat,Style",
		"-description": "Your unarmed fighting style is nimble and unpredictable, full of ground rolls and short leaps.",
		"Prerequisites": "Wis 13, Improved Unarmed Strike, Acrobatics 5 ranks, Climb 5 ranks.",
		"Benefit": [ "You add your Wisdom bonus on Acrobatics checks. While using this style, you take no penalty on melee attack rolls or to AC while prone. Further, you can crawl and stand up from lying prone without provoking attacks of opportunity, and you can stand up as a swift action if you succeed at a DC 20 Acrobatics check." ],
		"Normal": [ "You take a -4 penalty on attack rolls and AC against melee attacks while prone. Standing up from a prone position requires a move action and provokes attacks of opportunity." ]
	},
	{
		"-id": "Monstrous Companion",
		"-title": "Monstrous Companion",
		"-description": "You have formed a bond with a creature far more exotic than an animal.",
		"Prerequisites": "Handle Animal 7 ranks; class feature that functions as the druid animal companion ability (including animal companion, divine bond [mount], hunter's bond [animal companion], nature's bond [animal companion], and the mount class feature) with an effective druid level of 7.",
		"Benefit": [
			"You can select a magical beast as a cohort in place of your animal companion class feature. Table: Effective Cohort Level determines the effective cohort level for your monstrous companion based on your effective druid level.",
			"If the magical beast's effective cohort level is lower than what is allowed by your effective druid level, the cohort gains class levels equal to the difference. A cohort with 1 class level gains the link and share spells abilities of an animal companion. A cohort with 3 class levels gains the evasion animal companion ability. A cohort with 6 class levels gains the devotion animal companion ability. If the class feature you use as a prerequisite for this feat does not grant one of those abilities (such as a cavalier's mount, which does not gain share spells), your monstrous mount also does not gain the ability. The magical beast does not gain any abilities not listed here.",
			"In addition to the magical beasts listed in Table: Bestial Cohorts above, this feat can be used to gain an ahuizotl, aranea, blink dog, dragon horse, dragonne, giant eagle, giant owl, giant vulture, griffon, kirin, leucrotta, manticore, pegasus, sea cat, shedu, sleipnir, worg, or xanthos."
		],
		"Special": [ "This feat counts as the Leadership feat for the purposes of prerequisites. A character cannot have both Leadership and Monstrous Companion." ]
	},
	{
		"-id": "Monstrous Crafter",
		"-title": "Monstrous Crafter",
		"-groups": "Item Creation",
		"-description": "You can weave pieces of beasts into your magic items.",
		"Prerequisites": "Craft Wondrous Item, Grisly Ornament, Harvest Parts.",
		"Benefit": [ "Whenever you use the Grisly Ornament feat, you are able to permanently integrate one ornament you have crafted using the harvested creature parts into a wondrous item. The ornament grants no ongoing benefits, but once per day you can activate an integrated ornament as a free action to gain its full benefits for 1 minute. You can integrate an ornament into a wondrous item (or replace an item's existing ornament) by spending 8 hours of work and 100 gp × the creature's CR." ]
	},
	{
		"-id": "Monstrous Mask",
		"-title": "Monstrous Mask",
		"-description": "Your fiendish physical traits give you a twisted and fearsome appearance that strikes fear into others' hearts.",
		"Prerequisites": "Tiefling, must be taken at 1st level.",
		"Benefit": [ "You get a +5 racial bonus on Intimidate checks made against all creatures of the humanoid type." ]
	},
	{
		"-id": "Moonlight Stalker",
		"-title": "Moonlight Stalker",
		"-groups": "Combat",
		"-description": "You are adept at using shadows to conceal your attacks.",
		"Prerequisites": "Int 13, Blind-Fight, Combat Expertise, Bluff 3 ranks, darkvision or low-light vision racial trait.",
		"Benefit": [ "While you have concealment from an opponent, you gain a +2 bonus on attack and damage rolls against that opponent." ]
	},
	{
		"-id": "Moonlight Stalker Feint",
		"-title": "Moonlight Stalker Feint",
		"-groups": "Combat",
		"-description": "You strike through the shadows so quickly that your opponent can barely react to your attacks.",
		"Prerequisites": "Int 13, Blind-Fight, Combat Expertise, Improved Feint, Moonlight Stalker, Bluff 6 ranks, darkvision or low-light vision racial trait.",
		"Benefit": [ "Once per round, against an opponent from whom you have concealment, you can spend a swift action to make a Bluff check to feint." ],
		"Normal": [ "Feinting is a standard action." ]
	},
	{
		"-id": "Moonlight Stalker Master",
		"-title": "Moonlight Stalker Master",
		"-groups": "Combat",
		"-description": "You leave your opponents swinging at shadows while you slide elusively through the darkness.",
		"Prerequisites": "Int 13, Blind-Fight, Combat Expertise, Improved Feint, Moonlight Stalker, Moonlight Stalker Feint, Bluff 9 ranks, darkvision or low-light vision racial trait.",
		"Benefit": [ "While you have concealment, your opponents' miss chance against you increases by 10%. If an opponent misses you due to your concealment, you can spend an immediate action to move 5 feet, this movement does not provoke attacks of opportunity and does not count as a 5-foot step." ]
	},
	{
		"-id": "Moonlight Summons",
		"-title": "Moonlight Summons",
		"-description": "Your summoned minions are infused with the power of the moon.",
		"Prerequisites": "Spell Focus (conjuration), able to cast summon nature's ally.",
		"Benefit": [ "Creatures you summon shed light as a light spell. They are immune to confusion and sleep effects, and their natural weapons are treated as silver for the purposes of overcoming damage reduction." ]
	},
	{
		"-id": "Moontouched",
		"-title": "Moontouched",
		"-description": "Moonlight has a strange effect on you, making your body stronger but your mind weaker.",
		"Benefit": [ "At night when at least part of the moon is showing and you can see it, you gain a +2 bonus on Fortitude and Reflex saves but take a –2 penalty on Will saves." ]
	},
	{
		"-id": "Mother's Gift",
		"-title": "Mother's Gift",
		"-groups": "Changeling",
		"-description": "...",
		"Prerequisites": "Changeling.",
		"Benefit": [
			"Your dark legacy manifests in one of the following ways. You choose the manifestation when you choose the feat, and once selected it cannot be changed.",
			"Hag Claws (Ex): You gain a +1 bonus on attack and damage rolls with your claws.",
			"Surprisingly Tough (Ex): Your natural armor bonus increases by +1.",
			"Uncanny Resistance (Su): You gain spell resistance equal to 6 + your character level."
		],
		"Special": [ "You can gain this feat up to three times. Its effects do not stack. Each time you take the feat, you must select a different manifestation." ]
	},
	{
		"-id": "Motivating Display",
		"-title": "Motivating Display",
		"-groups": "Combat",
		"-description": "You can empower your allies through their fear of you.",
		"Prerequisites": "Cha 13, Dazzling Display, Weapon Focus.",
		"Benefit": [ "Whenever you use Dazzling Display to demoralize foes, you can motivate your allies to better serve you. In addition to possibly demoralizing foes within 30 feet, your Intimidate check while using Dazzling Display also applies to allies within 30 feet who can see you. The DC for this effect is the same as it would be to demoralize your allies. Each ally so affected gains a +1 morale bonus on attack rolls and skill checks for the duration that it would normally be shaken." ],
		"Special": [ "This feat is available to weretigers, weretiger-kin and those who associate with these creatures." ]
	},
	{
		"-id": "Mountain-Splitting Strike",
		"-title": "Mountain-Splitting Strike",
		"-groups": "Combat",
		"-description": "You have learned techniques to focus the force of an unarmed strike into the most vulnerable parts of a large opponent's anatomy.",
		"Prerequisites": "Wis 13, Improved Unarmed Strike.",
		"Benefit": [ "When you make a charge attack against an opponent at least one size category larger than you, your unarmed attacks deal damage as though you were one size category larger. In addition, you gain a +2 bonus to the DC of any Stunning Fist effect you deliver with this charge attack." ]
	},
	{
		"-id": "Mountaineer",
		"-title": "Mountaineer",
		"-description": "You are thoroughly at home in the high peaks and precipices of alpine territory.",
		"Prerequisites": "Favored terrain (mountains) class feature.",
		"Benefit": [ "You gain a +2 bonus on Climb checks on natural stone surfaces and a +4 bonus on Fortitude saves to avoid high-altitude fatigue and altitude sickness. If you spend 24 hours at a dangerous altitude, you treat that altitude as if it were one category lower. If you spend at least 1 week at that altitude, you are immune to altitude fatigue or sickness. If you go to a lower altitude for more than 1 week, you lose this acclimation." ]
	},
	{
		"-id": "Mounted Archery",
		"-title": "Mounted Archery",
		"-groups": "Combat",
		"-description": "You are skilled at making ranged attacks while mounted.",
		"Prerequisites": "Ride 1 rank, Mounted Combat.",
		"Benefit": [ "The penalty you take when using a ranged weapon while mounted is halved: -2 instead of -4 if your mount is taking a double move, and -4 instead of -8 if your mount is running." ]
	},
	{
		"-id": "Mounted Blade",
		"-title": "Mounted Blade",
		"-groups": "Local",
		"Prerequisites": "Ride 3 ranks, Mounted Combat, Ride-by Attack",
		"Benefit": [ "When you use the Ride-by Attack feat, if your attack hits, you may also make an attack against a target adjacent to your original target. This additional attack has a -5 penalty to the attack roll. You may use this feat whether riding a mount or using a flying item such as a broom of flying or carpet of flying." ]
	},
	{
		"-id": "Mounted Combat",
		"-title": "Mounted Combat",
		"-groups": "Combat",
		"-description": "You are adept at guiding your mount through combat.",
		"Prerequisites": "Ride 1 rank.",
		"Benefit": [ "Once per round when your mount is hit in combat, you may attempt a Ride check (as an immediate action) to negate the hit. The hit is negated if your Ride check result is greater than the opponent's attack roll." ]
	},
	{
		"-id": "Mounted Onslaught",
		"-title": "Mounted Onslaught",
		"-groups": "Combat, Local",
		"-description": "You and your mount can shatter an enemy's line with your unyielding assault.",
		"Prerequisites": "Mounted Combat, Trample, Ride 5 ranks.",
		"Benefit": [ "On your turn you may overrun more than one creature. Each overrun combat maneuver check beyond the first has a cumulative -5 penalty. If you fail to overrun a target, your movement ends. Your mount may only make a single hoof attack against one target that is knocked prone by your overrun (not one per prone opponent)." ],
		"Normal": [ "You can only attempt one overrun per round." ]
	},
	{
		"-id": "Mounted Shield",
		"-title": "Mounted Shield",
		"-groups": "Combat",
		"-description": "Your defensive tactics defend both you and your mount.",
		"Prerequisites": "Mounted Combat, Shield Focus.",
		"Benefit": [ "You may add your base shield bonus (including the bonus from Shield Focus but not including enhancement bonuses) to your mount's AC. In addition, you may add this bonus when making a Ride check to negate a hit against your mount using the Mounted Combat feat." ]
	},
	{
		"-id": "Mounted Skirmisher",
		"-title": "Mounted Skirmisher",
		"-groups": "Combat",
		"-description": "You are adept at attacking from upon a swift moving steed.",
		"Prerequisites": "Ride rank 14, Mounted Combat, Trick Riding.",
		"Benefit": [ "If your mount moves its speed or less, you can still take a full-attack action." ],
		"Normal": [ "If your mount moves more than 5 feet, you can only take an attack action." ]
	},
	{
		"-id": "Mud in Your Eye",
		"-title": "Mud in Your Eye",
		"-groups": "Combat",
		"-description": "You are used to fighting in muck and slime, and happily hurl it in your foes' eyes in the heat of battle.",
		"Prerequisites": "Throw Anything.",
		"Benefit": [ "As a standard action when in urban or subterranean terrain, you can scoop filth, sewage, mud, or similar grime off a nearby surface and hurl it at a foe as a ranged touch attack with a range increment of 5 feet. If the attack hits, you can immediately attempt a dirty trick combat maneuver against the target as a free action; this dirty trick can be used only to blind the target. As a ranged touch attack, this action provokes attacks of opportunity, even if your dirty trick attempts normally wouldn't provoke such attacks (such as via the Improved Dirty Trick feat)." ],
		"Special": [ "A character with favored terrain (as the ranger class feature) can use this feat when in any of his favored terrains in addition to urban and subterranean." ]
	},
	{
		"-id": "Multitalented Mastery",
		"-title": "Multitalented Mastery",
		"-groups": "Half-Elf",
		"-description": "...",
		"Prerequisites": "Character level 5th, half-elf, multi-talented racial trait.",
		"Benefit": [ "All of your classes are considered favored classes. You gain either +1 hit point or +1 skill point whenever you take a level in any class. Apply these bonuses retroactively for all class levels that have not yet gained one of these bonuses." ],
		"Normal": [ "Half-elves with the multi-talented racial trait have two favored classes." ]
	},
	{
		"-id": "Multiweapon Fighting",
		"-title": "Multiweapon Fighting",
		"-groups": "Combat",
		"-description": "This multi-armed creature is skilled at making attacks with multiple weapons.",
		"Prerequisites": "Dex 13, three or more hands.",
		"Benefit": [ "Penalties for fighting with multiple weapons are reduced by -2 with the primary hand and by -6 with off hands." ],
		"Normal": [ "A creature without this feat takes a -6 penalty on attacks made with its primary hand and a -10 penalty on attacks made with all of its off hands. (It has one primary hand, and all the others are off hands.) See Two-Weapon Fighting." ],
		"Special": [ "This feat replaces the Two-Weapon Fighting feat for creatures with more than two arms." ]
	},
	{
		"-id": "Murderer's Circle",
		"-title": "Murderer's Circle",
		"-groups": "Combat, Performance",
		"-description": "After savaging your foe, you circle like a hunter ready for the kill.",
		"Prerequisites": "Dodge, Acrobatics 4 ranks.",
		"Benefit": [ "When you spend a swift action to make a performance combat check after scoring a critical hit or performing a combat maneuver, and you are adjacent to the target of the critical hit or combat maneuver, you can move to any other space that is adjacent to the target without provoking attacks of opportunity. You must have a clear path to that space and the ability to reach it by spending a move action. If you end this move in any space other than the one where you started, you gain a +2 bonus on the performance combat check." ]
	},
	{
		"-id": "Murderous Sniper",
		"-title": "Murderous Sniper",
		"-groups": "Combat",
		"-description": "Your study of death allows you to pinpoint weaknesses from afar.",
		"Prerequisites": "Death attack class feature.",
		"Benefit": [ "You can make a death attack using a ranged weapon. Your target must be within 30 feet when attempting the death attack. For every additional round you spend studying the target, you can extend the range from which you can make a ranged death attack by 10 feet." ]
	},
	{
		"-id": "Murky Spell",
		"-title": "Murky Spell",
		"-groups": "Metamagic",
		"-description": "You can call upon murky sediments in the water to transform a mist spell underwater.",
		"Benefit": [ "You can apply Murky Spell only to a mist or fog spell that normally doesn't work underwater, such as cloudkill, fog cloud, mind fog, obscuring mist, or solid fog. When cast underwater, a murky spell clouds the water with sediments, producing roughly the same effects as the normal spell would above water except as follows. Due to the dilution, a murky spell has only one-tenth of the duration of a normal spell (generally 1 minute per level, though mind fog lasts 3 minutes), but this reduction doesn't affect the duration of secondary effects like mind fog's mental penalties. Abilities that see through mist and fog can't see through a murky spell unless they also specifically see through murky water (like the mistsight universal monster rule). Instead of wind, currents can disperse a murky spell; any current with a speed of at least 10 feet disperses a murky spell in 1 round. A murky spell has no effect above the water. A murky spell uses up a slot the same spell level as the spell's actual level." ]
	},
	{
		"-id": "Murmurs of Earth",
		"-title": "Murmurs of Earth",
		"-groups": "Oread",
		"-description": "The earth opens up her secrets to your perceptions.",
		"Prerequisites": "Echoes of Stone, character level 9th, oread.",
		"Benefit": [ "You gain a limited form of tremorsense. As a move action, you become aware of all creatures within 15 feet that are in contact with the ground at that moment." ]
	},
	{
		"-id": "Musketeer's Daring",
		"-title": "Musketeer's Daring",
		"-groups": "Combat, Panache",
		"-description": "The more you dare, the greater the results of your deeds.",
		"Prerequisites": "Dex 15, derring-do deed, swashbuckler level 6th.",
		"Benefit": [ "If the result of your d6 roll is a natural 5 or 6 when using the derring-do deed, you can roll another d6 and add it to the Acrobatics, Climb, Escape Artist, Fly, Ride, or Swim check that the deed modifies. The number of d6s you roll is still limited to a number equal to your Dexterity modifier (minimum 1), and you can roll another d6 after a natural roll of 5 or 6 only once per use of derring-do." ],
		"Normal": [ "You can roll further derring-do d6s only if you roll a natural 6 on the die." ]
	},
	{
		"-id": "Musketeer's Dodge",
		"-title": "Musketeer's Dodge",
		"-groups": "Combat, Grit",
		"-description": "You dodge ranged attacks with greater proficiency than most.",
		"Prerequisites": "Exotic Weapon Proficiency (firearms), gunslinger level 3rd, gunslinger's dodge deed.",
		"Benefit": [ "When you use the gunslinger's dodge deed to move, the movement granted by that deed does not provoke attacks of opportunity, and you gain a +4 dodge bonus to your Armor Class." ]
	},
	{
		"-id": "Musketeer's Reposition",
		"-title": "Musketeer's Reposition",
		"-groups": "Combat, Grit",
		"-description": "You can knock a foe away with your two-handed firearm.",
		"Prerequisites": "Exotic Weapon Proficiency (firearms), gunslinger level 6th, pistol-whip deed.",
		"Benefit": [ "When you hit an opponent with a two-handed firearm while using the pistol-whip deed, you can perform a reposition combat maneuver instead of knocking the target prone. However, you can't reposition the foe closer to you. This combat maneuver does not provoke attacks of opportunity." ]
	},
	{
		"-id": "Mutated Shape",
		"-title": "Mutated Shape",
		"-description": "Your wild shape form gains an additional appendage you can use to attack your foes.",
		"Prerequisites": "Wis 19, base attack bonus +6, wild shape class feature.",
		"Benefit": [ "When you use wild shape, you grow an additional appendage of your choice that can be used to make one of the following attacks: bite, claw, gore, slam, sting, or talons. The appendage can be used as part of a full attack using your highest base attack bonus, and it deals damage as described in Table 3–2: Mutated Shape Appendage Attacks. This appendage lasts for as long as you stay in the same form with this use of wild shape." ]
	},
	{
		"-id": "Mutilating Ritualist",
		"-title": "Mutilating Ritualist",
		"-description": "You add a personal sacrifice to heighten the power of your ritual magic.",
		"Prerequisites": "Knowledge (arcana) 4 ranks, Knowledge (religion) 4 ranks, Spellcraft 4 ranks.",
		"Benefit": [
			"Once during the casting of an occult ritual, you can inflict 1d6 hit points of damage per 2 Hit Dice and 1d4 Constitution damage (or Charisma damage if you're undead) to yourself as an immediate action with a piercing or slashing weapon.",
			"You can't reduce or ignore this damage in any way. This damage doesn't disrupt the ritual, and you can roll twice for the next skill check made as part of a ritual casting and take the better result. If the resulting ritual effect has the fear descriptor or is in the phantasm subschool, increase its saving throw DC by 1. Multiple characters with this feat can each use it once per ritual on their skill checks, but the DC increases don't stack."
		]
	},
	{
		"-id": "Mutual Hatred",
		"-title": "Mutual Hatred",
		"-groups": "Combat",
		"-description": "Others hate you, and their hatred feeds your own.",
		"Benefit": [ "You gain a +1 bonus on attack rolls and damage rolls against creatures whose hatred racial trait or favored enemy class feature applies to you. For instance, an orc would gain this bonus against all dwarves and against rangers who chose humanoid (orc) as a favored enemy." ]
	},
	{
		"-id": "My Blade Is Yours",
		"-title": "My Blade Is Yours",
		"-groups": "Combat,Teamwork",
		"-description": "You fight with seamless grace alongside your allies, complementing the inherent strengths of your weaponry.",
		"Prerequisites": "Int 13, Combat Expertise, Sense Motive 3 ranks.",
		"Benefit": [ "When adjacent to an ally with this feat who is wielding a weapon with the blocking, disarm, distracting, or trip weapon special feature, you can treat your own weapon as if it also had that feature. If your ally's weapon has more than one of those features, you choose one feature to emulate at the start of your turn." ]
	},
	{
		"-id": "Mystic Stride",
		"-title": "Mystic Stride",
		"-description": "Enchanted vegetation does not bar your path.",
		"Prerequisites": "Dex 15, Nimble Moves, woodland stride class feature.",
		"Benefit": [ "You can move at full speed even through thorns, briars, and overgrown areas that are enchanted or magically manipulated to impede motion, even if those areas confer the entangled condition." ],
		"Normal": [ "Woodland stride does not apply to thorns, briars, and overgrowth areas that are enchanted or magically manipulated." ]
	},
	{
		"-id": "Mythic Accursed Hex",
		"-title": "Mythic Accursed Hex",
		"-groups": "Mythic",
		"-description": "Your hexes flare with persistent potency.",
		"Prerequisites": "Accursed Hex.",
		"Benefit": [ "When you use Accursed Hex to target a creature with one of your hexes a second time, that creature must roll its saving throw twice and take the lower result." ]
	},
	{
		"-id": "Mythic Agile Maneuvers",
		"-title": "Mythic Agile Maneuvers",
		"-groups": "Mythic",
		"-description": "You can find just the right place to apply pressure to a foe.",
		"Prerequisites": "Agile Maneuvers, 4th mythic tier.",
		"Benefit": [ "You may add both your Strength and Dexterity bonuses to your base attack bonus and size bonus when determining your Combat Maneuver Bonus." ],
		"Normal": [ "Agile Maneuvers allows you to add your Dexterity bonus to your base attack bonus and size bonus when determining your Combat Maneuver Bonus instead of your Strength bonus." ]
	},
	{
		"-id": "Mythic Alertness",
		"-title": "Mythic Alertness",
		"-groups": "Mythic",
		"-description": "Your powers of perception surpass everyone's, whether used to observe your surroundings or the intentions of others.",
		"Prerequisites": "Alertness.",
		"Benefit": [ "The bonus on Perception and Sense Motive skill checks from Alertness increases by 2. In addition, you can expend one use of mythic power to treat a Perception or Sense Motive check as if you had rolled a natural 20. You must decide to use this ability before making the roll." ]
	},
	{
		"-id": "Mythic Animal Affinity",
		"-title": "Mythic Animal Affinity",
		"-groups": "Mythic",
		"-description": "You have a greater affinity with wild animals, and can speak with them.",
		"Prerequisites": "Animal Affinity.",
		"Benefit": [ "The bonus on Handle Animal and Ride skill checks from Animal Affinity increases by 2. In addition, you can expend one use of mythic power to speak with animals as the spell. Your caster level for this effect is equal to twice your tier." ]
	},
	{
		"-id": "Mythic Arcane Armor Mastery",
		"-title": "Mythic Arcane Armor Mastery",
		"-groups": "Mythic",
		"-description": "Armor has almost no effect on your spellcasting.",
		"Prerequisites": "Arcane Armor Mastery, Arcane Armor Training, Medium Armor Proficiency, Mythic Arcane Armor Training, caster level 7th, 2nd mythic tier.",
		"Benefit": [ "You don't have to spend a swift action to gain the reduction to arcane spell failure chance from Arcane Armor Mastery. Furthermore, you reduce your total arcane spell failure reduction for any armor you are proficient with by 30%." ]
	},
	{
		"-id": "Mythic Arcane Blast",
		"-title": "Mythic Arcane Blast",
		"-groups": "Mythic",
		"-description": "You can manipulate raw eldritch energies to do more than just deal damage.",
		"Prerequisites": "Arcane Blast.",
		"Benefit": [
			"When you use Arcane Blast, you may halve the damage dice to also perform your choice of either a trip or bull rush combat maneuver against the target of the blast. You can't move with an opponent you bull rush with this feat. You gain a bonus on your combat maneuver check for this attempt equal to half the spell level of the spell you sacrificed when using Arcane Blast, and you can substitute your Intelligence or Charisma modifier in place of your Strength modifier when determining your combat maneuver bonus.",
			"In addition, you can expend one use of mythic power to change the damage dice of your Arcane Blast to d8s instead of d6s."
		]
	},
	{
		"-id": "Mythic Arcane Strike",
		"-title": "Mythic Arcane Strike",
		"-groups": "Mythic",
		"-description": "Using your amazing arcane talents, you can deliver devastating blows infused with magical energy.",
		"Prerequisites": "Arcane Strike.",
		"Benefit": [ "Whenever you use Arcane Strike to enhance your weapons, the effect lasts for 1 minute instead of 1 round. If you expend one use of mythic power when using Arcane Strike, you can also add any one magic weapon special ability with a base price modifier of +1 to your weapons. This base price modifier increases to +2 at 4th tier, +3 at 7th tier, and +4 at 10th tier." ]
	},
	{
		"-id": "Mythic Armor Proficiency (Heavy)",
		"-title": "Mythic Armor Proficiency (Heavy)",
		"-groups": "Mythic",
		"-description": "You know how to turn heavy armor to your advantage against any offense, not just attacks designed to harm you.",
		"Prerequisites": "Armor Proficiency (heavy, light, medium).",
		"Benefit": [ "When wearing heavy armor, add half its non-magic armor bonus to your CMD. You may expend a use of mythic power to also add it to your touch AC for one minute." ]
	},
	{
		"-id": "Mythic Armor Proficiency (Light) (Mythic)",
		"-title": "Mythic Armor Proficiency (Light) (Mythic)",
		"-description": "You know how to turn light armor to your advantage against any offense, not just attacks designed to harm you.",
		"Prerequisites": "Armor Proficiency (light).",
		"Benefit": [ "When wearing light armor, add half its non-magic armor bonus to your CMD. You may expend a use of mythic power to also add it to your touch AC for one minute." ]
	},
	{
		"-id": "Mythic Armor Proficiency (Medium)",
		"-title": "Mythic Armor Proficiency (Medium)",
		"-groups": "Mythic",
		"-description": "You know how to turn medium armor to your advantage against any offense, not just attacks designed to harm you.",
		"Prerequisites": "Armor Proficiency (light, medium).",
		"Benefit": [ "When wearing medium armor, add half its non- magic armor bonus to your CMD. You may expend a use of mythic power to also add it to your touch AC for one minute." ]
	},
	{
		"-id": "Mythic Aspect of the Beast",
		"-title": "Mythic Aspect of the Beast",
		"-groups": "Mythic",
		"-description": "Your blood burns with savage fury, giving you bestial powers and abilities.",
		"Prerequisites": "Aspect of the Beast.",
		"Benefit": [ "Your bestial nature manifests itself in one of the following ways. You choose the manifestation when you choose the feat, and you can't change it." ]
	},
	{
		"-id": "Mythic Augment Summoning",
		"-title": "Mythic Augment Summoning",
		"-groups": "Mythic",
		"-description": "Your summoning spells bring not mere ordinary beasts, but instead mythic creatures.",
		"Prerequisites": "Augment Summoning.",
		"Benefit": [ "Any creature you summon using a summon spell is considered mythic for the purpose of interacting with other mythic creatures. It doesn't gain any mythic abilities or power, but is affected by mythic spells and abilities as if it were a 1st-tier mythic creature. Additionally, if the creature summoned has damage reduction, its damage reduction becomes DR/epic." ]
	},
	{
		"-id": "Mythic Blind-Fight",
		"-title": "Mythic Blind-Fight",
		"-groups": "Mythic",
		"-description": "No creature can avoid your preternatural senses.",
		"Prerequisites": "Blind-Fight.",
		"Benefit": [ "As a swift action, you can expend one use of mythic power to ignore all miss chances due to concealment or total concealment for a number of rounds equal to your tier." ]
	},
	{
		"-id": "Mythic Blinding Critical",
		"-title": "Mythic Blinding Critical",
		"-groups": "Combat, Mythic",
		"-description": "You can blind foes with a weapon blow at will.",
		"Prerequisites": "Blinding Critical, Critical Focus, base attack bonus +15, 3rd mythic tier.",
		"Benefit": [
			"Once per round when you hit a foe with an attack, but the attack is not a critical, you may expend two uses of Mythic Power to inflict the effect of the Blinding Critical feat rather than your attack's normal damage.",
			"You may not add the effects of more than one mythic critical feat to a single attack."
		]
	},
	{
		"-id": "Mythic Brew Potion",
		"-title": "Mythic Brew Potion",
		"-groups": "Mythic",
		"-description": "You have mastered the art of brewing potions.",
		"Prerequisites": "Brew Potion, caster level 3rd.",
		"Benefit": [
			"At the beginning of each day when you regain your uses of Mythic Power, you can expend one use of mythic power to accomplish eight hours of work on one potion you are brewing. You can only do this once per day per potion you are brewing, though you may also add an actual eight-hour work day toward the brewing of such a potion. Unlike normal potion brewing, work accomplished by expending a use of mythic power does not require any special work space or quiet (though the cost of making magic items created this way is normal).",
			"Additionally, there is no limit to the level of spell you can turn into a potion."
		]
	},
	{
		"-id": "Mythic Channel Smite",
		"-title": "Mythic Channel Smite",
		"-groups": "Mythic",
		"-description": "Your weapon a conduit of divine energy.",
		"Prerequisites": "Channel Smite.",
		"Benefit": [
			"When using Channel Smite, you gain a bonus on your attack roll equal to the number of d6s granted by your channel energy class feature. This is either a sacred bonus (if channeling positive energy) or a profane bonus (if channeling negative energy).",
			"If your attack misses the target, you can expend one use of mythic power as a free action to release the channeled energy, producing the normal effects of your channel energy class feature centered on the creature you were attempting to smite."
		]
	},
	{
		"-id": "Mythic Cleave",
		"-title": "Mythic Cleave",
		"-groups": "Mythic",
		"-description": "You can cleave any foe within your reach.",
		"Prerequisites": "Cleave.",
		"Benefit": [ "Whenever you use Cleave or Great Cleave, one of your attacks can be made against a foe that is within your reach, but not adjacent to the foe you attacked. You can expend one use of mythic power when you use Cleave or Great Cleave to continue making attacks against foes within your reach, regardless of their position, as long as you continue to hit each foe. You can't use this ability to attack a foe more than once per round." ]
	},
	{
		"-id": "Mythic Combat Casting",
		"-title": "Mythic Combat Casting",
		"-groups": "Mythic",
		"-description": "You rarely lose concentration in combat.",
		"Prerequisites": "Combat Casting, mythic tier 1.",
		"Benefit": [ "The bonus from Combat Casting increases to +8. Anytime you fail a concentration check, you do not lose the spell or spell slot you were attempting to use. You do not manage to cast the spell, but it remains available for you to use at a later time. Additionally if you successfully make a check to cast a spell defensively and the spell requires a ranged attack roll, that ranged attack does not provoke an attack of opportunity." ]
	},
	{
		"-id": "Mythic Combat Reflexes",
		"-title": "Mythic Combat Reflexes",
		"-groups": "Mythic",
		"-description": "You strike viciously whenever your foe gives you an opening.",
		"Prerequisites": "Combat Reflexes.",
		"Benefit": [ "You can make any number of additional attacks of opportunity per round. As a swift action, you can expend one use of mythic power to, until the start of your next turn, make attacks of opportunity against foes you've already made attacks of opportunity against this round if they provoke attacks of opportunity from you by moving." ]
	},
	{
		"-id": "Mythic Companion",
		"-title": "Mythic Companion",
		"-groups": "Mythic",
		"-description": "Despite your non-mythic nature, you're a vital part of the greater mythic world.",
		"Prerequisites": "You must be non-mythic.",
		"Benefit": [ "You're considered a mythic creature for the purposes of determining how mythic spells and effects affect you. If you ever become mythic, you gain a +1 bonus on all saves against mythic spells and effects." ]
	},
	{
		"-id": "Mythic Craft Magic Arms And Armor",
		"-title": "Mythic Craft Magic Arms And Armor",
		"-groups": "Mythic",
		"-description": "Your ability to create magic weapons and defenses is unmatched.",
		"Prerequisites": "Craft Magic Arms and Armor, caster level 5th.",
		"Benefit": [
			"At the beginning of each day when you regain your uses of mythic power, you can expend one use of mythic power to accomplish eight hours of work on one magic armor or weapon you are crafting. You can only do this once per day per item you are crafting, though you may also add an actual eight-hour work day toward the crafting of such an item. Unlike normal magic item crafting, work accomplished by expending a use of mythic power does not require any special work space or quiet (though the cost of making magic items created this way is normal).",
			"Additionally, by expending two uses of mythic power you can change the magic properties of any weapon or suit of armor in your possession. For one hour the armor or weapon loses one or more abilities of your choice (though it must always retain at least a +1 enhancement bonus), and gains other magic properties of your choice. The total cost of the armor or weapon with the new properties cannot exceed its total cost with its normal magic properties, and you must meet all the prerequisites of each magic property you temporarily grant the armor or weapon."
		]
	},
	{
		"-id": "Mythic Craft Rod",
		"-title": "Mythic Craft Rod",
		"-groups": "Mythic",
		"-description": "You are a master rod crafter.",
		"Prerequisites": "Craft Rod, caster level 9th.",
		"Benefit": [
			"At the beginning of each day when you regain your uses of mythic power, you can expend one use of mythic power to accomplish eight hours of work on one rod you are crafting. You can only do this once per day per rod you are crafting, though you may also add an actual eight-hour work day toward the crafting of such a rod. Unlike normal magic item crafting, work accomplished by expending a use of mythic power does not require any special work space or quiet (though the cost of making magic items created this way is normal).",
			"You can also cause any constant or command-word magic item to function while holding it, rather than wearing it on the appropriate magic item body slot."
		]
	},
	{
		"-id": "Mythic Craft Staff",
		"-title": "Mythic Craft Staff",
		"-groups": "Mythic",
		"-description": "You are a master staff crafter.",
		"Prerequisites": "Craft Staff, caster level 11th.",
		"Benefit": [
			"At the beginning of each day when you regain your uses of mythic power, you can expend one use of mythic power to accomplish eight hours of work on one magic staff you are crafting. You can only do this once per day per staff you are crafting, though you may also add an actual eight-hour work day toward the crafting of such a staff. Unlike normal magic item crafting, work accomplished by expending a use of mythic power does not require any special work space or quiet (though the cost of making magic items created this way is normal).",
			"You can also cause any magic items you create to function with a caster level equal to its user's total level, rather than a set caster level. You must meet all the creation prerequisites of the magic item in question, and must create the item to have a caster level of at least 8th level. This has no effect on the function of items with effects not based on caster level (such as boots of elvenkind), but does change the items level in use for purposes of what auras it gives off, and how difficult it is to effect with dispel magic (and similar effects)."
		]
	},
	{
		"-id": "Mythic Craft Wand",
		"-title": "Mythic Craft Wand",
		"-groups": "Mythic",
		"-description": "You are a master wand crafter.",
		"Prerequisites": "Craft Wand, caster level 5th.",
		"Benefit": [
			"At the beginning of each day when you regain your uses of mythic power, you can expend one use of mythic power to accomplish eight hours of work on one wand you are crafting. You can only do this once per day per wand you are crafting, though you may also add an actual eight-hour work day toward the crafting of such a wand. Unlike normal magic item crafting, work accomplished by expending a use of mythic power does not require any special work space or quiet (though the cost of making magic items created this way is normal).",
			"Additionally, rather than create a wand with 50 charges, for the same cost and time you may create a wand that functions 3 times/day."
		]
	},
	{
		"-id": "Mythic Craft Wondrous Item",
		"-title": "Mythic Craft Wondrous Item",
		"-groups": "Mythic",
		"-description": "You are a master crafter of wondrous magic items.",
		"Prerequisites": "Craft Wondrous Item, caster level 3rd.",
		"Benefit": [
			"At the beginning of each day when you regain your uses of mythic power, you can expend one use of mythic power to accomplish eight hours of work on one wondrous item you are crafting. You can only do this once per day per item you are crafting, though you may also add an actual eight-hour work day toward the crafting of such an item. Unlike normal magic item crafting, work accomplished by expending a use of mythic power does not require any special work space or quiet (though the cost of making magic items created this way is normal).",
			"You can also combine magic items, or change the form of a magic item. You can only do these things to a magic item you meet all the prerequisites to create (though it need not be a wondrous item, as long as you have the appropriate crafting feat). Changing the form of a magic item takes the same time and costs as much as making a magic item with a cost equal to 20% of the item to be changed, if the new form takes a magic item slot. If the new form can be hand-held, changing its form takes the same time and costs as much as making a magic item with a cost equal to 40% of the item to be changed. If the new form is an ioun stone, changing its form takes the same time and costs as much as making a magic item with a cost equal to 100% of the item to be changed. Some magic items may not be able to be changed into some forms (either due to the essential function of the items original form – such as a magic musical instrument or weapon, or because the end result is too silly – such as a clown nose of intellect) at the discretion of the GM.Combining two magic items requires they have the same basic shape or magic item slot, and takes the same time and costs as much as making a magic item with a cost equal to 100% of the cheaper of the two items to be combined."
		]
	},
	{
		"-id": "Mythic Crafter",
		"-title": "Mythic Crafter",
		"-groups": "Mythic",
		"-description": "You can craft mythic magic items.",
		"Prerequisites": "Any item creation feat.",
		"Benefit": [ "You can create any mythic magic item for which you have the appropriate item creation feat. In addition, you gain a +5 bonus on skill checks when creating non-mythic magic items." ]
	},
	{
		"-id": "Mythic Critical Focus",
		"-title": "Mythic Critical Focus",
		"-groups": "Mythic",
		"-description": "Your blows unerringly find your target's vital spots.",
		"Prerequisites": "Critical Focus.",
		"Benefit": [ "You automatically confirm critical threats against non-mythic opponents. In addition, when you threaten a critical hit against a creature wearing armor with the fortification special ability or similar effect, that creature must roll twice and take the worse result when determining critical hit negation." ]
	},
	{
		"-id": "Mythic Dastardly Finish",
		"-title": "Mythic Dastardly Finish",
		"-groups": "Mythic",
		"-description": "You strike downed, dazed, and staggered opponents with deadly efficiency.",
		"Prerequisites": "Dastardly Finish.",
		"Benefit": [ "You can deliver a coup de grace to dazed and staggered non-mythic opponents. In addition, when any creature makes a Fortitude saving throw to survive one of your coup de grace attempts, it takes a penalty to that saving throw equal to your tier." ]
	},
	{
		"-id": "Mythic Deadly Aim",
		"-title": "Mythic Deadly Aim",
		"-groups": "Mythic",
		"-description": "Your aim is truly devastating.",
		"Prerequisites": "Deadly Aim.",
		"Benefit": [ "When you use Deadly Aim, you gain a +3 bonus on ranged damage rolls instead of +2. When your base attack bonus reaches +4, and every +4 thereafter, the bonus on ranged damage rolls increases by +3 rather than +2." ]
	},
	{
		"-id": "Mythic Deafening Critical",
		"-title": "Mythic Deafening Critical",
		"-groups": "Critical,Mythic",
		"-description": "You can deafen foes with a weapon blow at will.",
		"Prerequisites": "Deafening Critical, Critical Focus, base attack bonus +13, 3rd mythic tier.",
		"Benefit": [
			"Once per round when you hit a foe with an attack, but the attack is not a critical, you may expend two uses of mythic power to inflict the effect of the Deafening Critical feat rather than your attack's normal damage.",
			"You may not add the effects of more than one mythic critical feat to a single attack."
		]
	},
	{
		"-id": "Mythic Death from Above",
		"-title": "Mythic Death from Above",
		"-groups": "Mythic",
		"-description": "When attacking from the air or higher ground, you bear down on your enemy to deadly effect.",
		"Prerequisites": "Death from Above.",
		"Benefit": [ "Whenever you charge an opponent from higher ground, or from above while flying, the critical multiplier of your weapon increases by 2 (to a maximum of ×6). This doesn't stack with other abilities that increase a weapon's critical multiplier. If your charge attack hits, you can perform a trip combat maneuver against the attack's target as a free action without provoking attacks of opportunity." ]
	},
	{
		"-id": "Mythic Deepsight",
		"-title": "Mythic Deepsight",
		"-groups": "Mythic",
		"-description": "Your sharp eyes can penetrate deeper into the darkness, revealing more to you.",
		"Prerequisites": "Deepsight.",
		"Benefit": [ "The range of your darkvision increases by 10 feet per tier." ]
	},
	{
		"-id": "Mythic Deflect Arrows",
		"-title": "Mythic Deflect Arrows",
		"-groups": "Mythic",
		"-description": "You deflect projectiles and ray spells with uncanny skill.",
		"Prerequisites": "Deflect Arrows.",
		"Benefit": [ "When using Deflect Arrows, you can deflect an additional number of ranged attacks per round equal to half your tier. You can expend one use of mythic power as an immediate action to deflect a single ray from a ray spell or effect targeting you." ]
	},
	{
		"-id": "Mythic Detect Expertise",
		"-title": "Mythic Detect Expertise",
		"-groups": "Mythic",
		"-description": "You can sense a creature's magical abilities with just a mere glance.",
		"Prerequisites": "Detect Expertise.",
		"Benefit": [ "You gain the benefit of Detect Expertise immediately (without needing to observe a creature for 3 rounds) when using the divinations listed in Detect Expertise. Non-mythic creatures cannot attempt a Will save to resist this effect." ]
	},
	{
		"-id": "Mythic Diehard",
		"-title": "Mythic Diehard",
		"-groups": "Mythic",
		"-description": "You are difficult to put down, and almost impossible to kill.",
		"Prerequisites": "Diehard, Endurance.",
		"Benefit": [ "When your hit point total is below 0, you are staggered but do not take damage from taking standard actions. When you reach the negative hit point total that would normally result in your death, you have an additional number of negative hit points equal to your Constitution score + mythic tier beyond that. When in this range of negative hit points you automatically stabilize, but are unconscious." ]
	},
	{
		"-id": "Mythic Distance Thrower",
		"-title": "Mythic Distance Thrower",
		"-groups": "Mythic",
		"-description": "There's virtually no limit to your powerful throwing arm.",
		"Prerequisites": "Str 17, Distance Thrower.",
		"Benefit": [ "Thrown weapons wielded by you have twice their normal range." ]
	},
	{
		"-id": "Mythic Dodge",
		"-title": "Mythic Dodge",
		"-groups": "Mythic",
		"-description": "When focused, you become nearly impossible to strike.",
		"Prerequisites": "Dodge.",
		"Benefit": [ "The bonus to AC from Dodge increases by 1. As an immediate action, you can expend one use of mythic power to grant yourself an additional +10 dodge bonus to AC against one attack." ]
	},
	{
		"-id": "Mythic Drink Is Life",
		"-title": "Mythic Drink Is Life",
		"-groups": "Mythic",
		"-description": "Strong drink fuels the mythic fires within you.",
		"Prerequisites": "Con 19, 3rd mythic tier.",
		"Benefit": [ "You never take penalties for consuming non-magical alcohol, and you can consume an alcoholic beverage as a swift action instead of a move action. Each time you consume an alcoholic beverage, you may gain one of the benefits of polypurpose panacea. You can have only one of these benefits active at a time. If you expend one use of mythic power while drinking an alcoholic beverage, you can heal 2 points of ability damage, negate a temporary penalty to one ability score, or remove one of the following conditions: confused, diseased, exhausted, fatigued, frightened, nauseated, poisoned, shaken, sickened, or staggered." ]
	},
	{
		"-id": "Mythic Eagle Eyes",
		"-title": "Mythic Eagle Eyes",
		"-groups": "Mythic",
		"-description": "You eyesight rivals that of the most far-seeing raptors.",
		"Prerequisites": "Eagle Eyes.",
		"Benefit": [ "You ignore up to –10 in penalties due to distance on visual Perception checks, instead of the normal –5. As a swift action, you can expend one use of mythic power to ignore all penalties due to distance on visual Perception checks for 1 round." ]
	},
	{
		"-id": "Mythic Elemental Channel",
		"-title": "Mythic Elemental Channel",
		"-groups": "Mythic",
		"-description": "Your power over elemental beings is nearly absolute.",
		"Prerequisites": "Elemental Channel.",
		"Benefit": [ "Your Elemental Channel can affect any elemental subtype, not just the one you chose when you took Elemental Channel. Each time you use Elemental Channel, you must pick one elemental subtype before using the feat. You can expend one use of mythic power when you use Elemental Channel to choose a second elemental subtype to affect." ]
	},
	{
		"-id": "Mythic Elemental Focus",
		"-title": "Mythic Elemental Focus",
		"-groups": "Mythic",
		"-description": "Your elemental spells are potent and effective.",
		"Prerequisites": "Elemental Focus.",
		"Benefit": [ "Choose an energy type in which you already have Elemental Focus. The increase to save DC provided by Elemental Focus and Greater Elemental Focus for spells of the selected energy type is 1 higher. When casting a spell with this energy type's descriptor, you can expend one use of mythic power as part of the casting to force the spell's targets to roll their saving throws twice, taking the lower result." ]
	},
	{
		"-id": "Mythic Empower Spell",
		"-title": "Mythic Empower Spell",
		"-groups": "Metamagic,Mythic",
		"-description": "You can increase the effect of a spell by +75%.",
		"Prerequisites": "Empower Spell, 5th mythic tier.",
		"Benefit": [
			"When you cast a spell augmented with Empower Spell, all variable, numeric effects of the spell are increased by +75%, including bonuses to those dice rolls.",
			"Alternatively, you may expend a use of mythic power to cast a spell as an empowered spell (gaining only the normal benefits of an empowered spell, rather than the increased benefits outlined above) without preparing it as empowered in advance, taking extra casting time, or increasing the level of spell slot it uses."
		],
		"Normal": [ "All variable, numeric effects of an empowered spell are increased by half including bonuses to those dice rolls." ]
	},
	{
		"-id": "Mythic Endurance",
		"-title": "Mythic Endurance",
		"-groups": "Mythic",
		"-description": "Your endurance is truly beyond the pale.",
		"Prerequisites": "Endurance.",
		"Benefit": [
			"The bonus on checks and saves from Endurance increases by half your tier. You take half the damage when you fail a check to avoid non-lethal damage from a forced march, starvation and thirst, hot or cold environments, or slow suffocation.",
			"You can sleep in heavy armor without becoming fatigued."
		]
	},
	{
		"-id": "Mythic Enlarge Spell",
		"-title": "Mythic Enlarge Spell",
		"-groups": "Metamagic, Mythic",
		"-description": "You can triple the range of a spell.",
		"Prerequisites": "Enlarge Spell.",
		"Benefit": [
			"When you cast a spell with a range of close, medium, or long augmented with Enlarge Spell, its range is increased by +200%. An enlarged spell with a range of close now has a range of 75 ft. + 15 ft./2 levels, while medium-range spells have a range of 300 ft. + 30 ft./level and long-range spells have a range of 1,200 ft. + 120 ft./level.",
			"Alternatively, you may expend a use of mythic power to cast a spell as an enlarged spell (gaining only the normal benefits of an enlarged spell, rather than the increased benefits outlined above) without preparing it as enlarged in advance, taking extra casting time, or increasing the level of spell slot it uses."
		],
		"Normal": "An enlarged spell with a range of close has a range of 50 ft. + 5 ft./level, while medium-range spells have a range of 200 ft. + 20 ft./level and long-range spells have a range of 800 ft. + 80 ft./level."
	},
	{
		"-id": "Mythic Exhausting Critical",
		"-title": "Mythic Exhausting Critical",
		"-groups": "Critical,Mythic",
		"-description": "You can exhaust foes at will.",
		"Prerequisites": "Critical Focus, Exhausting Critical, Tiring Critical , base attack bonus +15, 3rd mythic tier.",
		"Benefit": [
			"Once per round when you hit a foe with an attack, but the attack is not a critical, you may expend two uses of mythic power to inflict the effect of the Exhausting Critical feat rather than your attack's normal damage.",
			"You may not add the effects of more than one mythic critical feat to a single attack."
		]
	},
	{
		"-id": "Mythic Exotic Weapon Proficiency",
		"-title": "Mythic Exotic Weapon Proficiency",
		"-groups": "Mythic",
		"-description": "Your prowess with a specific exotic weapon is beyond compare.",
		"Prerequisites": "Exotic Weapon Proficiency, base attack bonus +6.",
		"Benefit": [
			"Select one exotic weapon you are proficient with. When making additional attacks as a result of a high base attack bonus, each attack after the first has its attack bonus reduced by 4, rather than by 5. This does not change the number of additional attacks you gain, only the attack bonus used by each additional attack.",
			"For example, Jacinth is a 14th level fighter proficient with the spiked chain who has taken Mythic Exotic Weapon Proficiency with that weapon. Normally he would receive three attacks as a result of his base attack bonus, at +14/+9/+4. However as a result of this feat, his three attacks are instead at +14/+10/+6."
		]
	},
	{
		"-id": "Mythic Extend Spell",
		"-title": "Mythic Extend Spell",
		"-groups": "Metamagic,Mythic",
		"-description": "You can triple the duration of a spell.",
		"Prerequisites": "Extend Spell.",
		"Benefit": [
			"When you cast a spell augmented with Extend Spell, it lasts three times as long as normal. A spell with a duration of concentration, instantaneous, or permanent is not affected by this feat.",
			"Alternatively, you may expend a use of mythic power to cast a spell as an extended spell (gaining only the normal benefits of an extended spell, rather than the increased benefits outlined above) without preparing it as extended in advance, taking extra casting time, or increasing the level of spell slot it uses."
		],
		"Normal": [ "An extended spell lasts twice as long as normal." ]
	},
	{
		"-id": "Mythic Extra Channel",
		"-title": "Mythic Extra Channel",
		"-groups": "Mythic",
		"-description": "Your mythic power gives you additional uses of channel energy each day.",
		"Prerequisites": "Extra Channel, channel energy class feature.",
		"Benefit": [ "You can channel energy an additional two times per day. Additionally, if you have no uses of channel energy remaining, you may expend two uses of mythic power to use your channel energy ability." ]
	},
	{
		"-id": "Mythic Extra Ki",
		"-title": "Mythic Extra Ki",
		"-groups": "Mythic",
		"-description": "Your mythic power gives you additional points in your ki pool.",
		"Prerequisites": "Extra Ki, ki pool class feature.",
		"Benefit": [ "Your ki pool increases by 3. Additionally, if your ki pool is empty, as a swift action you may expend two uses of mythic power to regain one ki point." ],
		"Special": [ "Unlike Extra Ki, you cannot take Mythic Extra Ki more than once." ]
	},
	{
		"-id": "Mythic Extra Lay On Hands",
		"-title": "Mythic Extra Lay On Hands",
		"-groups": "Mythic",
		"-description": "Your mythic power gives you additional uses of lay on hands each day.",
		"Prerequisites": "Extra Lay On Hands, lay on hands class feature.",
		"Benefit": [ "You can lay on hands an additional three times per day. Additionally if you have no uses of lay on hands remaining, you may expend two uses of mythic power to use your lay on hands ability." ],
		"Special": [ "Unlike Extra Lay On Hands, you cannot take Mythic Extra Lay On Hands more than once." ]
	},
	{
		"-id": "Mythic Extra Mercy",
		"-title": "Mythic Extra Mercy",
		"-groups": "Mythic",
		"-description": "Your mythic power gives you an additional mercy you can select each day.",
		"Prerequisites": "Extra Mercy, lay on hands class feature, mercy class feature.",
		"Benefit": [ "Each day when you regain uses of your daily abilities, you may select one additional mercy you meet the prerequisites for. As a swift action, you may expend two uses of mythic power to change this mercy for a different mercy you meet the prerequisites for, which you retain until you regain your daily abilities or change it again." ],
		"Special": [ "Unlike Extra Mercy, you cannot take Mythic Extra Mercy more than once." ]
	},
	{
		"-id": "Mythic Extra Mythic Power",
		"-title": "Mythic Extra Mythic Power",
		"-groups": "Mythic",
		"-description": "You can store more mythic power than your tier would normally allow.",
		"Benefit": [ "You gain two extra uses of mythic power each day." ]
	},
	{
		"-id": "Mythic Extra Performance",
		"-title": "Mythic Extra Performance",
		"-groups": "Mythic",
		"-description": "Your mythic power gives you additional rounds of bardic performance each day.",
		"Prerequisites": "Extra Performance, bardic performance class feature.",
		"Benefit": [ "You can use your bardic performance for 8 additional rounds per day. Additionally, as a swift action you can expend one use of mythic power to regain 2 rounds of bardic performance (not to exceed your maximum rounds of bardic performance for the day)." ],
		"Special": [ "Unlike Extra Performance, you cannot take Mythic Extra Performance more than once." ]
	},
	{
		"-id": "Mythic Extra Rage",
		"-title": "Mythic Extra Rage",
		"-groups": "Mythic",
		"-description": "Your mythic power gives you additional rounds of rage each day.",
		"Prerequisites": "Extra Rage, rage class feature.",
		"Benefit": [ "You can use your rage for 8 additional rounds per day. Additionally, as a swift action you can expend one use of mythic power to regain 2 rounds of rage (not to exceed your maximum rounds of rage for the day)." ],
		"Special": [ "Unlike Extra Rage, you cannot take Mythic Extra Rage more than once." ]
	},
	{
		"-id": "Mythic Far Shot",
		"-title": "Mythic Far Shot",
		"-groups": "Mythic",
		"-description": "You make long-ranged attacks with remarkable accuracy.",
		"Prerequisites": "Far Shot.",
		"Benefit": [ "As a swift action, you can expend one use of mythic power to ignore all range increment penalties for your ranged attacks until the end of your turn." ]
	},
	{
		"-id": "Mythic Fire Music",
		"-title": "Mythic Fire Music",
		"-groups": "Mythic",
		"-description": "You masterfully weave the ancient melodies of fire into your spells.",
		"Prerequisites": "Fire Music.",
		"Benefit": [
			"When you use Fire Music to change any of the damage dealt by a bard spell to fire damage, that damage ignores fire resistance up to your tier.",
			"If you cast summon monster as a bard spell and choose to give the summoned creature a fiery appearance, increase its fire resistance by 5 (adding to the resistance already granted by Fire Music) and add 1d4 points of fire damage to all of its natural attacks instead of the +1 fire damage normally granted by Fire Music. Creatures with the fire subtype also gain these benefits."
		]
	},
	{
		"-id": "Mythic Forge Ring",
		"-title": "Mythic Forge Ring",
		"-groups": "Mythic",
		"-description": "You have mastered the art of forging magic rings, and can even imbue them with a portion of your essence.",
		"Prerequisites": "Forge Ring, caster level 7th, 2nd mythic tier.",
		"Benefit": [
			"At the beginning of each day when you regain your uses of mythic power, you can expend one use of mythic power to accomplish eight hours of work on one magic ring you are forging. You can only do this once per day on each ring you are forging, though you may also add an actual eight-hour work day toward the forging of such an item. Unlike normal magic item crafting, work accomplished by expending a use of mythic power does not require any special work space or quiet (though the cost of making magic items created this way is normal).",
			"When you successfully forge a magic ring, you may choose to imbue it with one spell, spell-like ability, or supernatural ability you possess. You cannot use this ability unless you are wearing the ring, but when you are wearing it you may either use the ability one more time per day (if it has limited uses per day), or cast it one without having it count against your spells/day (for spells or spell-like abilities), have your effective level be considered 4 levels higher for determining the abilities effects (for abilities with level-dependent effects), or have its save DC increased by +1 (for abilities with a save DC). If the ability qualifies for more than one of these benefits, you may select which it benefits from at the beginning of each day when you regain your pool of mythic power.",
			"For every 3 full mythic tiers you have, you may imbue another spell, spell-like ability, or supernatural ability you possess into such a ring. Rings with your powers imbued into them are treated as minor artifacts for purposes of destroying them. A ring with 4 or more abilities imbued in it is treated as a full artifact, and can only be destroyed by a specific set of circumstances selected by the GM. You may only use the spell or ability imbued in such a ring while the ring is in your possession. When the ring is on your possession, you also gain one use of mythic power per day that can only be used in regards to the imbued spell or ability (any mythic ability that applies to the spell or ability can be fueled with this use of mythic power). If a ring imbued with powers of yours is destroyed, you lose the imbued spell or ability permanently – only a miracle, wish, or similar power can restore it to you.",
			"When a ring imbued with powers of yours is not in your possession, once per day you may meditate for one hour to gain a sense of how to reach it. This acts as a find the path spell, except it allows you to know the shortest, most direct physical route to your ring, rather than to a location."
		]
	},
	{
		"-id": "Mythic Furious Focus",
		"-title": "Mythic Furious Focus",
		"-groups": "Mythic",
		"-description": "Your attacks create a rhythmic barrage that doesn't sacrifice precision for force.",
		"Prerequisites": "Furious Focus.",
		"Benefit": [ "When you are using Furious Focus, you don't take Power Attack's penalty on attack rolls that are made as attacks of opportunity. As a free action, you can expend one use of mythic power to negate Power Attack's penalty on all melee attacks you make for 1 round while using this feat." ]
	},
	{
		"-id": "Mythic Gorgon's Fist",
		"-title": "Mythic Gorgon's Fist",
		"-groups": "Mythic",
		"-description": "Your strikes debilitate and disorient your foes.",
		"Prerequisites": "Gorgon's Fist.",
		"Benefit": [ "When you hit a creature while using Gorgon's Fist, if the target fails its Fortitude saving throw, it is dazed for 1 round instead of staggered. You can expend one use of mythic power when you hit with a Gorgon's Fist attack, but before the saving throw is attempted, to increase its DC by half your tier." ]
	},
	{
		"-id": "Mythic Greater Disarm",
		"-title": "Mythic Greater Disarm",
		"-groups": "Mythic",
		"-description": "You can disarm a foe with such precision as to place its weapons in the hands of allies.",
		"Prerequisites": "Combat Expertise, Greater Disarm, Improved Disarm, base attack bonus +6, Int 13.",
		"Benefit": [ "When you disarm a foe, as a free action you can choose to have the item you disarm be in your hand (if you have a free hand), in the hand of any ally within 15 feet who has a free hand, or tucked into a belt, bag, or haversack in your possession." ]
	},
	{
		"-id": "Mythic Greater Feint",
		"-title": "Mythic Greater Feint",
		"-groups": "Mythic",
		"-description": "Your ability to confuse a foe in combat is legendary.",
		"Prerequisites": "Combat Expertise, Greater Feint, Improved Feint, base attack bonus +6, Int 13.",
		"Benefit": [
			"When you successfully feint a foe, in addition to losing his Dexterity to AC against every attack you make until the beginning of your next turn, he also loses it against the first attack made by each creature that attacks him before the beginning of your next turn.",
			"Additionally, the target is so distracted that until the beginning of your next turn creatures that do not attack or interact with the target may make stealth checks to escape his attention, even if they are in bright light or in his direct line of sight."
		]
	},
	{
		"-id": "Mythic Greater Trip",
		"-title": "Mythic Greater Trip",
		"-groups": "Mythic",
		"-description": "You can drive foes to land on the ground in uncoordinated heaps.",
		"Prerequisites": "Combat Expertise, Greater Trip, Improved Trip, base attack bonus +6, Int 13.",
		"Benefit": [ "When you successfully trip an opponent, the opponent is flat-footed for the attacks of opportunity provoked as a result of being tripped." ]
	},
	{
		"-id": "Mythic Greater Vital Strike",
		"-title": "Mythic Greater Vital Strike",
		"-groups": "Mythic",
		"-description": "You can deliver blows that shatter mountains and cut adamantine.",
		"Prerequisites": "Greater Vital Strike, Improved Vital Strike, Mythic Improved Vital Strike, Mythic Vital Strike, Vital Strike, base attack bonus +16, 10th mythic tier.",
		"Benefit": [ "Whenever you use Vital Strike, Improved Vital Strike, or Greater Vital Strike, your attack ignores all damage reduction, energy resistance, and hardness your target possesses." ]
	},
	{
		"-id": "Mythic Guided Hand",
		"-title": "Mythic Guided Hand",
		"-groups": "Mythic",
		"-description": "Attacks made with your deity's favored weapon are divinely inspired.",
		"Prerequisites": "Guided Hand.",
		"Benefit": [ "When making attacks with your deity's favored weapon, you can add your Wisdom modifier instead of your Strength or Dexterity modifier on damage rolls." ]
	},
	{
		"-id": "Mythic Heighten Spell",
		"-title": "Mythic Heighten Spell",
		"-groups": "Metamagic, Mythic",
		"-description": "Your metamagic spells are always more potent.",
		"Prerequisites": "Heighten Spell, 2nd mythic tier.",
		"Benefit": [ "When you apply metamagic feats to a spell, the effective level of the spell is increased to be equal to the level of the spell slot used to prepare or cast it. All effects dependent on spell level (such as saving throw DCs and ability to penetrate a lesser globe of invulnerability) are calculated according to the heightened level." ]
	},
	{
		"-id": "Mythic Heroic Recovery",
		"-title": "Mythic Heroic Recovery",
		"-groups": "Mythic",
		"-description": "You can shrug off the effects of harmful conditions after they've taken effect.",
		"Prerequisites": "Heroic Recovery.",
		"Benefit": [
			"As a swift action, you can expend one use of mythic power to use Heroic Recovery additional times.",
			"Whenever you do, add your tier to the result of the Fortitude save."
		]
	},
	{
		"-id": "Mythic Improved Channel",
		"-title": "Mythic Improved Channel",
		"-groups": "Mythic",
		"-description": "As a divine conduit for energy, you're unmatched.",
		"Prerequisites": "Improved Channel.",
		"Benefit": [ "Non-mythic creatures that take damage from your channel energy must roll their saving throws twice and take the lower result." ]
	},
	{
		"-id": "Mythic Improved Critical",
		"-title": "Mythic Improved Critical",
		"-groups": "Mythic",
		"-description": "Your critical strikes with your chosen weapon are deadlier than most.",
		"Prerequisites": "Improved Critical, base attack bonus +8.",
		"Benefit": [ "Your critical multiplier with your chosen weapon is increased by 1 (to a maximum of ×6)." ],
		"Special": [ "You can gain this feat multiple times. The effects do not stack. Each time you take this feat, it applies to a different non-mythic Improved Critical feat." ]
	},
	{
		"-id": "Mythic Improved Disarm",
		"-title": "Mythic Improved Disarm",
		"-groups": "Mythic",
		"-description": "You're expert at knocking your enemies' weapons away.",
		"Prerequisites": "Improved Disarm.",
		"Benefit": [
			"You gain a bonus equal to half your tier on checks to disarm, and to your CMD when an opponent tries to disarm you. These bonuses stack with those granted by Improved Disarm.",
			"Furthermore, you can make an attack of opportunity against any creature that attempts to disarm you, unless it also has this feat."
		]
	},
	{
		"-id": "Mythic Improved Familiar",
		"-title": "Mythic Improved Familiar",
		"-groups": "Mythic",
		"-description": "Your familiar gains some of your incredible resiliency and insight.",
		"Prerequisites": "Improved Familiar.",
		"Benefit": [
			"For every 3 tiers you possess, your familiar gains a +2 bonus to an ability score of your choice.",
			"These bonuses stack. Your familiar adds your tier to its natural armor bonus and to its spell resistance (if it has spell resistance)."
		]
	},
	{
		"-id": "Mythic Improved Feint",
		"-title": "Mythic Improved Feint",
		"-groups": "Mythic",
		"-description": "You can draw a foe out of position with a twitch of your eyes.",
		"Prerequisites": "Combat Expertise, Improved Feint, Int 13.",
		"Benefit": [ "You can feint a foe as a swift action." ]
	},
	{
		"-id": "Mythic Improved Great Fortitude",
		"-title": "Mythic Improved Great Fortitude",
		"-groups": "Mythic",
		"-description": "You can draw upon a mythic reserve to resist nearly any disease, poison, or other grievous harm.",
		"Prerequisites": "Great Fortitude, Improved Great Fortitude, Mythic Great Fortitude.",
		"Benefit": [ "Once per day, when you fail a Fortitude save, you may choose to replace your saving throw result with 20 + your total Fortitude save bonus (as if you had rolled a 20 on the d20 roll for your Fortitude save, though this does not count as an automatic success). You must make this decision immediately after discovering your initial Fortitude save failed. This benefit is in addition to (does not replace) the normal benefit of Improved Great Fortitude." ]
	},
	{
		"-id": "Mythic Improved Initiative",
		"-title": "Mythic Improved Initiative",
		"-groups": "Mythic",
		"-description": "You leap into the fray with speed and confidence.",
		"Prerequisites": "Improved Initiative.",
		"Benefit": [ "The bonus on initiative checks granted by Improved Initiative increases by an amount equal to your tier. This bonus stacks with the bonus from Improved Initiative. In addition, instead of rolling initiative, you can expend one use of mythic power to treat your roll as a natural 20." ]
	},
	{
		"-id": "Mythic Improved Iron Will",
		"-title": "Mythic Improved Iron Will",
		"-groups": "Mythic",
		"-description": "Your legendary clarity of thought allows you to resist nearly any mental attack.",
		"Prerequisites": "Improved Iron Will, Iron Will, Mythic Great Iron Will.",
		"Benefit": [ "Once per day, when you fail a Will save, you may choose to replace your saving throw result with 20 + your total Will save bonus (as if you had rolled a 20 on the d20 roll for your Will save, though this does not count as an automatic success). You must make this decision immediately after discovering your initial Will save failed. This benefit is in addition to (does not replace) the normal benefit of Improved Iron Will." ]
	},
	{
		"-id": "Mythic Improved Lightning Reflexes",
		"-title": "Mythic Improved Lightning Reflexes",
		"-groups": "Mythic",
		"-description": "Your legendary speed allows you to avoid nearly any area effect.",
		"Prerequisites": "Improved Lightning Reflexes, Lightning Reflexes, Mythic Lightning Reflexes.",
		"Benefit": [ "Once per day, when you fail a Reflex save, you may choose to replace your saving throw result with 20 + your total Reflex save bonus (as if you had rolled a 20 on the d20 roll for your Reflex save, though this does not count as an automatic success). You must make this decision immediately after discovering your initial Reflex save failed. This benefit is in addition to (does not replace) the normal benefit of Improved Lightning Reflexes." ]
	},
	{
		"-id": "Mythic Improved Precise Shot",
		"-title": "Mythic Improved Precise Shot",
		"-groups": "Mythic",
		"-description": "Your prowess with ranged attacks is legendary.",
		"Prerequisites": "Dex 19, Improved Precise Shot, Mythic Precise Shot, Point-Blank Shot, Precise Shot, base attack bonus +11, 5th mythic tier.",
		"Benefit": [ "When you make a ranged attack, you automatically hit your target (regardless of its AC) on a natural roll of 17 or better (the d20 roll shows a 17, 18, 19, or 20). This is treated as if you had rolled a natural 20 on the attack, although your attack is not a critical threat unless the die roll actually rolls within your attack's threat range." ]
	},
	{
		"-id": "Mythic Improved Reposition",
		"-title": "Mythic Improved Reposition",
		"-groups": "Mythic",
		"-description": "You put your foes right where you want them.",
		"Prerequisites": "Improved Reposition.",
		"Benefit": [
			"You gain a bonus equal to half your tier on checks to attempt a reposition combat maneuver, and to your CMD when an opponent attempts to perform a reposition combat maneuver against you. These bonuses stack with those granted by Improved Reposition.",
			"Furthermore, you can make an attack of opportunity against any creature that attempts to reposition you, unless it also has this feat."
		]
	},
	{
		"-id": "Mythic Improved Shield Bash",
		"-title": "Mythic Improved Shield Bash",
		"-groups": "Mythic",
		"-description": "You use your shield for offense almost as much as defense.",
		"Prerequisites": "Improved Shield Bash, Shield Proficiency, 2nd mythic tier.",
		"Benefit": [ "You can make a shield bash attack as a swift action." ]
	},
	{
		"-id": "Mythic Improved Stonecunning",
		"-title": "Mythic Improved Stonecunning",
		"-groups": "Mythic",
		"-description": "If you listen close, you can hear the secrets of stone.",
		"Prerequisites": "Improved Stonecunning.",
		"Benefit": [ "You gain stone tell as a spell-like ability usable once per day with a caster level equal to twice your tier." ]
	},
	{
		"-id": "Mythic Improved Trip",
		"-title": "Mythic Improved Trip",
		"-groups": "Mythic",
		"-description": "You're expert at knocking your foes down.",
		"Prerequisites": "Improved Trip.",
		"Benefit": [
			"You gain a bonus equal to half your tier on checks to trip, and to your CMD when an opponent tries to trip you. These bonuses stack with those granted by Improved Trip.",
			"Furthermore, you can make an attack of opportunity against any creature that attempts to trip you, unless it also has this feat."
		]
	},
	{
		"-id": "Mythic Improved Two-Weapon Fighting",
		"-title": "Mythic Improved Two-Weapon Fighting",
		"-groups": "Mythic",
		"-description": "You strike with two weapons as easily as with one.",
		"Prerequisites": "Dex 17, Improved Two-Weapon Fighting, Mythic Two-Weapon Fighting, Two-Weapon Fighting, base attack bonus +6, 5th mythic tier.",
		"Benefit": [ "As a standard action, you may make one attack with your primary weapon and one with your off-hand weapon. When you make an attack of opportunity, if your primary weapon hits you may also make an attack with your secondary weapon as a free action." ]
	},
	{
		"-id": "Mythic Improved Vital Strike",
		"-title": "Mythic Improved Vital Strike",
		"-groups": "Mythic",
		"-description": "You can deliver blows that shatter bone and liquefy internal organs.",
		"Prerequisites": "Improved Vital Strike, Mythic Vital Strike, Vital Strike, base attack bonus +11, 5th mythic tier.",
		"Benefit": [ "Whenever you use Vital Strike, Improved Vital Strike, or Greater Vital Strike, multiply all damage (even damage from sources that wouldn't normally be multiplied on a critical hit) by the number of weapon damage dice you roll for that feat." ]
	},
	{
		"-id": "Mythic Improvised Weapon Mastery",
		"-title": "Mythic Improvised Weapon Mastery",
		"-groups": "Mythic",
		"-description": "Everything is a deadly weapon in your hands.",
		"Prerequisites": "Catch Off-Guard or Throw Anything, Improvised Weapon Mastery, base attack bonus +8.",
		"Benefit": [ "When using a one- handed improvised weapon, you may always choose to treat it as a light weapon. You also treat any improvised melee weapon as having any two of the following special weapon features (decided by you at the beginning of each turn before you take any other actions): blocking, deadly, disarm, distracting, grapple, monk, nonlethal, performance, sunder, trip. If using a 2-handed improvised melee weapon you may also select from the brace, double, or reach special weapon features. When using an improvised ranged weapon, treat it as having a 40 ft. range increment." ]
	},
	{
		"-id": "Mythic Intimidating Prowess",
		"-title": "Mythic Intimidating Prowess",
		"-groups": "Mythic",
		"-description": "Your mythic stature makes others uneasy.",
		"Prerequisites": "Intimidating Prowess.",
		"Benefit": [
			"You gain a bonus on Intimidate checks equal to your tier against non-mythic creatures, or half your tier against mythic creatures. If you also have the Persuasive (mythic) feat, you can expend one use of mythic power to treat the Intimidate check as if you had rolled a natural 20.",
			"You must decide to use this ability before the roll is made."
		]
	},
	{
		"-id": "Mythic Knockout Artist",
		"-title": "Mythic Knockout Artist",
		"-groups": "Mythic",
		"-description": "Your knockout punches are truly mighty.",
		"Prerequisites": "Knockout Artist.",
		"Benefit": [ "When you use your unarmed strike to deal non-lethal damage and sneak attack damage to an opponent, roll d8s for each sneak attack die instead of d6s." ]
	},
	{
		"-id": "Mythic Leadership",
		"-title": "Mythic Leadership",
		"-groups": "Mythic",
		"-description": "Even those who follow you are mythic.",
		"Prerequisites": "Leadership, character level 7, 2nd mythic tier.",
		"Benefit": [
			"Add your mythic tier to your leadership score.",
			"The cohort you gain from the Leadership feat is a mythic character with a mythic tier equal to 1/2 your own mythic tier. Additionally if your cohort dies you may replace him in 24 hours by calling on the source of your mythic power. However, doing so causes you to have 1 fewer uses of mythic power per day for the next 30 days. If you are of the 5th or greater mythic tier, your 10 highest level followers are also 1st mythic tier."
		]
	},
	{
		"-id": "Mythic Lightning Stance",
		"-title": "Mythic Lightning Stance",
		"-groups": "Mythic",
		"-description": "Your movements cannot be predicted.",
		"Prerequisites": "Dex 17, Dodge, Lightning Stance, Mythic Wind Stance, Wind Stance, base attack bonus +11, 3rd mythic tier.",
		"Benefit": [ "If you move more than 5 feet, you gain 50% concealment for 1 round. If you expend one use of mythic power, you gain this concealment for one minute rather than 1 round." ]
	},
	{
		"-id": "Mythic Lucky Halfling",
		"-title": "Mythic Lucky Halfling",
		"-groups": "Mythic",
		"-description": "You share your mythic luck with those around you.",
		"Prerequisites": "Lucky Halfling.",
		"Benefit": [ "When you use Lucky Halfling, add your tier as a bonus on the saving throw. You can expend one use of mythic power when an ally uses your save but still suffers an effect on a successful saving throw. If you do, that ally suffers no effect on the successful saving throw." ]
	},
	{
		"-id": "Mythic Lunge",
		"-title": "Mythic Lunge",
		"-groups": "Mythic",
		"-description": "Your reaching strikes aid your defenses against those you hit.",
		"Prerequisites": "Lunge.",
		"Benefit": [ "Whenever you use Lunge and hit a creature with the melee attack, you no longer take a –2 penalty to AC against that creature. You can expend one use of mythic power when you use Lunge to negate the –2 penalty to AC whether you hit or miss, and gain a +2 bonus on attacks of opportunity you make while Lunge is in effect." ]
	},
	{
		"-id": "Mythic Manyshot",
		"-title": "Mythic Manyshot",
		"-groups": "Mythic",
		"-description": "You can fire a barrage of arrows at your target with very little effort.",
		"Prerequisites": "Manyshot.",
		"Benefit": [ "When making a full-attack action with a bow and using Manyshot, you fire two arrows with both your first and second attacks, instead of just your first attack." ]
	},
	{
		"-id": "Mythic Martial Weapon Proficiency",
		"-title": "Mythic Martial Weapon Proficiency",
		"-groups": "Mythic",
		"-description": "Your prowess with a specific martial weapon is beyond compare.",
		"Prerequisites": "Martial Weapon Proficiency, base attack bonus +6.",
		"Benefit": [
			"Select one martial weapon you are proficient with. When making additional attacks as a result of a high base attack bonus, each attack after the first has its attack bonus reduced by 4, rather than by 5. This does not change the number of additional attacks you gain, only the attack bonus used by each additional attack.",
			"For example, Jacinth is a 14th level fighter proficient with the longsword who has taken Mythic Martial Weapon Proficiency with that weapon. Normally he would receive three attacks as a result of his base attack bonus, at +14/+9/+4. However as a result of this feat, his three attacks are instead at +14/+10/+6."
		]
	},
	{
		"-id": "Mythic Master Craftsman",
		"-title": "Mythic Master Craftsman",
		"-groups": "Mythic",
		"-description": "Your skill with a craft is like magic.",
		"Prerequisites": "Master Craftsman, 5 ranks in any Craft or Profession skill.",
		"Benefit": [ "Select one spellcasting class. For purposes of using or creating magic items, you are considered to know all the spells on that classes' spell list, up to a spell level equal to half your ranks in the Craft or Profession skill you selected with the Master Craftsman feat." ]
	},
	{
		"-id": "Mythic Maximize Spell",
		"-title": "Mythic Maximize Spell",
		"-groups": "Metamagic, Mythic",
		"-description": "Your maximum spell power is 'more than maximum.'",
		"Prerequisites": "Maximize Spell, 7th mythic tier.",
		"Benefit": [
			"When you cast a spell augmented with Maximize Spell, all variable, numeric effects of the spell are treated as 150% of their maximum.",
			"Alternatively, you may expend two uses of mythic power to cast a spell as a maximized spell (gaining only the normal benefits of a maximized spell, rather than the increased benefits outlined above) without preparing it as maximized in advance, taking extra casting time, or increasing the level of spell slot it uses."
		],
		"Normal": "All variable, numeric effects of a maximized spell are automatically at their highest value."
	},
	{
		"-id": "Mythic Maximize Surge",
		"-title": "Mythic Maximize Surge",
		"-groups": "Mythic",
		"-description": "In times of dire need, you can burn your mythic power to ensure success.",
		"Prerequisites": "6th mythic tier.",
		"Benefit": [ "Once per day when you surge, you can expend two uses of mythic power to treat your surge die as though it rolled the maximum result." ],
		"Special": [ "You can take this feat multiple times. Each time you do, you gain an extra use of this feat per day." ]
	},
	{
		"-id": "Mythic Missile Shield",
		"-title": "Mythic Missile Shield",
		"-groups": "Mythic",
		"-description": "Your remarkable awareness allows you to deflect multiple ranged attacks and even ray spells.",
		"Prerequisites": "Missile Shield.",
		"Benefit": [ "When using Missile Shield, you can deflect an additional number of ranged attacks per round equal to half your tier. You can expend one use of mythic power as an immediate action to deflect a single ray from a ray spell or effect targeting you." ]
	},
	{
		"-id": "Mythic Monastic Legacy",
		"-title": "Mythic Monastic Legacy",
		"-groups": "Mythic",
		"-description": "Every new experience carries you another step further along your path to enlightenment.",
		"Prerequisites": "Monastic Legacy.",
		"Benefit": [ "Add half the levels you have in classes other than monk to your monk level to determine your effective monk level for your AC bonus. As a free action, you can expend one use of mythic power to add half your tier to your effective monk level to determine your base unarmed strike damage and AC bonus until the start of your next turn." ]
	},
	{
		"-id": "Mythic Mounted Combat",
		"-title": "Mythic Mounted Combat",
		"-groups": "Mythic",
		"-description": "Your ability to maneuver a mount through the rigors of combat is nearly unparalleled.",
		"Prerequisites": "Mounted Combat.",
		"Benefit": [ "You can negate an additional number of hits against your mount per round equal to your tier. Once per round as an immediate action, you can expend one use of mythic power to substitute a Ride check for a single Reflex saving throw your mount must make." ]
	},
	{
		"-id": "Mythic Mythic Companion",
		"-title": "Mythic Mythic Companion",
		"-groups": "Mythic",
		"-description": "Despite your non-mythic nature, you're a vital part of the greater mythic world.",
		"Prerequisites": "You must be non-mythic.",
		"Benefit": [ "You're considered a mythic creature for the purposes of determining how mythic spells and effects affect you. If you ever become mythic, you gain a +1 bonus on all saves against mythic spells and effects." ]
	},
	{
		"-id": "Mythic Natural Spell",
		"-title": "Mythic Natural Spell",
		"-groups": "Mythic",
		"-description": "You can speak and use some magic items when you use wild shape.",
		"Prerequisites": "Natural Spell.",
		"Benefit": [ "When you're using wild shape, you can use spell completion and spell trigger magic items that were on your person when you changed form. You don't need to physically manipulate the items when you use them while using wild shape. Furthermore, you can speak normally when using wild shape." ]
	},
	{
		"-id": "Mythic Paragon",
		"-title": "Mythic Paragon",
		"-groups": "Mythic",
		"-description": "Your mythic power is even more potent than that of most other mythic beings.",
		"Benefit": [ "Your tier is considered 2 higher for determining the potency of mythic abilities, feats, and spells. This doesn't grant you access to mythic abilities or greater versions of mythic spells at a lower tier than you would normally need to be to get them, nor does it grant you additional uses of mythic power or adjust the dice you roll for your surge." ]
	},
	{
		"-id": "Mythic Penetrating Strike",
		"-title": "Mythic Penetrating Strike",
		"-groups": "Mythic",
		"-description": "You know just how to strike to bypass even the most heavily armored foe's defenses.",
		"Prerequisites": "Penetrating Strike.",
		"Benefit": [ "When using Penetrating Strike or Greater Penetrating Strike, you can ignore an additional point of damage reduction for every 3 tiers you possess. Additionally, the effects apply to damage reduction without a type (such as DR10/—)." ]
	},
	{
		"-id": "Mythic Pinpoint Targeting",
		"-title": "Mythic Pinpoint Targeting",
		"-groups": "Mythic",
		"-description": "Your attacks can home in on your opponent's weak spot and ignore many defenses.",
		"Prerequisites": "Pinpoint Targeting.",
		"Benefit": [ "You can use this feat even if you move this round, but only if the distance you move is equal to or less than 5 feet per tier." ]
	},
	{
		"-id": "Mythic Potent Surge",
		"-title": "Mythic Potent Surge",
		"-groups": "Mythic",
		"-description": "Your surge is more potent.",
		"Benefit": [ "Whenever you use your surge ability, add 1 to your surge result." ]
	},
	{
		"-id": "Mythic Powerful Shape",
		"-title": "Mythic Powerful Shape",
		"-groups": "Mythic",
		"-description": "The forms you take in wild shape tower over their natural counterparts.",
		"Prerequisites": "Powerful Shape.",
		"Benefit": [
			"You can apply the giant simple template (quick rules version) to any form you take with wild shape. This replaces the benefit from Powerful Shape.",
			"As a free action, you can expend one use of mythic power to combine the benefit from this feat with the benefit from non-mythic Powerful Shape for a number of rounds equal to your tier."
		]
	},
	{
		"-id": "Mythic Precise shot",
		"-title": "Mythic Precise shot",
		"-groups": "Mythic",
		"-description": "You can shoot wasps out of a swarm, or even hit targets on the ethereal plane.",
		"Prerequisites": "Point-Blank Shot, Precise Shot.",
		"Benefit": [ "Your ranged attacks can damage swarms and ignore miss chances from spells or magic effects (such as blink, blur, and mirror images). If you expend a use of mythic power, for one minute your ranged attacks also affect ethereal and insubstantial foes." ]
	},
	{
		"-id": "Mythic Quick Draw",
		"-title": "Mythic Quick Draw",
		"-groups": "Mythic",
		"-description": "You can retrieve any item quickly, not just weapons.",
		"Prerequisites": "Quick Draw.",
		"Benefit": [ "You can use Quick Draw to draw items of any kind, not just weapons, provided they are stored or concealed on your person. As a move action, you can expend one use of mythic power to retrieve up to two hidden items. You must have two hands free to do so." ]
	},
	{
		"-id": "Mythic Quicken Spell",
		"-title": "Mythic Quicken Spell",
		"-groups": "Metamagic, Mythic",
		"-description": "Casting a spell can be nearly effortless for you.",
		"Prerequisites": "Quicken Spell, 10th mythic tier.",
		"Benefit": [
			"You can prepare any spell as a quickened spell, regardless of its normal casting time, allowing you to cast it as a swift action. If a target provokes an attack of opportunity from you, you can target it with a quickened spell as your attack of opportunity. Only quickened spells with a specific number of targets (rather than effect or area) can be cast as an attack of opportunity, and only the creature that provoked the attack is targeted by the spell (regardless of how many creatures the spell normally targets).",
			"Alternatively, you may expend two uses of mythic power to cast a spell as a quickened spell (gaining only the normal benefits of a quickened spell, rather than the increased benefits outlined above) without preparing it as quickened in advance or increasing the level of spell slot it uses."
		],
		"Normal": "A quickened spell that normally has a casting time of 1 standard action can instead be cast as a swift action."
	},
	{
		"-id": "Mythic Rapid Reload",
		"-title": "Mythic Rapid Reload",
		"-groups": "Mythic",
		"-description": "You can reload any type of weapon with astounding speed.",
		"Prerequisites": "Rapid Reload.",
		"Benefit": [ "You gain the benefits of Rapid Reload with all crossbows and firearms, not just the one you originally chose when you gained that feat. As a swift action, you can expend one use of mythic power to gain the ability to reload crossbows and firearms without provoking attacks of opportunity for 1 minute." ]
	},
	{
		"-id": "Mythic Rhetorical Flourish",
		"-title": "Mythic Rhetorical Flourish",
		"-groups": "Mythic",
		"-description": "You're supremely skilled at using verbal misdirection and finesse to influence others.",
		"Prerequisites": "Rhetorical Flourish.",
		"Benefit": [
			"When you successfully use Rhetorical Flourish against a non-mythic creature, the bonus on your Diplomacy check increases by your tier. If the target is a mythic creature, you instead increase the bonus by half your tier.",
			"You can expend one use of mythic power to reroll a single failed Bluff check. You must take the new result even if it is lower."
		]
	},
	{
		"-id": "Mythic Run",
		"-title": "Mythic Run",
		"-groups": "Mythic",
		"-description": "You run with preternatural speed and endurance.",
		"Prerequisites": "Run.",
		"Benefit": [
			"When running, you move seven times your normal speed if wearing medium, light, or no armor and carrying no more than a medium load, or six times your speed if wearing heavy armor or carrying a heavy load. When making a jump after a running start, you gain an additional bonus equal to your tier + 4 on your Acrobatics check.",
			"You can run normally for a number of rounds equal to your Constitution score plus your tier, but after that you must succeed at Constitution checks to continue running."
		]
	},
	{
		"-id": "Mythic Scorpion Style",
		"-title": "Mythic Scorpion Style",
		"-groups": "Mythic",
		"-description": "Your unarmed strikes can induce a near-crippling lethargy in your enemies.",
		"Prerequisites": "Scorpion Style.",
		"Benefit": [
			"Whenever you are using Scorpion Style, you add your tier to the number of rounds the target's base land speed is reduced. You can expend one use of mythic power when making your attack to slow your target, as the spell slow, unless it succeeds at a Fortitude save (DC 10 + 1/2 your character level + your Wisdom modifier).",
			"The slowing effect supersedes the normal speed penalty of your Scorpion Strike, but lasts for an equal number of rounds."
		]
	},
	{
		"-id": "Mythic Scribe Scroll",
		"-title": "Mythic Scribe Scroll",
		"-groups": "Mythic",
		"-description": "You can invoke scrolls without even reading them.",
		"Prerequisites": "Scribe Scroll, caster level 1st.",
		"Benefit": [
			"At the beginning of each day when you regain your uses of mythic power, you can expend one use of mythic power to accomplish eight hours of work on one magic scroll you are scribing. You can only do this once per day on each scroll you are scribing, though you may also add an actual eight-hour work day toward the scribing of such an item. Unlike normal magic item crafting, work accomplished by expending a use of mythic power does not require any special work space or quiet (though the cost of making magic items created this way is normal).",
			"Additionally, you can cast a spell from a scroll in your possession without having it in hand. As long as it is on your person, or in containers on your person, you may use a scroll."
		]
	},
	{
		"-id": "Mythic Self-Sufficient",
		"-title": "Mythic Self-Sufficient",
		"-groups": "Mythic",
		"-description": "Independence comes naturally to you, and you have mastered taking care of yourself.",
		"Prerequisites": "Self-Sufficient.",
		"Benefit": [ "The bonus on Heal and Survival skill checks from Self-Sufficient increases by 2. In addition, you can expend one use of mythic power to treat a Heal or Survival check as if you had rolled a natural 20. You must decide to use this ability before making the roll." ]
	},
	{
		"-id": "Mythic Shield Focus",
		"-title": "Mythic Shield Focus",
		"-groups": "Mythic",
		"-description": "You're a master of using your shield for protection.",
		"Prerequisites": "Shield Focus.",
		"Benefit": [ "Add your shield bonus and your shield's enhancement bonus to your touch AC. As an immediate action, you can expend one use of mythic power to add your shield bonus and your shield's enhancement bonus on a Fortitude or Reflex save just before you roll it." ]
	},
	{
		"-id": "Mythic Shield Master",
		"-title": "Mythic Shield Master",
		"-groups": "Mythic",
		"-description": "You punish your foes' failures with a smack from your shield.",
		"Prerequisites": "Improved Shield Bash, Shield Master, Shield Proficiency, Shield Slam, Two-Weapon Fighting, base attack bonus +11.",
		"Benefit": [
			"When you have a shield equipped, if a foe in reach makes an attack against you and misses by 5 or more that foe provokes an attack of opportunity from you. If a foe attempts to make a combat maneuver targeting your shield (such as sunder) and after the maneuver is resolved your shield is still in hand and not broken or destroyed, that foe provokes an attack of opportunity from you. You can only use this attack of opportunity to attack the foe with your shield.",
			"Additionally, you may make a number of additional attacks of opportunity per round depending on what kind of shield you have equipped (buckler = +1 attack of opportunity, small shield = +2 attack of opportunity, large shield = +3 attack of opportunity, tower shield = +1 attack of opportunity). You can only use these attacks of opportunity to attack foes with your shield."
		]
	},
	{
		"-id": "Mythic Shield Proficiency",
		"-title": "Mythic Shield Proficiency",
		"-groups": "Mythic",
		"-description": "You can interpose your shield between yourself and all dangers.",
		"Prerequisites": "Shield Proficiency.",
		"Benefit": [ "Add the AC bonus you gain from your shield to your CMD." ]
	},
	{
		"-id": "Mythic Shot on the Run",
		"-title": "Mythic Shot on the Run",
		"-groups": "Mythic",
		"-description": "With ease, you can snap off two shots while dashing across the battlefield.",
		"Prerequisites": "Shot on the Run, base attack bonus +6.",
		"Benefit": [ "Whenever you use Shot on the Run, you can make two ranged attacks at your highest base attack bonus at any point during your movement, instead of just one." ]
	},
	{
		"-id": "Mythic Sickening Critical",
		"-title": "Mythic Sickening Critical",
		"-groups": "Combat, Mythic",
		"-description": "You can sicken foes with weapon strikes at will.",
		"Prerequisites": "Critical Focus, Sickening Critical, base attack bonus +11, 2nd mythic tier.",
		"Benefit": [
			"Once per round when you hit a foe with an attack, but the attack is not a critical, you may expend one use of mythic power to inflict the effect of the Sickening Critical feat rather than your attack's normal damage.",
			"You may not add the effects of more than one Mythic critical feat to a single attack."
		]
	},
	{
		"-id": "Mythic Silent Spell",
		"-title": "Mythic Silent Spell",
		"-groups": "Metamagic,Mythic",
		"-description": "You can cast spells with near-total secrecy.",
		"Prerequisites": "Silent Spell.",
		"Benefit": [
			"When you cast a spell augmented with Silent Spell, it is not obvious that you cast a spell and difficult to determine the origin point of any visible spell effects. Characters cannot observe that you cast the spell, or make Spellcraft checks to identify it or dispel checks to neutralize it unless they succeed at a Perception check opposed by a special Stealth check made by you (1d20 + Steath or Spellcraft bonus + mythic tier).",
			"Alternatively, you may expend a use of mythic power to cast a spell as a silent spell (gaining only the normal benefits of a silent spell, rather than the increased benefits outlined above) without preparing it as silent in advance, taking extra casting time, or increasing the level of spell slot it uses."
		],
		"Special": [ "A silent spell requires no verbal components." ]
	},
	{
		"-id": "Mythic Simple Weapon Proficiency",
		"-title": "Mythic Simple Weapon Proficiency",
		"-groups": "Mythic",
		"-description": "Your prowess with a specific simple weapon is beyond compare.",
		"Prerequisites": "Simple Weapon Proficiency, base attack bonus +6.",
		"Benefit": [
			"Select one simple weapon you are proficient with. When making additional attacks as a result of a high base attack bonus, each attack after the first has its attack bonus reduced by 4, rather than by 5. This does not change the number of additional attacks you gain, only the attack bonus used by each additional attack.",
			"For example, Thorne is a 19th level cleric proficient with the morningstar who has taken Mythic Simple Weapon Proficiency with that weapon. Normally she would receive three attacks as a result of her base attack bonus, at +14/+9/+4. However as a result of this feat, her three attacks are instead at +14/+10/+6."
		]
	},
	{
		"-id": "Mythic Snatch Arrows",
		"-title": "Mythic Snatch Arrows",
		"-groups": "Mythic",
		"-description": "You can use the weapons you pluck from the air to immediately make melee attacks.",
		"Prerequisites": "Snatch Arrows.",
		"Benefit": [ "When you use Snatch Arrows to catch a thrown weapon that can also be used as a melee weapon, you can make a melee attack with it as an immediate action against a foe within the weapon's melee reach. You can expend one use of mythic power to make this attack without spending an immediate action." ]
	},
	{
		"-id": "Mythic Spell Focus",
		"-title": "Mythic Spell Focus",
		"-groups": "Mythic",
		"-description": "Your magical specialties are particularly effective.",
		"Prerequisites": "Spell Focus.",
		"Benefit": [ "Choose a school of magic you already have Spell Focus in. The bonus to save DCs provided by Spell Focus and Greater Spell Focus for that school increases by 1. You can expend one use of mythic power as part of casting a spell from your chosen school to force any of the spell's targets to roll their saving throws twice, taking the lower result." ],
		"Special": [ "You can gain this feat multiple times. The effects do not stack. Each time you take this feat, it applies to a different non-mythic Spell Focus feat." ]
	},
	{
		"-id": "Mythic Spell Lore",
		"-title": "Mythic Spell Lore",
		"-groups": "Mythic",
		"-description": "You have learned how to unlock the power of your spells, combining them with your mythic power.",
		"Prerequisites": "Ability to cast spells.",
		"Benefit": [ "You can learn a number of mythic spells equal to your tier and can expend mythic power when casting them to enhance the results. To select a mythic spell, you must be able to cast the non-mythic version or have it on your list of spells known. Every time you gain a new tier, you can select an additional mythic spell." ],
		"Special": [ "You can select this feat multiple times. Each time you select this feat, you must select different spells." ]
	},
	{
		"-id": "Mythic Spell Mastery",
		"-title": "Mythic Spell Mastery",
		"-groups": "Mythic",
		"-description": "You're so familiar with certain spells you can prepare them with the greatest of ease.",
		"Prerequisites": "Spell Mastery.",
		"Benefit": [ "You can prepare spells you have selected with Spell Mastery as a full-round action. You must spend the appropriate amount of time preparing other spells you have not mastered. As a full-round action, you can expend one use of mythic power to prepare all your spells that you have selected with Spell Mastery." ]
	},
	{
		"-id": "Mythic Spellbreaker",
		"-title": "Mythic Spellbreaker",
		"-groups": "Mythic",
		"-description": "You're a spellcaster's worst nightmare.",
		"Prerequisites": "Spellbreaker.",
		"Benefit": [
			"Any non-mythic creature you threaten provokes an attack of opportunity from you whenever it uses a spell or spell-like ability, even when casting defensively or casting a quickened spell.",
			"If a non-mythic creature within 30 feet of you uses a spell or spell-like ability, you can expend one use of mythic power to make a ranged attack against that creature as an attack of opportunity (even if the creature wouldn't normally provoke attacks of opportunity). You must have a ranged weapon in hand or have a free hand and the non-mythic Quick Draw feat to use this ability. You can use this ability against a mythic creature by expending two uses of mythic power."
		]
	},
	{
		"-id": "Mythic Spontaneous Metafocus",
		"-title": "Mythic Spontaneous Metafocus",
		"-groups": "Mythic",
		"-description": "You apply metamagic to your spells with greater ease than do other spontaneous casters.",
		"Prerequisites": "Spontaneous Metafocus.",
		"Benefit": [ "You can change which spell your Spontaneous Metafocus feat applies to each morning when you restore your expended spell slots. The spell it applies to can be of any level, but it must be a legal selection for the Spontaneous Metafocus feat." ],
		"Special": [ "You can gain this feat multiple times. The effects do not stack. Each time you take this feat, it applies to a different non-mythic Spontaneous Metafocus feat." ]
	},
	{
		"-id": "Mythic Staggering Critical",
		"-title": "Mythic Staggering Critical",
		"-groups": "Combat, Mythic",
		"-description": "You can stagger foes with a weapon blow at will.",
		"Prerequisites": "Critical Focus, Staggering Critical, base attack bonus +13, 3rd mythic tier.",
		"Benefit": [ "Once per round when you hit a foe with an attack, but the attack is not a critical, you may expend two uses of mythic power to inflict the effect of the Staggering Critical feat rather than your attack's normal damage. You may not add the effects of more than one Mythic critical feat to a single attack." ]
	},
	{
		"-id": "Mythic Stand Still",
		"-title": "Mythic Stand Still",
		"-groups": "Mythic",
		"-description": "None shall pass.",
		"Prerequisites": "Combat Reflexes, Stand Still.",
		"Benefit": [ "When you successfully use the Stand Still feat to make a combat maneuver check to force a foe to stop moving, you may also deal melee damage to that foe with a natural or unarmed attack or a weapon you have in hand." ]
	},
	{
		"-id": "Mythic Stealthy",
		"-title": "Mythic Stealthy",
		"-groups": "Mythic",
		"-description": "Your grace and fluidity are beyond compare.",
		"Prerequisites": "Stealthy.",
		"Benefit": [ "The bonus on Escape Artist and Stealth skill checks from Stealthy increases by 2. In addition, you can expend one use of mythic power to treat an Escape Artist or Stealth check as if you had rolled a natural 20. You must decide to use this ability before making the roll." ]
	},
	{
		"-id": "Mythic Step Up",
		"-title": "Mythic Step Up",
		"-groups": "Mythic",
		"-description": "No one can escape you.",
		"Prerequisites": "Dex 13, Following Step, Step Up, base attack bonus +1.",
		"Benefit": [
			"Whenever an adjacent foe attempts to move away from you, you may move up to your movement rate as an immediate action so long as you end up adjacent to the foe that triggered this ability. If you move more than 1/2 your movement rate, you may only take a move or standard action on your next turn.",
			"If you expend a use of mythic power, you may move up to twice your movement rate to follow an adjacent foe, and still take a full action on your next turn."
		]
	},
	{
		"-id": "Mythic Still Spell",
		"-title": "Mythic Still Spell",
		"-groups": "Metamagic, Mythic",
		"-description": "You can cast spells with total detachment from your body's condition.",
		"Prerequisites": "Still Spell.",
		"Benefit": [
			"When you cast a spell augmented with Still Spell, you do not need to make a concentration check as a result of any physical disruption, including movement (such as riding a horse or being on the deck of a storm-tossed ship), being grappled or pinned, or even being injured while casting.",
			"Alternatively, you may expend a use of mythic power to cast a spell as a still spell (gaining only the normal benefits of a still spell, rather than the increased benefits outlined above) without preparing it as still in advance, taking extra casting time, or increasing the level of spell slot it uses."
		]
	},
	{
		"-id": "Mythic Strong Comeback",
		"-title": "Mythic Strong Comeback",
		"-groups": "Mythic",
		"-description": "You never make the same mistake twice.",
		"Prerequisites": "Strong Comeback.",
		"Benefit": [ "Whenever you're allowed to reroll an ability check, a skill check, or a saving throw, roll two dice and take the higher result, before adding the bonus from Strong Comeback." ]
	},
	{
		"-id": "Mythic Stunning Critical",
		"-title": "Mythic Stunning Critical",
		"-groups": "Critical,Mythic",
		"-description": "You may stun foes with a weapon blow at will.",
		"Prerequisites": "Critical Focus, Stunning Critical, base attack bonus +17, 3rd mythic tier.",
		"Benefit": [
			"Once per round when you hit a foe with an attack, but the attack is not a critical, you may expend two uses of mythic power to inflict the effect of the Stunning Critical feat rather than your attack's normal damage.",
			"You may not add the effects of more than one mythic critical feat to a single attack."
		]
	},
	{
		"-id": "Mythic Throw Anything",
		"-title": "Mythic Throw Anything",
		"-groups": "Mythic",
		"-description": "You're so skilled at throwing weapons that it hardly matters what you throw.",
		"Prerequisites": "Throw Anything.",
		"Benefit": [ "You gain a +2 bonus on attack rolls and damage rolls made using an improvised thrown weapon or splash weapon. This bonus stacks with the bonus from the non-mythic Throw Anything feat. If you miss with a thrown splash weapon, it always lands adjacent to its target regardless of how many range increments it was thrown." ]
	},
	{
		"-id": "Mythic Tiring Critical",
		"-title": "Mythic Tiring Critical",
		"-groups": "Combat, Mythic",
		"-description": "You can tire foes with a weapon blow at will.",
		"Prerequisites": "Critical Focus, Tiring Critical , base attack bonus +13.",
		"Benefit": [
			"Once per round when you hit a foe with an attack, but the attack is not a critical, you may expend one use of mythic power to inflict the effect of the Tiring Critical feat rather than your attack's normal damage.",
			"You may not add the effects of more than one mythic critical feat to a single attack."
		]
	},
	{
		"-id": "Mythic Toughness",
		"-title": "Mythic Toughness",
		"-groups": "Mythic",
		"-description": "You have legendary resilience and durability.",
		"Prerequisites": "Toughness.",
		"Benefit": [ "Toughness provides you twice as many hit points. In addition, when you're below 0 hit points, you gain DR 10/epic. This DR stacks with any other DR/epic you might possess." ]
	},
	{
		"-id": "Mythic Tower Shield Proficiency",
		"-title": "Mythic Tower Shield Proficiency",
		"-groups": "Mythic",
		"-description": "You move a tower shield with stunning ease.",
		"Prerequisites": "Tower Shield Proficiency.",
		"Benefit": [ "You treat a tower shield as having no maximum Dexterity bonus to AC, a -3 armor check penalty, and 20% arcane spell failure. You do not take a -2 penalty to attack rolls when using a tower shield." ],
		"Normal": [ "A tower shield has a +2 maximum Dex bonus to AC, -10 armor check penalty, 50% arcane spell failure, and causes anyone wearing it to take a -2 penalty to attack rolls." ]
	},
	{
		"-id": "Mythic Tripping Staff",
		"-title": "Mythic Tripping Staff",
		"-groups": "Mythic",
		"-description": "Your staff is valuable for attack and defensive balance.",
		"Prerequisites": "Tripping Staff.",
		"Benefit": [ "You add half your tier to CMD against trip maneuvers and on combat maneuver checks to trip with a quarterstaff. When you're wielding a quarterstaff and an opponent you threaten attempts to trip you and fails, it provokes an attack of opportunity from you. You must use your staff for this attack of opportunity." ]
	},
	{
		"-id": "Mythic Two-Fisted Drinker",
		"-title": "Mythic Two-Fisted Drinker",
		"-groups": "Mythic",
		"-description": "You can pound down drinks with amazing verve.",
		"Prerequisites": "Quick Draw.",
		"Benefit": [ "You can draw two potions or other beverages—mundane or magical—from a pouch, bandolier, or similar holder (but not from a backpack) as a move action. As a standard action, you can drink two potions or other beverages. You must have two free hands to use this feat." ]
	},
	{
		"-id": "Mythic Two-Weapon Fighting",
		"-title": "Mythic Two-Weapon Fighting",
		"-groups": "Mythic",
		"-description": "With deft strikes, you gain an advantage over your foes beyond mere damage.",
		"Prerequisites": "Two-Weapon Fighting.",
		"Benefit": [ "As an immediate action, you can expend one use of mythic power to negate the penalties on attack rolls for two-weapon fighting for a number of rounds equal to your tier." ]
	},
	{
		"-id": "Mythic Undead Master",
		"-title": "Mythic Undead Master",
		"-groups": "Mythic",
		"-description": "Through your fearsome mythic nature, you have matchless power over the undead.",
		"Prerequisites": "Undead Master.",
		"Benefit": [ "When you cast animate dead or use the Command Undead feat, add your tier to your caster level when determining the number of Hit Dice of undead you animate. This stacks with the increased caster level of Undead Master. When you cast command undead, your duration is tripled rather than doubled." ]
	},
	{
		"-id": "Mythic Valiant Vault",
		"-title": "Mythic Valiant Vault",
		"-groups": "Mythic",
		"-description": "Your mount can make heroic leaps.",
		"Prerequisites": "Mounted Combat, Ride-By Attack, Ride 5 ranks.",
		"Benefit": [
			"Your mount is always considered to have a running start when using Acrobatics to jump. You can expend one use of mythic power to grant your mount a +10 bonus on an Acrobatics check, or a +20 bonus if the check is made to jump.",
			"When making a mounted charge, you can guide your mount to leap over a foe between your starting position and the target of your charge. You make a Ride check or your mount makes an Acrobatics check (whichever is lower) during the charge, using the rules for the leap task under the Ride skill. If the height you clear with that check exceeds the creature's height, you jump over it and continue your charge on the opposite side. This movement provokes attacks of opportunity. Alternatively, you can vault over your target while making a Ride-By Attack, allowing you to move over or through its space and continue moving on the opposite side of it. If your jump exceeds the target's height, you gain a +1 bonus on the attack roll for higher ground, and if any of your allies threatens the target, you treat the target as flanked for purposes of your Ride-By Attack."
		]
	},
	{
		"-id": "Mythic Voice of the Sibyl",
		"-title": "Mythic Voice of the Sibyl",
		"-groups": "Mythic",
		"-description": "You overpower weaker and more vulnerable minds with your voice alone.",
		"Prerequisites": "Voice of the Sibyl.",
		"Benefit": [ "You gain a +1 bonus on all Bluff, Diplomacy, and Perform (oratory) skill checks for every 3 tiers you possess. This bonus stacks with the bonus from Voice of the Sibyl. If you have 10 or more ranks in at least two of these skills, gain a +2 bonus to the DC of any language-dependent spell you cast." ]
	},
	{
		"-id": "Mythic Weapon Finesse",
		"-title": "Mythic Weapon Finesse",
		"-groups": "Mythic",
		"-description": "You're an expert with weapons that rely on your agility.",
		"Prerequisites": "Weapon Finesse.",
		"Benefit": [ "When using Weapon Finesse, you may also use your Dexterity modifier instead of your Strength modifier on your damage rolls. If you carry a shield, its armor check penalty doesn't apply to either the attack rolls or the damage rolls." ]
	},
	{
		"-id": "Mythic Weapon Specialization",
		"-title": "Mythic Weapon Specialization",
		"-groups": "Mythic",
		"-description": "The damage you deal with your chosen weapon is truly awesome to behold.",
		"Prerequisites": "Weapon Specialization.",
		"Benefit": [ "When using your chosen weapon, you gain a bonus equal to half your tier on damage rolls. This stacks with the bonus from Weapon Specialization and Greater Weapon Specialization." ],
		"Special": [ "If you have taken non-mythic Weapon Specialization multiple times, you must choose which of those feats this enhances. You can take this feat multiple times. The effects do not stack. Each time you take this feat, it applies to a different non-mythic Weapon Specialization feat you have." ]
	},
	{
		"-id": "Mythic Whirlwind Attack",
		"-title": "Mythic Whirlwind Attack",
		"-groups": "Mythic",
		"-description": "You can strike multiple times at every foe within reach.",
		"Prerequisites": "Dex 13, Int 13, Combat Expertise, Dodge, Mobility, Mythic Combat Expertise, Mythic Dodge, Mythic Mobility, Mythic Spring Attack, Spring Attack, Whirlwind Attack, base attack bonus +4, 5th mythic tier.",
		"Benefit": [ "When you use Whirlwind Attack as a full-round action, you may make all your attacks from a full attack action against one foe, and one additional attack against every foe within reach. If you expend two uses of mythic power, you may make all your attacks from a full attack action against every foe within reach." ]
	},
	{
		"-id": "Mythic Widen Spell",
		"-title": "Mythic Widen Spell",
		"-groups": "Metamagic,Mythic",
		"-description": "You can cast spells that cover vast areas.",
		"Prerequisites": "Widen Spell.",
		"Benefit": [
			"When you cast a spell augmented with Widen Spell, any numeric measurements of the spell's area increase by 200%. Only a burst, emanation, or spread-shaped spell can be affected by this feat.",
			"Alternatively, you may expend a use of mythic power to cast a spell as a widened spell (gaining only the normal benefits of a widened spell, rather than the increased benefits outlined above) without preparing it as widened in advance, taking extra casting time, or increasing the level of spell slot it uses."
		],
		"Normal": [ "A widened spell increases its area by 100%." ]
	},
	{
		"-id": "Mythic Wind Stance",
		"-title": "Mythic Wind Stance",
		"-groups": "Mythic",
		"-description": "You always seem to be in motion.",
		"Prerequisites": "Dex 15, Dodge, Wind Stance, base attack bonus +6.",
		"Benefit": [ "If you move more than 5 feet this turn, you gain 20% concealment for 1 round against all attacks. If you expend a use of mythic power, you gain this benefit for 1 minute without needing to move." ],
		"Normal": [ "Wind Stance grants you 20% concealment for 1 round against ranged attacks if you move more than 5 feet." ]
	}
]
