{
	"Bundles": {
		"Bundle": [
			{
				"-id": "Ricochet Shot Deed",
				"-title": "Ricochet Shot Deed",
				"-groups": "Grit",
				"-description": "You can ricochet a firearm shot off the wall and still hit your target.",
				"Prerequisites": "Grit class feature or Amateur Gunslinger feat, Blind-Fight.",
				"Benefit": [ "You can fire a shot at a wall or piece of solid terrain, and have it ricochet off. When you do, use the square immediately in front of the wall or piece of solid terrain to determine line of sight to a target, and this square is considered the new origin square of the attack. Use that square to determine the effects of cover, and your own square to determine the effects of concealment. You can make this shot as long as you have at least 1 grit point. When making this shot, you can spend 1 grit point to ignore the effects of all cover or concealment. You must choose to spend the grit point before you make the attack roll." ]
			},
			{
				"-id": "Ricochet Splash Weapon",
				"-title": "Ricochet Splash Weapon",
				"-description": "Even when your thrown splash weapons miss, they are especially dangerous.",
				"Prerequisites": "Dex 13, Throw Anything.",
				"Benefit": [ "Whenever your splash weapon misses and the misdirection roll indicates it lands in a square occupied by a creature, you may make an attack roll (at a -5 penalty) as if you had thrown the splash weapon at that creature. If this attack roll succeeds, the splash weapon hits and the creature takes full damage instead of splash damage. Squares adjacent to this creature still take splash damage as normal." ],
				"Normal": [ "A thrown splash weapon that misses deals splash damage in the square where it lands and in adjacent squares." ]
			},
			{
				"-id": "Ride-By Attack",
				"-title": "Ride-By Attack",
				"-groups": "Mythic",
				"-description": "You can make multiple attacks as you ride past your enemies.",
				"Prerequisites": "Ride-By Attack.",
				"Benefit": [
					"When you successfully strike an opponent as part of a Ride-By Attack, you can continue to make attacks against successive targets. You can make one additional attack per 3 tiers you possess, but you can't make more attacks than you could if you were making a full attack.",
					"Successive attacks use the lower bonus for multiple attacks, as when making a full attack. You must move at least 10 feet between each attack."
				]
			},
			{
				"-id": "Ride-by Attack",
				"-title": "Ride-by Attack",
				"-groups": "Combat",
				"-description": "While mounted and charging, you can move, strike at a foe, and then continue moving.",
				"Prerequisites": "Ride 1 rank, Mounted Combat.",
				"Benefit": [ "When you are mounted and use the charge action, you may move and attack as if with a standard charge and then move again (continuing the straight line of the charge). Your total movement for the round can't exceed double your mounted speed. You and your mount do not provoke an attack of opportunity from the opponent that you attack." ]
			},
			{
				"-id": "Righteous Healing",
				"-title": "Righteous Healing",
				"-description": "Your healing spells are more potent when you have a judgment active.",
				"Prerequisites": "Judgment class feature.",
				"Benefit": [ "If you cast a cure spell while you have a judgment active, each target regains 1 extra hit point from the cure spell + 1 hit point per three inquisitor levels you possess." ]
			},
			{
				"-id": "Rime Spell",
				"-title": "Rime Spell",
				"-groups": "Metamagic",
				"-description": "Creatures damaged by your spells with the cold descriptor become entangled.",
				"Benefit": [
					"The frost of your cold spell clings to the target, impeding it for a short time. A rime spell causes creatures that takes cold damage from the spell to become entangled for a number of rounds equal to the original level of the spell.",
					"This feat only affects spells with the cold descriptor.",
					"Level Increase: +1 (a rime spell uses up a spell slot one level higher than the spell's actual level.)"
				]
			},
			{
				"-id": "Riptide Attack",
				"-title": "Riptide Attack",
				"-groups": "Combat",
				"-description": "You can follow up a successful trip attempt with a drag maneuver.",
				"Prerequisites": "Improved Drag, Improved Trip.",
				"Benefit": [
					"When you succeed at a trip combat maneuver, you may automatically make a drag combat maneuver against your tripped target as a swift action. Your base attack bonus for the drag check is the same as the base attack bonus you used for the trip check. The drag attempt provokes attacks of opportunity as normal.",
					"Combat Trick",
					"Source PPC:WMH",
					"Note If using the optional Stamina Pool rules, the following trick may be used with this feat.",
					"Combat Trick: By spending 4 stamina points, you can attempt a drag combat maneuver check against any opponent that you successfully trip using Riptide Attack as a free action instead of a swift action."
				]
			},
			{
				"-id": "Risky Striker",
				"-title": "Risky Striker",
				"-groups": "Combat,Halfling",
				"-description": "You can make yourself a little more vulnerable to larger creatures in order to land a devastating blow.",
				"Prerequisites": "Base attack bonus +1, halfling.",
				"Benefit": [ "You can choose to take a –1 penalty to AC to gain a +2 bonus on melee damage rolls against creatures two or more size categories larger than you. When your base attack bonus reaches +4 and every 4 levels thereafter, the penalty increases by –1 and the damage bonus increases by 2. The bonus damage is multiplied in the case of a critical hit. You can only choose to use this feat when you declare that you are making an attack action or a full-attack action with a melee weapon. The effects last until your next turn." ]
			},
			{
				"-id": "Ritual Hex",
				"-title": "Ritual Hex",
				"-description": "You are well versed in ancient secrets and forbidden curses, and know how to petition powers with which you are already in contact for additional knowledge.",
				"Prerequisites": "Knowledge (arcana) 4 ranks, Knowledge (history) 4 ranks, hex class feature.",
				"Benefit": [
					"You learn to perform a special occult ritual known as Beseeching the Patron, which temporarily grants you a hex you don't already know how to use. You always believe that your ritual is a success, so the GM should roll the required skill checks in secret, revealing the result only when you try to use your newly acquired hex.",
					"School divination; Level 4 Casting Time 40 minutes Components V, F (a book of occult lore worth at least 150 gp) Skill Checks Knowledge (arcana) DC 20, 2 successes; Knowledge (history) DC 20, 2 successes Range personal Duration 24 hours Saving Throw no; Spell Resistance no Backlash The caster is fatigued for 1 hour. Failure All of the caster's spells suffer a 10% spell failure chance for 24 hours.",
					"EFFECT",
					"The caster gains access to one additional hex for which she qualifies. This ritual can be used to acquire a major hex (increasing the DCs of the ritual's skill checks by 10) or grand hex (increasing the DCs by 20) if desired. The caster can have only one additional hex from this ritual at a time."
				]
			},
			{
				"-id": "River Raider",
				"-title": "River Raider",
				"-groups": "Combat",
				"-description": "You're skilled at creeping up on watercraft without being noticed and getting the jump on their occupants.",
				"Benefit": [ "You gain a +2 bonus on Swim and Stealth checks while swimming in calm or rough water (but not while swimming in stormy water). In addition, if you're able to act in a surprise round and you start the surprise round in water, you can take both a move and a standard action. You still cannot take a full-round action during the surprise round." ],
				"Normal": [ "You can take only a move or a standard action if you can act in the surprise round." ]
			},
			{
				"-id": "Riving Strike",
				"-title": "Riving Strike",
				"-groups": "Combat",
				"-description": "When you infuse your weapon with arcane might, your attacks make foes more susceptible to magic.",
				"Prerequisites": "Arcane Strike, ability to cast arcane spells.",
				"Benefit": [ "If you have a weapon that is augmented by your Arcane Strike feat, when you damage a creature with an attack made with that weapon, that creature takes a -2 penalty on saving throws against spells and spell-like abilities. This effect lasts for 1 round." ]
			},
			{
				"-id": "Robot's Bane",
				"-title": "Robot's Bane",
				"-description": "You have trained to avoid the attacks and effects employed by robots and technology and to combat them effectively.",
				"Prerequisites": "Knowledge (engineering) 5 ranks",
				"Benefit": [ "You gain a +1 bonus on attack and damage rolls against creatures with the robot subtype. Additionally, you gain a +1 dodge bonus to your AC and a +1 bonus on saving throws against attacks and effects from robots. If you have at least 11 ranks in Knowledge (engineering), these bonuses increase to +2. If you have at least 17 ranks in Knowledge (engineering), these bonuses increase to +3." ],
				"Special": [ "If you have constructs as a favored enemy, you can use your favored enemy bonus toward constructs in place of the bonus granted by this feat if it's larger. These bonuses do not stack with those granted by other abilities that allow you to add your favored enemy bonus to AC or on saving throws." ]
			},
			{
				"-id": "Roll With It",
				"-title": "Roll With It",
				"-groups": "Combat, Goblin",
				"-description": "You know how to take a hit, even if your reaction sends you bouncing and flying out of battle while shrieking at the top of your lungs.",
				"Prerequisites": "Goblin, Acrobatics 1 rank.",
				"Benefit": [
					"If you are struck by a melee weapon you can try to convert some or all of that damage into movement that sends you off in an uncontrolled bouncing roll. To do so, you must make an Acrobatics check (DC = 5 + the damage dealt from the attack) as an immediate action. If you succeed in this check, you take no damage from the actual attack but instead convert that damage into movement with each point equating to 1 foot of movement.",
					"For example, if you would have taken 6 points of damage, you would convert that into 6 feet of movement. You immediately move in a straight line in a direction of your choice this number of feet (rounded up to the nearest 5-foot-square), halting if you reach a distance equal to your actual speed. If this movement would make you strike an object or creature of your size or larger, the movement immediately ends, you take 1d4 points of damage, and fall prone in that square. This involuntary movement provokes attacks of opportunity normally if you move through threatened squares, but does not provoke an attack of opportunity from the creature that struck you in the first place.",
					"You are staggered for 1 round after you attempt to use this feat, whether or not you succeed."
				]
			},
			{
				"-id": "Rouse Emotions",
				"-title": "Rouse Emotions",
				"-description": "You can sway the hearts of an entire crowd with your art, or turn them against your enemies.",
				"Prerequisites": "Cha 13, Charming Performance, Perform (any) 5 ranks, bardic performance or raging song.",
				"Benefit": [ "You can use Charming Performance on all creatures within 60 feet. In addition to swaying the crowd's starting attitude toward a single person, you may choose to sway the crowd's attitude toward a well-defined group with which they are familiar (such as a specific nation, organization, or religion). An attempt to rouse emotions about a group takes a –5 penalty due to the difficulty of creating strong feelings toward an entire group rather than a specific individual. The DC for this check is 30 + 1 for every five people in the crowd to be affected. You can't use Rouse Emotions to change a crowd's attitude by more than one step, or to make it helpful or hostile." ]
			},
			{
				"-id": "Rubble Skirmisher",
				"-title": "Rubble Skirmisher",
				"-groups": "Combat",
				"-description": "You use difficult terrain to your advantage when performing combat maneuvers.",
				"Prerequisites": "Dex 13, Nimble Moves, base attack bonus +2.",
				"Benefit": [ "When you are in a square that has naturally occurring difficult terrain (bushes, rubble, undergrowth, and so forth), you gain a +2 circumstance bonus on combat maneuver checks and to your CMD." ]
			},
			{
				"-id": "Rugged Northerner",
				"-title": "Rugged Northerner",
				"-description": "You live a hard life in a cold climate, and after enduring the hardships of many brutal winters, you've gained some benefit from the frozen environs.",
				"Prerequisites": "Con 13, Survival 1 rank.",
				"Benefit": [ "You treat extreme cold conditions as severe cold, and severe cold as cold weather conditions. You are not impacted at all by normal cold weather conditions. In addition, you do not become fatigued by frostbite or hypothermia." ],
				"Special": [ "This feat is unaffiliated-a character need not be affiliated with the Mammoth Lords to select this feat." ]
			},
			{
				"-id": "Run",
				"-title": "Run",
				"-description": "You are swift of foot.",
				"Benefit": [ "When running, you move five times your normal speed (if wearing medium, light, or no armor and carrying no more than a medium load) or four times your speed (if wearing heavy armor or carrying a heavy load). If you make a jump after a running start (see Acrobatics), you gain a +4 bonus on your Acrobatics check. While running, you retain your Dexterity bonus to your Armor Class." ],
				"Normal": [ "You move four times your speed while running (if wearing medium, light, or no armor and carrying no more than a medium load) or three times your speed (if wearing heavy armor or carrying a heavy load), and you lose your Dexterity bonus to AC." ]
			},
			{
				"-id": "Runic Charge",
				"-title": "Runic Charge",
				"-groups": "Combat",
				"-description": "You can deliver touch spells with frightful ferocity.",
				"Prerequisites": "Caster level 5th.",
				"Benefit": [ "As long as two of your hands are free, you can cast a spell with a range of touch and deliver the spell to a single target as part of a charge action. When you do so, you gain a +2 bonus on caster level checks to overcome the target's spell resistance, and the critical threat range of that touch attack is 19-20. This increased threat range does not stack with similar abilities such as Improved Critical." ]
			},
			{
				"-id": "Rushing Winds",
				"-title": "Rushing Winds",
				"-groups": "Combat",
				"-description": "You can fly through the air at high speed, creating a column of wind in your path that destabilizes other fliers.",
				"Prerequisites": "Turbulent Takeoff, Fly 10 ranks.",
				"Benefit": [ "As a full-round action, you can fly up to twice your Fly speed in a straight line, creating a shockwave of rushing winds around you as you move. Each flying creature you pass adjacent to as part of this movement must succeed at a DC 25 Fly check or be blown back 1d6×10 feet and take 2d6 points of nonlethal damage due to battering and buffeting. Creatures that fail this check by 5 or more also lose 1d4×10 feet of altitude, and creatures that fail this check by 10 or more plummet to the ground." ]
			},
			{
				"-id": "Ruthless Opportunist",
				"-title": "Ruthless Opportunist",
				"-groups": "Combat,Teamwork",
				"-description": "Your timing and fierceness take the enemy by surprise.",
				"Prerequisites": "Human.",
				"Benefit": [ "When an ally with this feat hits with an attack of opportunity against an enemy both you and that ally are threatening, you gain a +2 circumstance bonus on your melee attack rolls against that enemy for 1 round." ]
			},
			{
				"-id": "Sabotage Magic Item",
				"-title": "Sabotage Magic Item",
				"-description": "You can cause magic items to suffer mishaps.",
				"Prerequisites": "Magical Aptitude, Disable Device 5 ranks, Use Magic Device 5 ranks.",
				"Benefit": [ "You can attempt a Use Magic Device check to sabotage a magic item rather than to activate it, with the same DC as activating it blindly. If you succeed at the check, you define a condition under which the magic item will suffer a mishap, either dealing 2d6 points of damage to the creature attempting to use the magic item and failing to perform its desired function or else affecting the wrong target. The condition must be either an audible or a visual trigger, as defined by the magic mouth spell. If you fail the check, you suffer a mishap instead, just as if you had failed to activate the item blindly by 10 or more." ]
			},
			{
				"-id": "Sabotage Specialist",
				"-title": "Sabotage Specialist",
				"-description": "You have an amazing knack for sabotaging devices.",
				"Prerequisites": "Deft Hands, Disable Device 5 ranks.",
				"Benefit": [ "When you use the Disable Device skill to rig simple or tricky devices (such as a saddle or wagon wheel) to work normally for a while and then fail or fall off some time later, you can designate the time the device will fail, up to 60 minutes after you successfully sabotaged it. The device fails 1d6–3 rounds after the designated time (a result of –1 or –2 means it fails 1 round or 2 rounds before the designated time)." ],
				"Normal": [ "You can use the Disable Device skill to rig simple devices such as saddles or wagon wheels to work normally for a while and then fail or fall off some time later (usually after 1d4 rounds or minutes of use)." ]
			},
			{
				"-id": "Sabotaging Sunder",
				"-title": "Sabotaging Sunder",
				"-groups": "Combat",
				"-description": "Your can quickly sabotage a foe's worn or carried equipment.",
				"Prerequisites": "Str 13, Improved Sunder, Power Attack, Disable Device 7 ranks.",
				"Benefit": [
					"As a standard action, you can sabotage an item worn by a foe with a special sunder combat maneuver. You use this maneuver in melee to sabotage an item that is neither held nor hidden in a bag, pack, or other container.",
					"You must have at least one hand free to perform this combat maneuver, and doing so provokes an attack of opportunity from the creature against whom you are performing the maneuver, even though you have the Improved Sunder feat.",
					"When attempting the combat maneuver check, use your ranks in Disable Device in place of your base attack bonus and your Dexterity modifier in place of your Strength modifier.",
					"Any bonuses on combat maneuver checks specifically to sunder (such as the bonus granted by Improved Sunder) also apply to this maneuver, and any bonuses your target gains to CMD against sundering attempts also protect her from this maneuver. If you succeed at the check, instead of dealing damage, you sabotage the chosen item, causing it to gain the broken condition. If the item was already broken, you instead destroy the item or cause it to fall off.",
					"Items immune to sunder are also immune to this special combat maneuver, and this still can't destroy or remove an item such as an artifact that can normally be destroyed or removed only by specific means."
				],
				"Normal": [ "A successful sunder attempt deals weapon damage to the sundered item." ]
			},
			{
				"-id": "Sacred Geometry",
				"-title": "Sacred Geometry",
				"-description": "You can use your mathematical prowess to add metamagic effects to your spells without using a higher-level spell slot.",
				"Prerequisites": "Int 13, Knowledge (engineering) 2 ranks",
				"Benefit": [
					"When you take this feat, select two metamagic feats you do not yet have. When casting a spell, you can perform the steps below to spontaneously apply the effects of either or both of these metamagic feats, as well as any other metamagic feats you have, to the spell without expending a higher-level spell slot. Using a feat in this way increases the spell's casting time to the casting time it would take if the character were a sorcerer or bard (sorcerers and bards using this ability increase the spell's casting time by two categories); applying the Quicken Spell metamagic effect negates the increased casting time but still contributes to the modified spell's effective spell level. You can take this feat more than once; each time, select two additional metamagic feats, adding their effects to the list of possible effects you can apply to spells with this ability.",
					"When casting a spell using Sacred Geometry, first determine the effective spell level of the modified spell you are attempting to cast (calculated as normal for a spell modified by metamagic feats). You can apply any number of metamagic effects to a single spell, provided you are able to cast spells of the modified spell's effective spell level.",
					"Refer to the Prime Constants table to determine the prime constants that can be used to cast a spell of the desired effective spell level. Then roll a number of d6s equal to the number of ranks you possess in Knowledge (engineering). Perform some combination of addition, subtraction, multiplication, and division upon the numbers rolled that gives rise to one of the relevant prime constants. If you can produce one of the relevant prime constants, the spell takes effect with the declared metamagic effects, and you expend a spell slot of the unaltered spell's level. If you are unsuccessful, you fail to cast the spell, the action used to cast the spell is lost, and the spell slot is used up. The DC of any concentration check to cast a spell affected by this feat uses the effective spell level used to determine the prime constants, even though a successful casting of the spell does not expend a higher-level spell slot.",
					"For example, suppose a wizard wants to add the enlarged and empowered effects to the magic missile he just cast. He adds the total level increases of the metamagic effects to the spell level: 2 [empower] + 1 [enlarge] + 1 [magic missile‘s base level] = 4, so the spell's effective level is 4. The wizard refers to the Prime Constants table, and determines that the prime constants for that effective spell level are 31, 37, and 41.",
					"Since the wizard has 5 ranks in Knowledge (engineering), he rolls 5d6. The results of his dice pool are 6, 6, 4, 3 and 1.",
					"He then performs the following operations to give rise to one of the prime constants he needs: (6 × 6) + (4 – 3) × 1 = 37.",
					"Note that he could also combine the numbers as follows: ([6 + 6] × 3) + 4 + 1 = 41. He has produced one of the prime constants for the desired effective spell level, so his empowered enlarged magic missile takes effect after the full-round casting time, and uses only a 1st-level spell slot.",
					"If the result of his dice pool were 1, 1, 2, and 5, he would have been unable to produce any of the relevant prime constants. His attempt would have been unsuccessful, and he would have expended a full-round action and his prepared 1st-level magic missile spell with no effect."
				]
			},
			{
				"-id": "Sacred Summons",
				"-title": "Sacred Summons",
				"-description": "The minions of your divine patrons stand ready to answer your call.",
				"Prerequisites": "Aura class feature, ability to cast summon monster.",
				"Benefit": [ "When using summon monster to summon creatures whose alignment subtype or subtypes exactly match your aura, you may cast the spell as a standard action instead of with a casting time of 1 round." ]
			},
			{
				"-id": "Sacrificial Adept",
				"-title": "Sacrificial Adept",
				"-description": "The deaths of living, sentient creatures fuel your spells and heighten their potency.",
				"Prerequisites": "Knowledge (arcana) 4 ranks, Knowledge (planes) 4 ranks, Knowledge (religion) 4 ranks, Spellcraft 4 ranks, ability to cast 3rd-level spells, evil alignment.",
				"Benefit": [
					"By partaking in a heinous ritual that takes at least 10 minutes to complete and which requires you to perform a successful coup de grace upon a sacrifice, you can enhance the power of a single spell you know or have prepared for the next 24 hours, regardless of how many times you cast it within that period. Your sacrifice must be a sentient creature with a total number of Hit Dice greater than or equal to your caster level, and it must die from your coup de grace; if it doesn't die or comes back to life, you lose all benefits related to that sacrifice.",
					"After successfully performing the ritual, you choose the spell that the ritual enhances and gain your choice of a +2 bonus to any attack rolls and combat maneuvers made with that spell or a +2 bonus on caster level checks to overcome spell resistance with that spell for 24 hours.",
					"You can perform this ritual a number of times per day equal to your Charisma modifier, but you cannot affect the same spell more than once at a time."
				]
			},
			{
				"-id": "Sacrificial Ritualist",
				"-title": "Sacrificial Ritualist",
				"-description": "Your magical power used to originate in yourself, but now you draw it from others.",
				"Prerequisites": "Mutilating Ritualist, Knowledge (arcana) 4 ranks, Knowledge (religion) 4 ranks, Spellcraft 4 ranks.",
				"Benefit": [ "You can improve your ability to cast an occult ritual by powering it with the blood of creatures. When you begin the occult ritual with the death of a sentient creature (or number of sentient creatures with a total number of Hit Dice equal to twice the effective level of the ritual), you and all secondary casters gain a +4 bonus on all skill checks necessary to complete the occult ritual. This feat's sacrifices are in addition to any sacrifices normally required to complete the ritual." ]
			},
			{
				"-id": "Saddle Shrieker",
				"-title": "Saddle Shrieker",
				"-groups": "Combat, Goblin",
				"-description": "You sometimes get carried away when encouraging your mount to fight.",
				"Prerequisites": "Goblin, Ride 1 rank.",
				"Benefit": [ "You can choose to take a -1 penalty on all attack rolls and combat maneuver checks to grant your mount a +1 bonus on all attack rolls and damage rolls made with natural weapons. These effects affect you and your mount for 1 round. When your base attack bonus reaches +4, and every 4 points thereafter, this penalty increases by -1 and the bonus to your mount's attack and damage increases by +1 to a maximum of +5. You must choose to use this feat before making an attack roll." ]
			},
			{
				"-id": "Sand Strike",
				"-title": "Sand Strike",
				"-groups": "Combat",
				"-description": "You can incorporate sand as part of your unarmed fighting techniques.",
				"Prerequisites": "Improved Unarmed Strike, dwarf, proficiency with the cestus.",
				"Benefit": [
					"You can take 1 minute to tightly embed sand into the joints and crevices of a pair of cestuses you wear.",
					"While they have sand embedded in them, the cestuses gain +1 hardness and +5 hit points. While wearing cestuses embedded with sand, you can perform a dirty trick combat maneuver to blind a foe in place of one of your melee attacks without provoking an attack of opportunity. Doing so causes the cestuses to no longer have sand embedded in them. You can embed a single cestus with sand as a full-round action, but you take a -4 penalty on the dirty trick combat maneuver check using a single cestus."
				]
			},
			{
				"-id": "Sap Adept",
				"-title": "Sap Adept",
				"-groups": "Combat",
				"-description": "You know just where to hit to knock the sense out of your foe.",
				"Prerequisites": "Sneak attack +1d6.",
				"Benefit": [ "Whenever you use a bludgeoning weapon to deal nonlethal sneak attack damage, you gain a bonus on your damage roll equal to the number of sneak attack damage dice you rolled." ]
			},
			{
				"-id": "Sap Master",
				"-title": "Sap Master",
				"-groups": "Combat",
				"-description": "You knock the sense out of foes with a well-timed surprise attack.",
				"Prerequisites": "Sneak attack +3d6, Sap Adept.",
				"Benefit": [ "Whenever you use a bludgeoning weapon to deal nonlethal sneak attack damage to a flat-footed opponent, roll your sneak attack dice twice, totaling the results as your nonlethal sneak attack damage for that attack." ]
			},
			{
				"-id": "Savage Display",
				"-title": "Savage Display",
				"-groups": "Combat, Performance",
				"-description": "With your victory and a roar, you push yourself on with increased savagery.",
				"Prerequisites": "Dazzling Display.",
				"Benefit": [ "When you spend a swift action to make a performance combat check, you gain a +2 bonus on your performance combat check and gain a +1d6 bonus on damage rolls until the end of your next turn. This extra damage is not precision damage." ]
			},
			{
				"-id": "Savage Leap",
				"-title": "Savage Leap",
				"-groups": "Combat",
				"-description": "You leap into the air while holding your opponent and slam him to the ground.",
				"Prerequisites": "Improved Grapple, Improved Unarmed Strike, Savage Slam, base attack bonus +12 or monk level 10th.",
				"Benefit": [
					"When you use Savage Slam, you can move yourself and your target up to half your speed before releasing the grapple. You provoke attacks of opportunity from this movement, but your target does not. If your target takes damage from Savage Slam, the target is shaken for 1 round.",
					"You become flat-footed until the start of your next turn if you move before using Savage Slam in this way."
				]
			},
			{
				"-id": "Savage Slam",
				"-title": "Savage Slam",
				"-groups": "Combat",
				"-description": "Using your lock on the enemy's body, you forcefully hurl your opponent to the ground.",
				"Prerequisites": "Improved Grapple, Improved Unarmed Strike, base attack bonus +3 or monk level 1st.",
				"Benefit": [ "When you begin your turn grappling an opponent, instead of attempting a combat maneuver check to maintain the grapple, you can try to viciously slam your opponent down. As a standard action, you can attempt a grapple combat maneuver check against the opponent. If you succeed, you release your grapple and the opponent falls prone in an unoccupied square of your choice adjacent to you. If you attempt to throw your foe into a hazardous location, such as a wall of fire or a pit, the target receives a +4 bonus to its CMD against your attempt. As long as the opponent lands on solid ground or a solid object, it takes damage equal to your unarmed strike's damage." ]
			},
			{
				"-id": "Savage Surge",
				"-title": "Savage Surge",
				"-groups": "Combat, Performance",
				"-description": "You can channel your rage into crowd-pleasing displays of brutality that aid you in the arena.",
				"Prerequisites": "Intimidating Prowess, rage class feature",
				"Benefit": [
					"When attempting a performance combat check while raging, you may, as a free action, expend a number of your daily rounds of rage up to half your barbarian level to create a display of savagery. You gain a bonus on the performance combat check equal to half the number of rounds expended, rounded down. If you expend all your remaining rounds of rage in this manner, thus ending your rage, you gain an additional +2 bonus on the check.",
					"Combat Trick",
					"Note If using the optional Stamina Pool rules, the following trick may be used with this feat.",
					"Combat Trick: You can spend stamina points instead of rounds of rage when using Savage Surge."
				]
			},
			{
				"-id": "Saving Shield",
				"-title": "Saving Shield",
				"-groups": "Combat",
				"-description": "You deflect attacks that could mean your ally's death.",
				"Prerequisites": [
					"Shield Proficiency.",
					"Benefits: Whenever an adjacent ally is the target of an attack, you can, as an immediate action, grant that adjacent ally a +2 shield bonus to AC. You must be wielding a light shield, heavy shield, or tower shield to use this feat."
				]
			},
			{
				"-id": "Scale and Skin",
				"-title": "Scale and Skin",
				"-description": "When you are changed by magic, your skin also toughens.",
				"Prerequisites": "Con 13.",
				"Benefit": [ "Whenever a transmutation spell or spell-like ability affects you, your natural armor bonus increases by 1. If you have no natural armor bonus to Armor Class, treat your natural armor bonus as 0 for the purposes of this feat. The bonus to your natural armor bonus increases by 2 if the caster level of the effect is 10th or higher." ]
			},
			{
				"-id": "Scaled Disciple",
				"-title": "Scaled Disciple",
				"-groups": "Kobold",
				"-description": "Your draconic heritage manifests as divine power.",
				"Prerequisites": "Ability to spontaneously cast divine spells, kobold.",
				"Benefit": [ "You gain a +1 bonus to your caster level when casting spells included in the dragon domain* or subdomains. Your spontaneous divine spellcasting qualifies in place of arcane casting for the dragon disciple prestige class, and you may increase spellcasting in your spontaneous divine class as you progress in dragon disciple levels. Add the bonus spells gained from the blood of dragons ability to those you can cast as divine spells." ]
			},
			{
				"-id": "Scarring Spell",
				"-title": "Scarring Spell",
				"-groups": "Metamagic",
				"-description": "Your emotion-affecting magic causes psychic trauma in your opponents.",
				"Benefit": [
					"When a creature fails a saving throw against a scarring spell, for the next 24 hours that creature takes a —2 penalty on saving throws against emotion and fear effects you create, and a —1 penalty on saving throws against other emotion and fear effects. Penalties from multiple scarring spells don't stack. This metamagic feat can be applied only to spells with the emotion or fear descriptor.",
					"Level Increase: +1 (a scarring spell uses up a spell slot 1 level higher than the spell's actual level."
				]
			},
			{
				"-id": "Scavenger's Eye",
				"-title": "Scavenger's Eye",
				"-groups": "Tengu",
				"-description": "...",
				"Prerequisites": "Tengu.",
				"Benefit": [ "You gain a +2 bonus on Appraise checks. You may determine the most valuable item in a hoard as a standard action and gain an additional +2 bonus on the Appraise check to do so. In addition, if you fail an Appraise check by 5 or more, you treat the check as if you had failed by less than 5." ],
				"Normal": [ "Determining the most valuable object in a treasure hoard takes 1 full-round action." ]
			},
			{
				"-id": "Scavenger's Luck",
				"-title": "Scavenger's Luck",
				"-description": "You coax better behavior out of timeworn technology.",
				"Prerequisites": "Knowledge (engineering) 1 rank",
				"Benefit": [ "When your check for using a piece of timeworn technology results in a glitch, you can roll again. You must choose to reroll before determining the specific glitch, and must take the second result, even if it's worse. When you use timeworn technology, it doesn't automatically glitch on a natural 1." ]
			},
			{
				"-id": "Scholar",
				"-title": "Scholar",
				"-description": "You have graduated from one of the many colleges, universities, and specialized schools of higher learning scattered throughout the world.",
				"Benefit": [
					[ "Pick any two Knowledge skills. You gain a +2 bonus on checks with these two skills. If you have 10 or more ranks in one of these Knowledge skills, the bonus increases to +4 for that skill." ],
					[ "Pick any two Knowledge skills. You gain a +2 bonus on these two skills. If you have 10 or more ranks in one of these Knowledge skills, the bonus increases to +4 for that skill." ]
				]
			},
			{
				"-id": "School Strike",
				"-title": "School Strike",
				"-groups": "Combat",
				"-description": "You focus the secrets of your school of wizardry into your unarmed strike.",
				"Prerequisites": "Wizard school class feature, Improved Unarmed Strike.",
				"Benefit": [ "When you gain this feat, choose one arcane school power that you can use to affect no more than one opponent. If you make a successful unarmed strike against an opponent, in addition to dealing your unarmed strike damage, you can use a swift action to deliver the effects of the chosen school power to that opponent. Doing so provokes no attacks of opportunity." ],
				"Special": [ "You can take this feat multiple times. Each time you take it, you apply it to a different qualifying arcane school power." ]
			},
			{
				"-id": "Schooled Reserve",
				"-title": "Schooled Reserve",
				"-description": "Your intensive combat training to fight vampiric forces allows you to fight off their mental spells and effects using your resistance to fear.",
				"Prerequisites": "Bravery class feature",
				"Benefit": [ "You add your bravery bonus on Will saves against mind-affecting spells and effects from vampires. This does not stack with the normal bravery bonus on saves against fear effects." ]
			},
			{
				"-id": "Scorching Weapons",
				"-title": "Scorching Weapons",
				"-groups": "Combat,Ifrit",
				"-description": "Elemental fire stirs within your body, boiling your blood and rendering you resistant to flame.",
				"Prerequisites": "Ifrit.",
				"Benefit": [ "You gain a +2 bonus on saving throws against fire attacks and spells with the fire descriptor or light descriptor. As a swift action, you can make up to two held manufactured metallic weapons become red-hot for 1 round, dealing 1 additional point of fire damage with a successful hit. This does not stack with other effects that add fire damage to weapons, such as the flaming weapon special ability." ]
			},
			{
				"-id": "Scorpion Style",
				"-title": "Scorpion Style",
				"-groups": "Combat",
				"-description": "You can perform an unarmed strike that greatly hampers your target's movement.",
				"Prerequisites": "Improved Unarmed Strike.",
				"Benefit": [ "To use this feat, you must make a single unarmed attack as a standard action. If this unarmed attack hits, you deal damage normally, and the target's base land speed is reduced to 5 feet for a number of rounds equal to your Wisdom modifier unless it makes a Fortitude saving throw (DC 10 + 1/2 your character level + your Wis modifier)." ]
			},
			{
				"-id": "Scouting Summons",
				"-title": "Scouting Summons",
				"-groups": "Metamagic",
				"-description": "Your experiments with the connection between summoners and the creatures they summon have taught you to see through the eyes of a summoned creature for a short time.",
				"Prerequisites": "Spell Focus (conjuration), ability to cast magic jar.",
				"Benefit": [
					"When casting a conjuration (summoning) spell that summons a single creature, you can possess the creature as per magic jar (but with no receptacle necessary).",
					"If the creature takes damage while you possess it, you must succeed at a concentration check (DC equal to the amount of damage taken) or be ejected from the creature immediately.",
					"If the creature takes enough damage to reduce it to 0 hit points or fewer, you are immediately ejected from the creature and take an amount of damage equal to double the level of the spell slot used to summon that creature. A scouting summons spell takes up a spell slot 2 levels higher than the spell's actual level.",
					"Level Increase: +2 (a scouting summons spell uses up a spell slot 2 levels higher than the spell's actual level.)"
				]
			},
			{
				"-id": "Scribe Scroll",
				"-title": "Scribe Scroll",
				"-groups": "Item Creation",
				"-description": "You can create magic scrolls.",
				"Prerequisites": "Caster level 1st.",
				"Benefit": [
					"You can create a scroll of any spell that you know. Scribing a scroll takes 2 hours if its base price is 250 gp or less, otherwise scribing a scroll takes 1 day for each 1,000 gp in its base price. To scribe a scroll, you must use up raw materials costing half of this base price.",
					"See magic item creation rules for more information."
				]
			},
			{
				"-id": "Scrutinize Spell",
				"-title": "Scrutinize Spell",
				"-description": "You can quickly size up spellcasters to gain an advantage when counterspelling their spells.",
				"Prerequisites": "Spellcraft 1 rank.",
				"Benefit": [
					"When you witness a creature casting a spell, you can attempt a Spellcraft check to determine what sort of spellcaster the target is—specifically, what the target's class is. The DC of this skill check is equal to 10 + the spellcaster's Hit Dice. If the target has levels in multiple spellcasting classes, succeeding at this check reveals what class spell list the spell came from. If the result of the check is high enough that it would identify the spell being cast (DC = 15 + the spell's level), you also identify the spell.",
					"Once you have identified the target's class, you can add your Wisdom or Charisma modifier (whichever is higher) to Spellcraft checks to identify all spells the target casts from that class's spell list. Additionally, after you have determined the target's spellcasting class, you can attempt an Intimidate check as a free action to demoralize the target, gaining a bonus equal to your Wisdom or Charisma modifier (whichever is highest)."
				]
			},
			{
				"-id": "Sculpting the River",
				"-title": "Sculpting the River",
				"-groups": "Combat, Combination",
				"-description": "Your deft strikes and canny positioning control the flow of combat.",
				"Prerequisites": "Dodge, Improved Unarmed Strike, base attack bonus +6 or monk level 6th.",
				"Benefit": [ "When you deal damage with an unarmed attack to an opponent you have already damaged this round, you can impose a -1 penalty on that target's attacks against creatures other than you. The penalties stack and remain until the target misses an attack or the start of your next turn, whichever comes first." ]
			},
			{
				"-id": "Scurrying Swarmer",
				"-title": "Scurrying Swarmer",
				"-groups": "Combat - Ratfolk",
				"-description": "You abandon all notion of personal space when in danger, scurrying about your allies in search of the best vantage point from which to strike at your foes.",
				"Prerequisites": "Ratfolk, swarming racial trait.",
				"Benefit": [ "You can use your swarming racial trait to enter the square of any willing ally that is the same size as you or up to one size category larger, granting you the benefits of the swarming racial trait as if your ally were also a ratfolk with the swarming racial trait. Your ally gains no benefits from sharing its space with you unless it also has the swarming racial trait. Additionally, you treat any ally who shares its space with you as having the same teamwork feats that you do for the purpose of determining whether you gain a bonus from teamwork feats. Your ally doesn't gain any of the bonuses from these feats unless she actually has the teamwork feats. You and your ally's positioning and actions must still meet the prerequisites listed in a teamwork feat's description in order to gain the teamwork feat's listed bonus, but your ally is considered to be adjacent to you while you share her space for the purpose of determining whether you or your ally gains a benefit." ]
			},
			{
				"-id": "Sea Hunter",
				"-title": "Sea Hunter",
				"-groups": "Combat, Merfolk",
				"-description": "Your blows knock swimming opponents off balance.",
				"Prerequisites": "Combat Expertise, merfolk.",
				"Benefit": [ "When you make a successful melee attack against a swimming target, as a free action you can attempt to knock the target off balance. Treat this as a trip combat maneuver. If you succeed, the target is considered off balance (see Table: Combat Adjustments Underwater) until it recovers its balance, usually by making a Swim check on its turn. This feat has no effect on creatures with a swim speed, those using magic such as freedom of movement, and creatures that can't be tripped." ]
			},
			{
				"-id": "Sea Legs",
				"-title": "Sea Legs",
				"-description": "You have a sailor's instincts for moving about while aboard seagoing vessels.",
				"Prerequisites": "Profession (sailor) 5 ranks.",
				"Benefit": [ "You gain a +2 bonus on Acrobatics, Climb, and Swim checks." ]
			},
			{
				"-id": "Searing Distraction",
				"-title": "Searing Distraction",
				"-groups": "Combat",
				"-description": "You harry your foes with the light and heat of your weapon.",
				"Prerequisites": "Catch Off-Guard.",
				"Benefit": [ "When you make an attack using a light source such as a sunrod or torch as an improvised weapon, the target must succeed at a Fortitude save or be dazzled for 1 round. On a critical hit, the target is instead blinded for 1 round. The DC of the effect is 10 + half your character level + your Dexterity modifier. Blind targets are immune to this effect." ]
			},
			{
				"-id": "Second Chance",
				"-title": "Second Chance",
				"-groups": "Combat",
				"-description": "Quick reflexes turn missed strikes into second chances.",
				"Prerequisites": "Int 13, Combat Expertise, base attack bonus +6.",
				"Benefit": [ "When making a full attack, if you miss on your first attack, you can forgo making any other attacks for the rest of your turn to reroll that attack at your highest base attack bonus." ]
			},
			{
				"-id": "Second Wind",
				"-title": "Second Wind",
				"-groups": "Combat, Performance",
				"-description": "The roar of the crowd strengthens your resolve.",
				"Prerequisites": "Endurance.",
				"Benefit": [ "When you spend a swift action to attempt a performance combat check, you gain a +2 bonus on your performance combat check, and if you are shaken, sickened, or fatigued, these conditions are suppressed until the end of your next turn." ]
			},
			{
				"-id": "Secret Language",
				"-title": "Secret Language",
				"-groups": "Teamwork",
				"-description": "You and your allies have worked out a complex set of codes and phrases that allow you to secretly pass information back and forth.",
				"Prerequisites": "Bluff 1 rank, Linguistics 1 rank, Sense Motive 1 rank.",
				"Benefit": [ "You gain a +5 circumstance bonus on Bluff checks made to pass secret messages to other characters that have this feat, and can communicate as much information as you could normally say in one round as a swift action." ]
			},
			{
				"-id": "Secret Signs",
				"-title": "Secret Signs",
				"-description": "You are particularly adept at communicating with others via innuendo, gestures, and secret hand signs.",
				"Prerequisites": "Int 13.",
				"Benefit": [ "You gain a +4 bonus on Bluff checks made to pass secret messages. In addition, you are adept at hiding the somatic components of spellcasting. If you cast a spell that has only somatic components, an observer must make a Perception check opposed by your Sleight of Hand check to notice your spellcasting. Spellcraft checks made to identify any spell you cast that has somatic components take a –2 penalty." ]
			},
			{
				"-id": "Secret Stash Deed",
				"-title": "Secret Stash Deed",
				"-groups": "Grit",
				"-description": "You are so skilled at stashing small packets of firearm ammunition and black powder on your person that you sometimes surprise yourself when you find them.",
				"Prerequisites": "Grit class feature or Amateur Gunslinger feat, Sleight of Hand 1 rank.",
				"Benefit": [ "Spend 1 grit point while in combat to recover either 1 bullet and 1 dose of black powder or 1 alchemical cartridge from a hidden stash on your person that you had, until now, forgotten about. If the bullet and black powder or the alchemical cartridges are normal shot, you do not need to pay for the ammunition. If you want to recover any other kind of ammunition, you must pay for it with gold pieces from your character's wealth. The grit cost of this deed cannot be decreased by the Signature Deed feat, the true grit class feature, or any other similar effect that reduces the number of grit points you spend to use a deed. You also gain a +4 bonus on any Sleight of Hand checks made while gambling." ]
			},
			{
				"-id": "Seeking Spell",
				"-title": "Seeking Spell",
				"-groups": "Metamagic",
				"-description": "You can cast spells that bend around barriers to reach their intended destination.",
				"Benefit": [
					"A seeking spell's range can bend around obstacles to reach the intended target. You can define the route yourself or unambiguously identify a target and allow the spell to determine its own path. However, the spell fails if it would have to travel farther than its maximum range to reach the identified target. A ranged attack roll made to deliver a seeking spell is not subject to cover or concealment. In order to benefit from this feat, the selected spell must have a range greater than touch and target one or more creatures, or it must require the caster to make a ranged touch attack.",
					"Level Increase: +2 (a seeking spell uses up a spell slot two levels higher than the spell's actual level.)"
				]
			},
			{
				"-id": "Seen and Unseen",
				"-title": "Seen and Unseen",
				"-groups": "Half-Elf",
				"-description": "...",
				"Prerequisites": "Exile's Path, character level 5th, half-elf.",
				"Benefit": [ "You gain a +2 bonus on all saving throws against scrying or divination effects. Additionally, you gain a +2 bonus on all Stealth checks, and elves, half-elves, and humans take a –4 penalty on all efforts to track you through the Survival skill." ]
			},
			{
				"-id": "Seething Hatred",
				"-title": "Seething Hatred",
				"-groups": "Combat",
				"-description": "You've learned to channel your hatred of a particular type of creature into a devastating strike.",
				"Prerequisites": "Studied target class feature.",
				"Benefit": [ "Select a creature type from the Ranger Favored Enemies table. When you designate a creature of this type as your studied target and hit it with a melee or ranged weapon attack, your favored target bonus on damage rolls against it is doubled." ]
			},
			{
				"-id": "Seize Advantage",
				"-title": "Seize Advantage",
				"-groups": "Combat",
				"-description": "You can take advantage of your foes when they overcommit on their attacks.",
				"Prerequisites": "Opportune parry and riposte deed.",
				"Benefit": [ "When your foe is using Power Attack and you successfully use the opportune parry and riposte deed to parry its attack and then respond with a riposte, you add your foe's current bonus on damage rolls from Power Attack to your own damage roll, but you do not take the penalty to hit from your foe's Power Attack." ]
			},
			{
				"-id": "Seize the Moment",
				"-title": "Seize the Moment",
				"-groups": "Combat,Teamwork",
				"-description": "You and your allies are poised to pounce whenever one of you scores a telling blow.",
				"Prerequisites": "Combat Reflexes, Improved Critical.",
				"Benefit": [ "When an ally who also has this feat confirms a critical hit against an opponent that you also threaten, you can make an attack of opportunity against that opponent." ]
			},
			{
				"-id": "Selective Channeling",
				"-title": "Selective Channeling",
				"-description": "You can choose whom to affect when you channel energy.",
				"Prerequisites": "Cha 13, channel energy class feature.",
				"Benefit": [ "When you channel energy, you can choose a number of targets in the area up to your Charisma modifier. These targets are not affected by your channeled energy." ],
				"Normal": [
					"All targets in a 30-foot burst are affected when you channel energy. You can only choose whether or not you are affected.",
					"Editor's Note",
					"Do I have to be able to see a creature in order to exclude them from the effect of my channeled energy?",
					"Just like using a Target: creature spell, you must be able to see or touch a creature to affect it (or, in the case of this feat, select it to be unaffected). Pinpointing the square of an invisible creature isn't sufficient—you must be able to see or touch the creature. Note that this works differently than an alchemist‘s precise bombs discovery, which allows the alchemist to exclude *squares* from his bomb's splash area (not targets)."
				]
			},
			{
				"-id": "Selective Spell",
				"-title": "Selective Spell",
				"-groups": "Metamagic",
				"-description": "Your allies need not fear friendly fire.",
				"Prerequisites": "Spellcraft 10 ranks.",
				"Benefit": [
					"When casting a selective spell with an area effect and a duration of instantaneous, you can choose a number of targets in the area equal to the ability score modifier used to determine bonus spells of the same type (Charisma for bards, oracles, paladins, sorcerers, and summoners; Intelligence for witches and wizards; Wisdom for clerics, druids, inquisitors, and rangers). These targets are excluded from the effects of your spell.",
					"Level Increase: +1 (a selective spell uses up a spell slot one level higher than the spell's actual level.)",
					"Spells that do not have an area of effect or a duration of instantaneous do not benefit from this feat."
				]
			},
			{
				"-id": "Self-Sufficient",
				"-title": "Self-Sufficient",
				"-description": "You know how to get along in the wild and how to effectively treat wounds.",
				"Benefit": [ "You get a +2 bonus on all Heal checks and Survival checks. If you have 10 or more ranks in one of these skills, the bonus increases to +4 for that skill." ]
			},
			{
				"-id": "Sense Assumptions",
				"-title": "Sense Assumptions",
				"-description": "You can easily intuit an opponent's preconceptions.",
				"Prerequisites": "Sense Motive 3 ranks.",
				"Benefit": [
					"You can attempt a Sense Motive check to intuit some of another person's assumptions after 1 minute of conversation. The DC equals 20, or 10 + the target's Bluff modifier, whichever is higher. If you succeed, you learn whether or not a falsehood of your choice related to the topic of conversation would impose a penalty on Bluff checks to convince the target of that falsehood's truth.",
					"If you fail by 4 or less, you learn nothing. If you fail by 5 or more, the target realizes you are trying to glean information from it. You can retry this check, but the DC increases by 5 for each previous failure on this check against that target."
				]
			},
			{
				"-id": "Sense Link",
				"-title": "Sense Link",
				"-description": "When you and your eidolon share senses, your combined minds grant you exceptional powers of observation.",
				"Prerequisites": "Bond senses class feature.",
				"Benefit": [ "When sharing the senses of your eidolon, you gain a +4 competence bonus on Perception checks for the duration of your bond senses ability." ]
			},
			{
				"-id": "Sense Loyalties",
				"-title": "Sense Loyalties",
				"-description": "You can quickly sense a target's relationship to some specific god, patron, or government, and use that knowledge to manipulate them.",
				"Prerequisites": "Knowledge (nobility) 1 rank, Knowledge (religion) 1 rank.",
				"Benefit": [
					"After 1 hour or more of interaction, you can attempt a DC 20 Sense Motive check to get a hunch in order to intuit what god, government, leader, or patron a creature is loyal to or worships. You must understand the language the creature is speaking, and if it's of a different type than you, you take a –5 penalty on the check. If the creature is attempting to conceal its loyalties, it attempts a Bluff check.",
					"If the result of the Bluff check is higher than 20, that result becomes the DC of your Sense Motive check. On a success, you learn whether the creature has a patron god, a witch patron, or a government to which it is strongly loyal. You can attempt to name one specific god, patron, or government for every 2 ranks you have in Sense Motive by introducing them into the conversation as subjects, as noted below.",
					"You can use this ability only if you observe the creature in an environment where loyalty to a god, government, leader, or patron is being discussed. If this isn't already occurring, you can introduce the topic, but doing so may expose your interest. In this case, the creature you are observing and any other creatures able to hear you bring up the topic of loyalty to a god, government, leader, or patron can attempt Sense Motive checks (opposed by a Bluff check from you, which the GM rolls in secret). On a success, the creature realizes you are interested in determining the observed creature's specific loyalty. If you are attempting to determine whether the observed creature's loyalty is to a specific god, government, or leader as noted above, creatures who succeed at the Sense Motive check are aware of the specific god, government, leader, or patron about which you are interesting in learning."
				]
			},
			{
				"-id": "Sense Relationships",
				"-title": "Sense Relationships",
				"-description": "You can quickly sense relationships between others and use that knowledge to manipulate them.",
				"Prerequisites": "Street Smarts.",
				"Benefit": [
					"After 1 minute or more of interaction or observation, you can attempt a DC 20 Sense Motive check to get a hunch in order to intuit the relationship between any two creatures interacting with one another.",
					"If you don't understand the language they are speaking, you take a –5 penalty on the check, and if the creatures are a different type than you, you take an additional –5 penalty on the check.",
					"If you succeed at this check by 5 or more, for the next hour, you gain a +2 bonus on Bluff checks to lie about one of the creatures to the other and on Diplomacy checks to request that one act against the other. If you fail the check, you cannot attempt this ability on the same creatures again until you gain an additional rank in Sense Motive."
				]
			},
			{
				"-id": "Serpent Lash",
				"-title": "Serpent Lash",
				"-groups": "Combat",
				"-description": "You are adept at vexing multiple foes with your whip.",
				"Prerequisites": "Weapon Finesse, proficient in whip.",
				"Benefit": [
					"As a standard action, you can make a disarm or trip maneuver with your whip. If it succeeds, you can make an additional disarm or trip maneuver with the same bonus against a target adjacent to the first and also within your whip's reach.",
					"In addition, you can use your whip to perform reposition maneuvers, though you take a -4 penalty on your CMB and you may only move the target toward you from its original position."
				]
			},
			{
				"-id": "Shade of the Woodlands",
				"-title": "Shade of the Woodlands",
				"-description": "Ordained as one of the sinister albino druids, you carry with you into the wider world a powerful effigy of hair, twigs, and blood that crawls with the deepening cold of the hallowed hunting grounds.",
				"Prerequisites": "Neutral evil, patron deity is an evil god.",
				"Benefit": [
					"Add the following spells to your druid spell list.",
					"Remove all spells with the [fire] descriptor from all your spell lists (not just your druid spell list). You cannot cast any spells with the fire descriptor, nor activate them off scrolls, wands, or any other magic devices. In addition, you may not use wild shape to take the form of any creature with the fire subtype."
				],
				"Special": [ "As part of this feat, you create a personal token that ties your soul and your doings to the fell power of the dark forest. This potent object is treated as a wooden unholy symbol that radiates faint necromancy magic. If your token is ever destroyed, your connection to the shadowy heart of the forest is severed and all benefits of this feat are lost until another is created. This process requires a journey to the same forest and an atonement spell cast by a fellow worshiper of your dark god." ]
			},
			{
				"-id": "Shadow Caster",
				"-title": "Shadow Caster",
				"-groups": "Drow",
				"Prerequisites": "Caster level 1st, drow.",
				"Benefit": [ "When you cast spells of the shadow subschool or spells with the darkness or shadow descriptor, you are considered two levels higher when determining the duration of those spells." ]
			},
			{
				"-id": "Shadow Dodge",
				"-title": "Shadow Dodge",
				"-description": "You use light and darkness to your advantage, confusing your enemies and confounding their senses.",
				"Prerequisites": "Dex 13, worshiper of an evil god.",
				"Benefit": [ "You are able to use the light around you to move back and forth from shadow to light again, and your sudden shifting dazzles your enemies' eyes. By spending a number of feet (in 10-foot increments) when you use this feat to move from one square to another and back again, you gain a Dodge bonus to your AC. This bonus is equal to +1 for every 10 feet you spend moving like this. You do not provoke an attack of opportunity while using this ability. Enemies who do not use sight in order to pinpoint your location or who are otherwise able to locate you more precisely (such as creatures that possess blindsight, tremorsense, or true seeing) ignore this AC bonus. Likewise, this feat is ineffective in areas of darkness or bright light, where one cannot readily shift between light and shadow." ]
			},
			{
				"-id": "Shadow Gambit",
				"-title": "Shadow Gambit",
				"-description": "You can tap into the Plane of Shadow to momentarily lend reality to one of your illusion (figment) spells.",
				"Prerequisites": "Spell Focus (illusion), caster level 5th.",
				"Benefit": [
					"As a standard action, you can draw upon energies from the Plane of Shadow to cause an ongoing figment spell you cast to damage a foe as if the illusion were real. The illusion must be one you retain ongoing control of, such as minor image, and the target must be both visible to you and within or adjacent to the area of your illusion. Using this feat immediately ends the figment's duration.",
					"You must either make a melee touch attack or give the target a saving throw (Fortitude or Reflex) to resist the damage (see below). If you choose a melee touch attack, you use your own melee touch attack bonus, and if you miss, the spell deals no damage. If you choose to allow the target a saving throw, a successful save means it takes half damage. The shadowy attack deals 1d6 points of damage per spell level. If the target disbelieves or sees through the illusion, reduce the damage by half.",
					"The shadowy attack can deal acid, bludgeoning, cold, electricity, fire, piercing, or slashing damage, but the damage must be appropriate to the illusion. For example, an illusory wall that collapses deals bludgeoning damage with a Fortitude save for half, an illusory swordsman strikes with a melee touch attack deals slashing damage, and an illusory wall of fire deals fire damage with a Reflex save for half."
				]
			},
			{
				"-id": "Shadow Ghost",
				"-title": "Shadow Ghost",
				"-groups": "Fetchling",
				"-description": "You can move between the Shadow Plane and the Material Plane more often.",
				"Prerequisites": "Fetchling, shadow walk spell-like ability.",
				"Benefit": [ "You gain the ability to use shadow walk an additional time each day." ],
				"Special": [ "You may select this feat multiple times. Its effects stack." ]
			},
			{
				"-id": "Shadow Grasp",
				"-title": "Shadow Grasp",
				"-groups": "Metamagic",
				"-description": "Your darkness spells have substance and bind your foes.",
				"Prerequisites": "Tenebrous Spell, Umbral Spell.",
				"Benefit": [
					"When you cast a spell with the darkness descriptor that affects an area, creatures in the area are entangled. If the spell allows a saving throw, a successful save negates the entangle effect. If the spell does not normally allow a save, a creature can make a Reflex save (DC = the spell's DC if it had a saving throw) to negate the effect. If the spell allows spell resistance, failing to overcome a creature's spell resistance means it is not entangled. An entangled creature remains so as long as it is in the area of the spell and for 1 round after it leaves. A creature that leaves and reenters the area must make a new saving throw to avoid becoming entangled. Creatures that succeed at a save to resist being entangled do not have to make additional saves if they stay within the darkened area. You are never impeded by the effects of your spells modified by this feat.",
					"Level Increase: +1 (a shadow grasp spell uses up a slot one level higher than the spell's actual level.)"
				]
			},
			{
				"-id": "Shadow Strike",
				"-title": "Shadow Strike",
				"-groups": "Combat",
				"-description": "You accurately strike even those you cannot clearly see.",
				"Prerequisites": "Base attack bonus +1.",
				"Benefit": [ "You can deal precision damage, such as sneak attack damage, against targets with concealment (but not total concealment)." ]
			},
			{
				"-id": "Shadow Walker",
				"-title": "Shadow Walker",
				"-groups": "Fetchling",
				"-description": "You can pierce the veil between the Shadow Plane and the Material Plane more often, and to greater effect.",
				"Prerequisites": "Fetchling, shadow walk spell-like ability.",
				"Benefit": [ "You can expend one use of your shadow walk spell-like ability to use dimension door as a spell-like ability. Your start and end locations for this ability must be in dim light or darkness." ]
			},
			{
				"-id": "Shadows of Fear",
				"-title": "Shadows of Fear",
				"-groups": "Combat",
				"-description": "Your enemies' fear causes them to jump at shadows, diverting their attention.",
				"Prerequisites": "Hidden strike +2d8 or sneak attack +2d6.",
				"Benefit": [ "The first time each round that you hit a creature suffering from a fear effect, you can deal hidden strike or sneak attack damage as if you were flanking that creature (improved uncanny dodge and other effects that prevent flanking also prevent a hidden strike or sneak attack from this feat)." ]
			},
			{
				"-id": "Shadowy Dash",
				"-title": "Shadowy Dash",
				"-groups": "Wayang",
				"Prerequisites": "Wayang.",
				"Benefit": [ "Whenever you are in an area of dim light or darkness, you can move at full speed using Stealth without taking the normal –5 penalty for doing so." ],
				"Normal": [ "When moving at more than half your speed and up to your normal speed, you take a –5 penalty on Stealth checks." ]
			},
			{
				"-id": "Shaitan Earthblast",
				"-title": "Shaitan Earthblast",
				"-groups": "Combat",
				"-description": "With a forceful stomp you release a blast of acid from the earth to burn your enemies.",
				"Prerequisites": "Con 15, Wis 17, Elemental Fist, Improved Unarmed Strike, Shaitan Skin, Shaitan Style, base attack bonus +13 or monk level 11th.",
				"Benefit": [ "While using the Shaitan Style feat, as a standard action, you can spend two Elemental Fist attempts to unleash a 20-foot column of acid that has a 5-foot radius and erupts from a point of origin within 30 feet of you. Creatures caught in the column take your unarmed strike damage plus the acid damage from your Elemental Fist and are staggered for 1 round. A successful Reflex save (DC 10 + 1/2 your character level + your Wis modifier) reduces the damage by half and prevents a target from being staggered" ]
			},
			{
				"-id": "Shaitan Skin",
				"-title": "Shaitan Skin",
				"-groups": "Combat",
				"-description": "You can manipulate acid to shield yourself and disable your enemies.",
				"Prerequisites": "Con 15, Wis 15, Elemental Fist, Improved Unarmed Strike, Shaitan Style, base attack bonus +11 or monk level 9th.",
				"Benefit": [ "You gain one additional Elemental Fist attempt per day. While using the Shaitan Style feat, you gain acid resistance equal to your base attack bonus, or your monk level plus BAB gained from levels in classes other than monk, whichever is higher. While denied your Dexterity bonus to AC you are also denied this resistance. Creatures that take acid damage from your Elemental Fist attack must succeed at a Reflex save (DC 10 + 1/2 your character level + your Wis modifier) or be staggered for 1 round." ]
			},
			{
				"-id": "Shaitan Style",
				"-title": "Shaitan Style",
				"-groups": "Combat,Style",
				"-description": "You strike with the caustic forces from within the earth.",
				"Prerequisites": "Con 13, Wis 15, Elemental Fist, Improved Unarmed Strike, base attack bonus +9 or monk level 5th.",
				"Benefit": [ "You gain one additional Elemental Fist attempt per day. While using the Shaitan Style and Elemental Fist feats to deal acid damage, you gain a bonus on acid damage rolls equal to your Wisdom bonus. Further, if your Elemental Fist melee attack misses while you are using it to deal acid damage, you still deal 1d6 points of acid damage to your target." ]
			},
			{
				"-id": "Shake It Off",
				"-title": "Shake It Off",
				"-groups": "Teamwork",
				"-description": "You support your allies and help them recover from crippling effects.",
				"Benefit": [ "When you are adjacent to one or more allies who also have this feat, you gain a +1 bonus on saving throws per such ally (maximum +4)." ]
			},
			{
				"-id": "Shapeless Familiar",
				"-title": "Shapeless Familiar",
				"-groups": "Animal Companion Feat",
				"-description": "A familiar is more than just an animal. It's a spirit and an intelligence, and your familiar can choose to take more than one physical form.",
				"Prerequisites": "Familiar class feature, caster level 7th.",
				"Benefit": [ "Your familiar gains the change shape universal monster ability. This ability functions as beast shape II and grants access to a single alternate form, which must be the same size as the familiar. Once chosen, this form cannot be changed." ],
				"Special": [ "You can gain this feat multiple times. Each time you take this feat, your familiar gains an additional alternate form. If taken by a familiar that already has the change shape universal monster ability (like an imp), this grants a single additional form." ]
			},
			{
				"-id": "Shapeshifter Foil",
				"-title": "Shapeshifter Foil",
				"-description": "...",
				"Prerequisites": "Knowledge (arcana) 5 ranks or Knowledge (nature) 5 ranks, ability to use any polymorph effect.",
				"Benefit": [ "A creature you deal damage to has difficulty using or maintaining polymorph effects until the end your next turn. To use a polymorph effect it must make a concentration check (DC 15 + twice the level of the effect). If you deal damage to an opponent under a polymorph effect, that opponent must succeed at a Will saving throw (DC 10 + 1/2 your character level + your Wisdom modifier) or be forced back to its original form. If you score a critical hit against such an opponent, no saving throw is allowed." ]
			},
			{
				"-id": "Shapeshifter Savage",
				"-title": "Shapeshifter Savage",
				"-groups": "Combat",
				"-description": "You have enough control over your transformations that you can lash out at an opponent while assuming your alternate form.",
				"Prerequisites": "Shapeshifter Style, Shapeshifter Twist, base attack bonus +8, change shape ability, shapechanger subtype.",
				"Benefit": [ "While you are using Shapeshifter Style, if you use your change shape or wild shape ability as a standard action, you can also make a single melee attack with one of your natural weapons at your highest base attack bonus against one foe within your reach." ],
				"Special": [ "A character with the wild shape class feature counts as having the change shape ability and shapechanger subtype for the purpose of meeting this feat's prerequisites." ]
			},
			{
				"-id": "Shapeshifter Style",
				"-title": "Shapeshifter Style",
				"-groups": "Combat,Style",
				"-description": "You can shift your physiology without fully changing your shape, giving you an advantage in battle.",
				"Prerequisites": "Base attack bonus +3, change shape ability, shapechanger subtype.",
				"Benefit": [
					"You reshape your body, gaining one of the following benefits. You choose the benefit when you enter the style, and while in the style you can change the benefit as a swift action.",
					"Brutal Attack: Choose one of your natural attacks. You gain a +1 bonus on damage rolls with that attack when using this style, plus an additional +1 for every feat you have that lists Shapeshifter Style as a prerequisite (maximum +3).",
					"Steady Grip: You gain a climb speed of 10 feet.",
					"Tensed Sinews: You gain a +1 bonus on Reflex saving throws and a +5 enhancement bonus to your base speed.",
					"Toughened Hide: You gain a +1 enhancement bonus to your existing natural armor bonus."
				],
				"Special": [ "A character with the wild shape class feature counts as having the change shape ability and shapechanger subtype for the purpose of meeting this feat's prerequisites." ]
			},
			{
				"-id": "Shapeshifter Twist",
				"-title": "Shapeshifter Twist",
				"-groups": "Combat",
				"-description": "Your form flexes and contorts in unexpected ways, making it difficult for enemies to move you against your will.",
				"Prerequisites": "Shapeshifter Style, base attack bonus +5, change shape ability, shapechanger subtype.",
				"Benefit": [ "While you are using Shapeshifter Style, you gain a +2 bonus to your CMD versus bull rush, drag, grapple, overrun, reposition, and trip combat maneuvers. If you begin your turn with the grappled condition, you can attempt a combat maneuver check or an Escape Artist check as a move action to attempt to break the grapple." ],
				"Special": [ "A character with the wild shape class feature counts as having the change shape ability and shapechanger subtype for the purpose of meeting this feat's prerequisites." ]
			},
			{
				"-id": "Shapeshifting Hunter",
				"-title": "Shapeshifting Hunter",
				"-description": "You blend your knowledge of foes and your shapeshifting abilities together.",
				"Prerequisites": "Favored enemy class feature, wild shape class feature.",
				"Benefit": [ "Your levels of druid stack with your ranger levels for determining when you select your next favored enemy. Also, your ranger levels stack with your druid levels in determining the number of times per day you can use your wild shape class feature, up to a maximum of eight times per day." ]
			},
			{
				"-id": "Shaping Focus",
				"-title": "Shaping Focus",
				"-description": "Your powers of shapeshifting outstrip your dabbling in the druidic faith.",
				"Prerequisites": "Wild shape class feature, Knowledge (nature) 5 ranks.",
				"Benefit": [ "If you are a multiclassed druid, your wild shape ability is calculated as though your druid level were four higher, to a maximum level equal to your character level." ],
				"Special": [ "This feat has no effect if you are not a multiclassed druid." ]
			},
			{
				"-id": "Share Feature",
				"-title": "Share Feature",
				"-groups": "Animal Companion Feat",
				"-description": "The animal expands its capabilities and learns one of its master's class features.",
				"Prerequisites": "Animal companion, master must have the chosen class feature.",
				"Benefit": [ "Choose one of the following class features: bravery, camouflage, favored terrain, hide in plain sight, resist nature's lure, track, trackless step, venom immunity, and woodland stride. The animal companion gains the benefits of the selected class feature, using its Hit Dice as its level in its master's class for the purpose of this ability; the animal companion gains the benefits of the base class feature, even if the master alters the class feature via an archetype or other means, though the animal companion doesn't count as having the class feature for the purpose of fulfilling prerequisites." ]
			},
			{
				"-id": "Share Healing",
				"-title": "Share Healing",
				"-groups": "Teamwork",
				"-description": "Your link with your companion creature allows you to share with it any healing magic that's cast upon you.",
				"Prerequisites": "Ability to acquire an animal companion, eidolon, familiar, or special mount.",
				"Benefit": [ "When you and your companion creature have this feat, your companion creature is adjacent to you or sharing your square, and you receive the benefit of a healing spell (whether from yourself or another source), you can divide the hit points healed evenly between yourself and your companion creature." ]
			},
			{
				"-id": "Shared Insight",
				"-title": "Shared Insight",
				"-description": "You deftly direct others' attentions where you wish.",
				"Prerequisites": "Wis 13, half-elf.",
				"Benefit": [ "As a move action, you can grant all friendly creatures within 30 feet who can see or hear you a +2 bonus on Perception checks for a number of rounds equal to your Wisdom modifier (minimum 1 round)." ]
			},
			{
				"-id": "Shared Judgment",
				"-title": "Shared Judgment",
				"-description": "...",
				"Prerequisites": "Second judgment class feature.",
				"Benefit": [ "You can pronounce a single judgment and extend its effects to one adjacent ally instead of pronouncing a second judgment. Similarly, once you have the third judgment class feature, you can pronounce a single judgment and extend its effects to two adjacent allies instead of pronouncing a second and third judgment. Alternatively, once you have the third judgment class feature, you can pronounce two judgments and extend the effects of one judgment to one adjacent ally instead of pronouncing a third judgment. Once an ally has gained the effects of your judgment, he need not remain adjacent to you to continue gaining that benefit. You can spend a free action to end this benefit for one or both allies. If your judgment bonus is suspended for you, it is suspended for all allies, but when it resumes, it does so for all allies." ]
			},
			{
				"-id": "Shared Manipulation",
				"-title": "Shared Manipulation",
				"-groups": "Half-Elf",
				"Prerequisites": "Cha 13, half-elf.",
				"Benefit": [ "As a move action, you can grant all friendly creatures within 30 feet who can see or hear you a +2 bonus on Bluff or Intimidate checks (choose which skill to affect each time you use this ability) for a number of rounds equal to your Charisma modifier (minimum 1 round)." ]
			},
			{
				"-id": "Shared Quarry",
				"-title": "Shared Quarry",
				"-groups": "Combat",
				"-description": "When working together, you and your companions are skilled at taking down particular targets.",
				"Prerequisites": "Hunter's bond class feature, quarry class feature.",
				"Benefit": [
					"Allies sharing your favored enemy bonuses from hunter's bond gain an additional benefit against a creature you've denoted as your quarry. Affected allies gain a +1 insight bonus on attack rolls against your quarry; this bonus increases to +4 on attack rolls to confirm critical hits against your quarry.",
					"If your hunter's bond is with an animal companion, your companion gains the full benefits of your quarry class feature. when you denote a quarry."
				]
			},
			{
				"-id": "Shared Soul",
				"-title": "Shared Soul",
				"-description": "You and your phantom are deeply connected in heart, mind, and soul.",
				"Prerequisites": "Shared consciousness class feature.",
				"Benefit": [
					"While your phantom is confined within your consciousness, you gain a +2 bonus on saving throws against death effects, energy drain, and possession.",
					"In addition, once per day when you fail a saving throw against a death effect or possession effect or gain a negative level, as an immediate action you can shunt that effect into the phantom's section of your soul instead.",
					"When you do so, you are not affected by that effect, but you also don't gain any of the normal benefits of your shared consciousness ability and can't manifest your phantom in any way for the normal duration of the spell or effect shunted into the phantom's consciousness. The phantom suffers the full effect you transferred, and as long as your phantom continues to suffer from the effect, You cannot shunt a death or possession effect or negative level onto your phantom."
				]
			},
			{
				"-id": "Shark Leap",
				"-title": "Shark Leap",
				"-groups": "Combat",
				"-description": "Like a deadly predator, you bolt at unsuspecting foes from below.",
				"Prerequisites": "Improved Unarmed Strike, Shark Style, Shark Tear, Swim 10 ranks, base attack bonus +10 or monk level 10th.",
				"Benefit": [ "While in Shark Style, when you're underwater with neutral, rising, or swiftly rising buoyancy, you can perform a terrifying leap to attack opponents directly above you. This works similarly to the charge action, except you can move only straight up, and you make a single piercing unarmed strike or bite attack. If the attack hits, it deals double damage; if the attack roll's result is also higher than 11 + the target's Swim modifier, the attack knocks the target off-balance until its next turn. Like with a charge, you can perform a partial version when limited to a single standard action (such as in the surprise round); in addition to moving half as far as normal for a partial charge, the attack doubles only the damage dice (as per Vital Strike) rather than the full damage roll." ]
			},
			{
				"-id": "Shark Style",
				"-title": "Shark Style",
				"-groups": "Combat,Style",
				"-description": "You fight like a shark, shredding your foes.",
				"Prerequisites": "Improved Unarmed Strike, Swim 3 ranks, base attack bonus +3 or monk level 3rd.",
				"Benefit": [ "You can deal piercing or bludgeoning damage with your unarmed strikes. Your piercing unarmed strikes and bite attacks deal an additional 1d6 points of bleed damage." ]
			},
			{
				"-id": "Shark Tear",
				"-title": "Shark Tear",
				"-groups": "Combat",
				"-description": "You tear into bleeding foes and can smell their blood in the water.",
				"Prerequisites": "Improved Unarmed Strike, Shark Style, Swim 6 ranks, base attack bonus +6 or monk level 6th.",
				"Benefit": [ "While in Shark Style, you gain scent while in water, but only against bleeding creatures. You also gain a +1 bonus on attack and damage rolls against bleeding creatures." ]
			},
			{
				"-id": "Sharp Senses",
				"-title": "Sharp Senses",
				"-description": "Your senses are especially sharp, even for your kind.",
				"Prerequisites": "Keen senses racial trait.",
				"Benefit": [ "You receive a +4 racial bonus on Perception skill checks. This replaces the normal bonus from the keen senses racial trait." ],
				"Normal": [ "The keen senses trait normally grants a +2 racial bonus on Perception skill checks." ]
			},
			{
				"-id": "Sharpclaw",
				"-title": "Sharpclaw",
				"-groups": "Combat, Ratfolk",
				"Prerequisites": "Ratfolk.",
				"Benefit": [ "You gain two claw attacks. These are primary natural attacks that deal 1d4 points of damage." ]
			},
			{
				"-id": "Shatter Control",
				"-title": "Shatter Control",
				"-groups": "Combat",
				"-description": "You can infuse your attacks with divine power capable of harming the undead and shattering the bond between the undead and its controller.",
				"Prerequisites": "Channel positive energy 4d6.",
				"Benefit": [
					"As a special full-round action, you can make a single melee attack against an undead creature or a single ranged attack against an undead creature within 30 feet.",
					"If the attack is successful, you deal your normal damage with the melee or ranged attack to your undead target. If the target undead creature is being controlled by another, by way of spell, because the target undead creature is an unintelligent undead controlled by that creature, or is under command of another undead creature, and if the controlling creature is within 120 feet of you when you make the attack, the controlling creature must succeed at a Will save (DC = 10 + 1/2 your level + your Cha modifier) or immediately lose control of the targeted undead for 10 minutes. While under this effect, the targeted undead is immediately compelled to seek out and attack its former controller until the control is regained."
				]
			},
			{
				"-id": "Shatter Defenses",
				"-title": "Shatter Defenses",
				"-groups": "Combat",
				"-description": "Your skill with your chosen weapon leaves opponents unable to defend themselves if you strike them when their defenses are already compromised.",
				"Prerequisites": "Weapon Focus, Dazzling Display, base attack bonus +6, proficiency with weapon.",
				"Benefit": [ "Any shaken, frightened, or panicked opponent hit by you this round is flat-footed to your attacks until the end of your next turn. This includes any additional attacks you make this round." ]
			},
			{
				"-id": "Shatter Mental Mask",
				"-title": "Shatter Mental Mask",
				"-groups": "Combat",
				"-description": "You are adept at ripping away an opponent's mental mask, exposing its true visage during a psychic duel.",
				"Prerequisites": "Psychic Sensitivity or ability to cast psychic spells or use psychic spell-like abilities, character level 2nd.",
				"Benefit": [ "While in a psychic duel, when you create an offensive manifestation that can be negated or halved only with a successful Will saving throw, if your opponent fails that Will saving throw, its mental mask is shattered, revealing the opponent's true form." ],
				"Special": [ "If you possess the Third Eye feat, your opponent's mental mask is shattered even on a successful Will saving throw." ]
			},
			{
				"-id": "Shatter Resolve",
				"-title": "Shatter Resolve",
				"-description": "Damaging a foe with negative energy causes despair.",
				"Prerequisites": "Channel negative energy class feature, worshiper of an evil god.",
				"Benefit": [ "When you damage a creature by channeling negative energy, you fill it with fear. A creature that is affected by your channel negative energy ability and fails its Will save to halve the damage also becomes shaken for a number of rounds equal to the number of dice used to calculate the damage caused by the channel energy ability (so if you deal 1d6 points of damage, the condition lasts 1 round; if 2d6 points of damage, then 2 rounds, and so on)." ]
			},
			{
				"-id": "Shatterspell",
				"-title": "Shatterspell",
				"-groups": "Combat, Dwarf",
				"Prerequisites": "Disruptive, Spellbreaker, dwarf, 10th-level fighter.",
				"Benefit": [ "As a standard action, you can attempt to sunder an ongoing spell effect as if you had the spell sunder rage power. You may use this feat once per day, plus one additional time per day for every 5 points by which your base attack bonus exceeds +10." ]
			},
			{
				"-id": "Shield Focus",
				"-title": "Shield Focus",
				"-groups": "Combat",
				"-description": "You are skilled at deflecting blows with your shield.",
				"Prerequisites": "Shield Proficiency, base attack bonus +1.",
				"Benefit": [ "Increase the AC bonus granted by any shield you are using by 1." ]
			},
			{
				"-id": "Shield Gauntlet Style",
				"-title": "Shield Gauntlet Style",
				"-groups": "Combat,Style",
				"-description": "You use your gauntlet to shield you from harm.",
				"Prerequisites": "Weapon Focus (gauntlet or spiked gauntlet), proficiency with bucklers and light shields.",
				"Benefit": [ "When using this style, if you begin your turn wearing a gauntlet or spiked gauntlet on your off hand, and you are not using that hand to hold or make attacks with any other weapons or shield, you gain a +1 shield bonus to AC. You lose this shield bonus whenever you attack with your gauntlet or hold a weapon or shield in that hand. While receiving this shield bonus to AC, your gauntlet or spiked gauntlet is treated as a buckler for the purpose of using other feats and abilities (though you are also considered to have a free hand). This feat acts as the Improved Unarmed Strike feat for the purpose of satisfying the prerequisites of the Deflect Arrows and Snatch Arrows feats." ]
			},
			{
				"-id": "Shield Master",
				"-title": "Shield Master",
				"-groups": "Combat",
				"-description": "Your mastery of the shield allows you to fight with it without hindrance.",
				"Prerequisites": "Improved Shield Bash, Shield Proficiency, Shield Slam, Two-Weapon Fighting, base attack bonus +11.",
				"Benefit": [
					"You do not suffer any Two-Weapon Fighting penalties on attack rolls made with a shield while you are wielding another weapon. Add your shield's enhancement bonus to attack and damage rolls made with the shield as if it were a weapon enhancement bonus.",
					"Editor's Note",
					"This only applies to Two-Weapon Fighting since FAQ, originally applied to all penalties."
				]
			},
			{
				"-id": "Shield Proficiency",
				"-title": "Shield Proficiency",
				"-groups": "Combat",
				"-description": "You are trained in how to properly use a shield.",
				"Benefit": [ "When you use a shield (except a tower shield), the shield's armor check penalty only applies to Strength- and Dexterity-based skills." ],
				"Normal": [ "When you are using a shield with which you are not proficient, you take the shield's armor check penalty on attack rolls and on all skill checks that involve moving." ],
				"Special": [ "Barbarians, bards, clerics, druids, fighters, paladins, and rangers all automatically have Shield Proficiency as a bonus feat. They need not select it." ]
			},
			{
				"-id": "Shield Slam",
				"-title": "Shield Slam",
				"-groups": "Combat",
				"-description": "In the right position, your shield can be used to send opponents flying.",
				"Prerequisites": "Improved Shield Bash, Shield Proficiency, Two-Weapon Fighting, base attack bonus +6.",
				"Benefit": [ "Any opponents hit by your shield bash are also hit with a free bull rush attack, substituting your attack roll for the combat maneuver check (see Combat). This bull rush does not provoke an attack of opportunity. Opponents who cannot move back due to a wall or other surface are knocked prone after moving the maximum possible distance. You may choose to move with your target if you are able to take a 5-foot step or to spend an action to move this turn." ]
			},
			{
				"-id": "Shield Snag",
				"-title": "Shield Snag",
				"-groups": "Combat",
				"-description": "You know how to navigate your shield around weapons and can use it to keep your balance.",
				"Prerequisites": "Improved Shield Bash, Shield Proficiency, Two-Weapon Fighting, base attack bonus +6.",
				"Benefit": [
					"Any opponents hit by your shield bash are also targeted by a free disarm attempt, substituting your attack roll for the combat maneuver check. This disarm attempt does not provoke an attack of opportunity. You cannot use this ability during the same round as a bull rush attempt made with Shield Slam or with any other abilities that affect how your shield bash works.",
					"When using a shield, you gain a +4 bonus on Strength checks to avoid being blown away by a strong wind and on Climb checks to catch yourself on a wall or slope when falling."
				]
			},
			{
				"-id": "Shield Specialization",
				"-title": "Shield Specialization",
				"-groups": "Combat",
				"-description": "You have mastered the use of one type of shield.",
				"Prerequisites": "Proficiency with selected shield, Shield Focus, fighter level 4th.",
				"Benefit": [ "Choose one type of shield (buckler, light, heavy, or tower shield). With the selected shield, you gain a +2 bonus to your Armor Class against critical hit confirmation rolls. In addition, you may add your base shield bonus (including the bonus from Shield Focus but not including enhancement bonuses) to your CMD." ],
				"Special": [ "You can gain this feat multiple times. Its effects do not stack. Each time you take the feat, it applies to a new type of shield." ]
			},
			{
				"-id": "Shield Wall",
				"-title": "Shield Wall",
				"-groups": "Combat,Teamwork",
				"-description": "You form a unified defense with those around you.",
				"Prerequisites": "Shield Proficiency.",
				"Benefit": [
					"Whenever you are wielding a shield and are adjacent to an ally wielding a shield who also has this feat, the AC bonus from your shield increases, depending on the shield wielded by your ally.",
					"You keep these bonuses even if your ally loses his shield bonus due to making a shield bash attack.",
					"If an adjacent ally with this feat uses a tower shield to grant total cover, you also benefit if an attack targeting you passes through the edge of the shield."
				]
			},
			{
				"-id": "Shield of Swings",
				"-title": "Shield of Swings",
				"-groups": "Combat",
				"-description": "A wild frenzy of attacks serves to bolster your defenses.",
				"Prerequisites": "Str 13, Power Attack, base attack bonus +1.",
				"Benefit": [ "When you take a full-attack action while wielding a two-handed weapon, you can choose to reduce the damage by 1/2 to gain a +4 shield bonus to AC and CMD until the beginning of your next turn. The reduction in damage applies until the beginning of your next turn." ]
			},
			{
				"-id": "Shielded Gauntlet Attack",
				"-title": "Shielded Gauntlet Attack",
				"-groups": "Combat",
				"-description": "Your gauntlet helps you take advantage of weakness.",
				"Prerequisites": "Shield Gauntlet Style, Weapon Focus (gauntlet or spiked gauntlet), proficiency with bucklers and light shields.",
				"Benefit": [ "While using Shield Gauntlet Style, you can calculate the damage of your gauntlet or spiked gauntlet using the sacred weapon damage value of a warpriest with a level 4 less than your base attack bonus. The style also allows you to take one attack of opportunity each round that does not count toward your maximum number of attacks of opportunity. This must be used to make an attack with your gauntlet (or spiked gauntlet), or a disarm or steal combat maneuver. You do not provoke an attack of opportunity for performing either combat maneuver, and you are able to attempt a steal combat maneuver with this attack of opportunity despite the maneuver normally requiring a standard action." ]
			},
			{
				"-id": "Shielded Gauntlet Master",
				"-title": "Shielded Gauntlet Master",
				"-groups": "Combat",
				"Prerequisites": "Shielded Gauntlet Attack, Shield Gauntlet Style, Weapon Focus (gauntlet or spiked gauntlet), proficiency with bucklers and light shields.",
				"Benefit": [ "While using Shield Gauntlet Style, you no longer lose your shield bonus to AC when you attack with your gauntlet (or spiked gauntlet) or use it to hold a weapon. In addition, you add your gauntlet's enhancement bonus to the shield bonus to AC granted by this feat as if it were a shield enhancement bonus." ]
			},
			{
				"-id": "Shielded Staff Ambush",
				"-title": "Shielded Staff Ambush",
				"-groups": "Combat",
				"-description": "You can hit an enemy unexpectedly with a maneuver.",
				"Prerequisites": "Dex 15, Shielded Staff Style, Two-Weapon Fighting, base attack bonus +4.",
				"Benefit": [ "While in Shielded Staff Style, if you hit a target with a shielded staff, you can attempt either a bull rush, disarm, sunder, or trip combat maneuver check as an immediate action. You lose your shield bonus until the start of your next turn if you attempt this combat maneuver." ]
			},
			{
				"-id": "Shielded Staff Master",
				"-title": "Shielded Staff Master",
				"-groups": "Combat",
				"-description": "Your staff and shield act as a single item.",
				"Prerequisites": "Dex 17, Improved Two-Weapon Fighting, Shielded Staff Style, Two-Weapon Fighting, base attack bonus +8.",
				"Benefit": [
					"While using Shielded Staff Style, you add the attached buckler's or shield's enhancement bonus (if any) to the shield bonus you gain from this style.",
					"In addition, you do not take the -1 penalty to attacks made with a shielded staff. If both your shield and weapon have an enhancement bonus, use the higher of the two bonuses to determine your shielded staff's enhancement bonus to attack and damage rolls."
				]
			},
			{
				"-id": "Shielded Staff Style",
				"-title": "Shielded Staff Style",
				"-groups": "Combat,Style",
				"-description": "You can attack and defend effectively with a shield attached to your staff or spear.",
				"Prerequisites": "Dex 15, Two-Weapon Fighting, Weapon Focus (quarterstaff, any weapon from the polearms fighter weapon group, or any weapon from the spears fighter weapon group), proficiency with bucklers and light shields.",
				"Benefit": [
					"When you enter this style, you attach your buckler or light shield to your quarterstaff, polearm, or spear, combining them into a weapon known as a shielded staff. While in this style, you can wield the shielded staff normally, but attacks you make with it take a -1 penalty. As long as you wield the shielded staff with two hands, you gain a +2 shield bonus to your AC (regardless of the shield or buckler's enhancement bonus). You can't make shield bash attacks with the attached buckler or shield, and detaching the buckler or shield from the weapon is a move action that provokes attacks of opportunity.",
					"The weapon and attached shield count as separate objects for the purposes of abilities or effects that target objects, except for disarm attempts, which treat the shielded staff as a single object. Anyone not in this style who attempts to wield the shielded staff treats it as an improvised weapon that deals bludgeoning damage."
				]
			},
			{
				"-id": "Shifter's Edge",
				"-title": "Shifter's Edge",
				"-description": "You use your shapechanging powers to make your natural attacks especially lethal.",
				"Prerequisites": "Dex 13, Weapon Finesse, shifter claws class feature.",
				"Benefit": [ "Whenever you use Weapon Finesse to make a melee attack with your claws or a natural attack augmented by your claws, and you use your Dexterity bonus on attack rolls and your Strength modifier on damage rolls, you also add half your shifter level to the damage." ]
			},
			{
				"-id": "Shifter's Rush",
				"-title": "Shifter's Rush",
				"-description": "You can use you wild shape ability as you are moving toward your enemy.",
				"Prerequisites": "Wild shape class feature, shifter level 4th",
				"Benefit": [ "When you use a move action to move 10 feet or more or when you charge, you can use wild shape as a free action during that movement." ]
			},
			{
				"-id": "Shikigami Manipulation",
				"-title": "Shikigami Manipulation",
				"-groups": "Combat",
				"-description": "You channel a magic item's power to enhance its improvised attacks, even though it was never meant to be used as a weapon.",
				"Prerequisites": "Catch Off-Guard or Throw Anything, Shikigami Mimicry, Shikigami Style, Use Magic Device 5 ranks.",
				"Benefit": [ "While using Shikigami Style, you can treat any magical item you're using as an improvised weapon as if it granted an enhancement bonus on attack and damage rolls equal to the item's caster level divided by 4 (minimum +1), to a maximum bonus of +5." ],
				"Special": [ "A character with this feat and Equipment Trick who uses magical equipment to perform a trick can add a bonus equal to the item's caster level divided by 4 (minimum +1) on skill or combat maneuver checks attempted as part of the trick." ]
			},
			{
				"-id": "Shikigami Mimicry",
				"-title": "Shikigami Mimicry",
				"-groups": "Combat",
				"-description": "Your unique understanding of improvised tools enables you to turn the intrinsic form of all manner of objects to your advantage in combat.",
				"Prerequisites": "Catch Off-Guard or Throw Anything, Shikigami Style.",
				"Benefit": [ "While in Shikigami Style, you can take a -2 penalty on attack rolls to treat an improvised weapon as if it had one of the following weapon special qualities until the start of your next turn: blocking, brace, disarm, distracting, nonlethal, performance, or trip. If the weapon has the fragile special quality or broken condition, you can treat it as if it had the jagged special quality." ]
			},
			{
				"-id": "Shikigami Style",
				"-title": "Shikigami Style",
				"-groups": "Combat,Style",
				"-description": "Your skill with improvised weapons makes them more dangerous than they would otherwise be.",
				"Prerequisites": "Catch Off-Guard or Throw Anything.",
				"Benefit": [ "While in this style, you deal damage with improvised weapons as if they were one size category larger. For every style feat you have that lists Shikigami Style as a prerequisite, treat the improvised weapon as an additional size category larger, to a maximum of three sizes larger than its actual size." ]
			},
			{
				"-id": "Shocking Amplification",
				"-title": "Shocking Amplification",
				"-description": "Your electricity spells tire their targets.",
				"Benefit": [ "Whenever you cast a spell with the electricity descriptor that targets one or more creatures, you can take a –1 penalty on attack rolls made with the spell and reduce the spell's saving throw DC by 1 to cause the target closest to you that is dealt electricity damage by the spell to become fatigued for 1 round. This cannot cause a creature that is already fatigued to become exhausted. You must choose to use this feat before making an attack roll or before your target attempts its saving throw. This feat has no effect on spells that neither allow a saving throw nor require an attack roll." ]
			},
			{
				"-id": "Shocking Bellow",
				"-title": "Shocking Bellow",
				"-groups": "Combat",
				"-description": "You can demoralize a foe with a sudden ferocious scream.",
				"Prerequisites": "Intimidating Prowess.",
				"Benefit": [ "If you act in the surprise round of a combat, as a free action you can attempt a single Intimidate check to demoralize a creature within 30 feet that can clearly see or hear you." ]
			},
			{
				"-id": "Shot on the Run",
				"-title": "Shot on the Run",
				"-groups": "Combat",
				"-description": "You can move, fire a ranged weapon, and move again before your foes can react.",
				"Prerequisites": "Dex 13, Dodge, Mobility, Point-Blank Shot, base attack bonus +4.",
				"Benefit": [ "As a full-round action, you can move up to your speed and make a single ranged attack at any point during your movement." ],
				"Normal": [ "You cannot move before and after an attack with a ranged weapon." ]
			},
			{
				"-id": "Shrapnel Strike",
				"-title": "Shrapnel Strike",
				"-groups": "Combat",
				"-description": "You can bash things to damage nearby opponents.",
				"Prerequisites": "Str 15, Improved Sunder, Power Attack.",
				"Benefit": [
					"When you attempt a Strength check to break an object that can shatter (nothing made of paper, cloth, leather, or other soft, pliable material), you gain a bonus on the Strength check equal to your base attack bonus. If you surpass the object's break DC, you can send shards of its material f lying out in all directions, dealing an amount of piercing, slashing, and bludgeoning damage equal to 1d4 plus 1 point per point of the object's hardness to all creatures within 10 feet of the object, including yourself.",
					"A successful Reflex save (DC = 10 + 1/2 your Hit Dice + your Strength modifier) halves the damage."
				]
			},
			{
				"-id": "Shrewd Tactician",
				"-title": "Shrewd Tactician",
				"-groups": "Combat",
				"-description": "Your dealings with pirates, thieves, and assassins have taught you to be exceedingly careful.",
				"Prerequisites": "Alertness, Combat Reflexes.",
				"Benefit": [
					"Opponents do not gain a +2 bonus on attack rolls for flanking you, although they can still sneak attack you. You also gain a +3 bonus on Sense Motive checks made to resist a foe's Bluff checks to feint in combat.",
					"Combat Trick",
					"Source PPC:WMH",
					"Note If using the optional Stamina Pool rules, the following trick may be used with this feat.",
					"Combat Trick: When an opponent attempts a feint against you, you can spend up to 5 stamina points to increase the DC of the skill check made to feint by 1 per point of stamina spent."
				]
			},
			{
				"-id": "Shrouded In Mystery",
				"-title": "Shrouded In Mystery",
				"-description": "Common folk have many superstitious rumors about your kind—tall tales born out of ignorance and fear alike. Whether or not what they say about your race is true is irrelevant, as you use their beliefs to take advantage of them whenever you can.",
				"Prerequisites": "Bluff 1 rank; Disguise 1 rank; kitsune, nagaji, samsaran, tengu, or wayang.",
				"Benefit": [ "You gain a +2 insight bonus on Will saves against mind-affecting spells and effects and a +3 insight bonus on Bluff checks. Both benefits apply only against humanoid creatures of races other than your own." ]
			},
			{
				"-id": "Shrug On",
				"-title": "Shrug On",
				"-groups": "Combat",
				"-description": "You can throw on the most important element of your armor in a flash.",
				"Prerequisites": "Base attack bonus +1, medium armor proficiency.",
				"Benefit": [
					"As a full-round action, you can shrug yourself into the largest and most protective section of a suit of armor with which you are proficient. The armor does not grant any magical benefits in this state, and its armor check penalty and maximum Dexterity bonus to AC are both 2 worse than normal. When donned using this feat, medium armor grants a +3 armor bonus, and heavy armor grants a +5 armor bonus.",
					"Light armor grants no armor bonus when donned using this feat."
				]
			},
			{
				"-id": "Sickening Critical",
				"-title": "Sickening Critical",
				"-groups": "Combat",
				"-description": "Your critical hits cause opponents to become sickened.",
				"Prerequisites": "Critical Focus, base attack bonus +11.",
				"Benefit": [ "Whenever you score a critical hit, your opponent becomes sickened for 1 minute. The effects of this feat do not stack. Additional hits instead add to the effect's duration." ],
				"Special": [ "You can only apply the effects of one critical feat to a given critical hit unless you possess Critical Mastery." ]
			},
			{
				"-id": "Sickening Spell",
				"-title": "Sickening Spell",
				"-groups": "Metamagic",
				"-description": "You can sicken creatures with your spells.",
				"Benefit": [
					"You can modify a spell to sicken a creature damaged by the spell. When a creature takes damage from this spell, they become sickened for a number of rounds equal to the original level of the spell. If the spell allows a saving throw, a successful save negates the sickening effect. If the spell does not allow a save, the target can make a Fortitude save to negate the sickening effect. If the spell effect also causes the creature to become sickened, the duration of this metamagic effect is added on to the duration of the spell.",
					"Level Increase: +2 (a sickening spell uses up a spell slot two levels higher than the spell's actual level.)",
					"Spells that do not inflict damage do not benefit from this feat."
				]
			},
			{
				"-id": "Sidestep",
				"-title": "Sidestep",
				"-groups": "Combat",
				"-description": "You can reposition yourself after a foe's missed swing.",
				"Prerequisites": "Dex 13, Dodge, Mobility.",
				"Benefit": [ "Whenever an opponent misses you with a melee attack, you may move 5 feet as an immediate action so long as you remain within that opponent's threatened area. This movement does not provoke attacks of opportunity. If you take this step, you cannot take a 5-foot step during your next turn. If you take an action to move during your next turn, subtract 5 feet from your total movement." ]
			},
			{
				"-id": "Siege Commander",
				"-title": "Siege Commander",
				"-groups": "Combat",
				"-description": "Under your leadership, the time required to assemble and move a siege engine is greatly reduced.",
				"Prerequisites": "Craft (siege weapon) 5 ranks, Knowledge (engineering) 5 ranks or Profession (siege engineer) 1 rank.",
				"Benefit": [ "When you lead a siege engine assembly crew, you grant all of its members a +4 competence bonus on checks to assemble or move the weapon. You also halve the time required to assemble a siege engine." ]
			},
			{
				"-id": "Siege Engineer",
				"-title": "Siege Engineer",
				"-groups": "Combat",
				"-description": "You are proficient with all siege weaponry.",
				"Prerequisites": "Knowledge (engineering) 5 ranks or Profession (siege engineer) 5 ranks, proficiency with one siege engine.",
				"Benefit": [ "You are considered to be proficient with all siege weapons. Also, when you are crew lead for a siege engine, you do not generate mishaps on the roll of a natural 1." ],
				"Normal": [ "Each siege engine is an exotic weapon." ]
			},
			{
				"-id": "Siege Gunner",
				"-title": "Siege Gunner",
				"-groups": "Combat",
				"-description": "Aiming outsized siege weapons poses little difficulty for you.",
				"Prerequisites": "Siege Engineer, Profession (siege engineer) 5 ranks.",
				"Benefit": [ "You take no size penalty for aiming a direct-fire siege weapon larger than yourself. If you operate an indirect-fire siege weapon and miss, you misdirect fire by 1 square per range increment." ],
				"Normal": [ "Direct-fire weapons impose a -2 attack roll penalty per size category by which the weapon is larger than the creature aiming it. An indirect-fire weapon that misses misdirects fire by 1d4 squares per range increment." ]
			},
			{
				"-id": "Signature Deed",
				"-title": "Signature Deed",
				"-groups": "Grit",
				"-description": "You are known for performing a particular deed, and can perform it with greater ease.",
				"Prerequisites": "Grit class feature, gunslinger level 11th.",
				"Benefit": [
					"Pick a deed that you have access to and that you must spend grit to perform. Once per round, you can perform this deed for 1 fewer grit point (minimum 0).",
					"You can reduce the cost of a deed in this way only if you have at least 1 grit point."
				]
			},
			{
				"-id": "Signature Strike Style",
				"-title": "Signature Strike Style",
				"-groups": "Combat,Style",
				"-description": "Your accuracy when attacking is both delightfully artistic and chillingly deadly.",
				"Prerequisites": "Precise Shot; Weapon Focus; base attack bonus +7; Intimidate 7 ranks; Improved Called Shot, targeted strike swashbuckler deed, or targeting gunslinger deed.",
				"Benefit": [
					"Each creature you hit using a called shot, the targeted strike swashbuckler deed, or the targeting gunslinger deed must succeed at a Will save or be shaken for 1d3 rounds (DC = 10 + half your character level + your Charisma modifier).",
					"You must be using this style and attacking with a weapon for which you have Weapon Focus to gain this benefit. This is a fear effect that doesn't stack with itself or with other fear effects. If a creature is already shaken and you make it shaken using this feat, the duration of the shaken condition is merely extended.",
					"If this attack deals damage, you can also have the injury leave a distinctive mark, such as a letter, shape, or other simple symbol. This mark heals naturally and disappears once the target has healed the damage dealt by your attack.",
					"As a free action after the attack, you can spend 1 grit point or 1 panache point to make the mark heal as a permanent scar unless the target succeeds at a Fortitude save (DC = 10 + half your character level + your Charisma modifier). You gain a +2 bonus on Perception checks to see through the disguises of creatures that bear your mark."
				]
			},
			{
				"-id": "Signature Strike Taunt",
				"-title": "Signature Strike Taunt",
				"-groups": "Combat",
				"-description": "Your mocking strikes leave your foe deeply embarrassed and infuriated.",
				"Prerequisites": "Precise Shot, Signature Strike Style, Weapon Focus, base attack bonus +9, Intimidate 9 ranks.",
				"Benefit": [ "Creatures that gain the shaken condition as a result of Signature Strike Style also take a -2 penalty to AC for the duration of the shaken condition that feat causes. While the shaken condition persists, you do not provoke attacks of opportunity when performing combat maneuvers against that target." ]
			},
			{
				"-id": "Signature Strike Triumph",
				"-title": "Signature Strike Triumph",
				"-groups": "Combat",
				"-description": "With an effortless flourish, you strike terror into your foes and inspire your allies.",
				"Prerequisites": "Precise Shot, Signature Strike Style, Signature Strike Taunt, Weapon Focus, base attack bonus +11, Intimidate 11 ranks.",
				"Benefit": [
					"When you use Signature Strike Style to give a creature the shaken condition, increase the duration to 1d4+1 rounds. When you confirm a critical hit against a creature marked by your Signature Strike Style, one ally within 60 feet who can see you can attempt a new saving throw against one ongoing effect with the emotion, fear, or mind-affecting descriptor caused by the marked creature.",
					"If the ally succeeds at this saving throw and the effect's remaining duration is 24 hours or less, the effect ends; if the remaining duration is more than 24 hours, the effect is suppressed for 1 minute."
				]
			},
			{
				"-id": "Signifer Armor Training",
				"-title": "Signifer Armor Training",
				"-description": "You have learned the art of spellcasting while wearing signifer armor.",
				"Prerequisites": "Arcane Armor Mastery, Arcane Armor Training, Heavy Armor Proficiency, caster level 7th, must swear allegiance to a single Hell Knight order.",
				"Benefit": [ "As a swift action, you can reduce the arcane spell failure chance due to the armor you are wearing by 30% for any spells you cast this round. This benefit applies only if you are wearing armor with “Hell Knight” in its name. This bonus replaces, and does not stack with, the bonuses granted by Arcane Armor Mastery, Arcane Armor Training, and similar feats and effects." ]
			},
			{
				"-id": "Silent Kill",
				"-title": "Silent Kill",
				"-groups": "Combat",
				"-description": "You are quite adept at killing your prey without making noise or alerting others.",
				"Prerequisites": "Stealth 12 ranks; assassinate advanced slayer talent or ninja master trick.",
				"Benefit": [ "When you kill a creature during a surprise round, you can attempt a Stealth check, opposed by the Perception checks of potential observers, to prevent them from noticing your action and subsequently identifying you as the assailant." ]
			},
			{
				"-id": "Silent Spell",
				"-title": "Silent Spell",
				"-groups": "Metamagic",
				"-description": "You can cast your spells without making any sound.",
				"Benefit": [
					"A silent spell can be cast with no verbal components. Spells without verbal components are not affected.",
					"Level Increase: +1 (a silent spell uses up a spell slot one level higher than the spell's actual level.)"
				],
				"Special": "Bard spells cannot be enhanced by this feat."
			},
			{
				"-id": "Simple Weapon Proficiency",
				"-title": "Simple Weapon Proficiency",
				"-groups": "Combat",
				"-description": "You are trained in the use of basic weapons.",
				"Benefit": [ "You make attack rolls with simple weapons without penalty." ],
				"Normal": [ "When using a weapon with which you are not proficient, you take a -4 penalty on attack rolls." ],
				"Special": [ "All characters except for druids, monks, and wizards are automatically proficient with all simple weapons. They need not select this feat." ]
			},
			{
				"-id": "Sin Seer",
				"-title": "Sin Seer",
				"-description": "Unlike others who have taken the oath against undeath, your preoccupation with the undead does not cloud your view of good and evil.",
				"Prerequisites": "Detect undead paladin class feature.",
				"Benefit": [ "You gain the detect evil class feature. You may use it or the detect undead class feature, but not at the same time." ]
			},
			{
				"-id": "Sin-Sharing Critical",
				"-title": "Sin-Sharing Critical",
				"-groups": "Combat",
				"-description": "Your hateful focus can sometimes spread your own misfortune to others in combat.",
				"Prerequisites": "Critical Focus, base attack bonus +13.",
				"Benefit": [
					"Whenever you confirm a critical hit against an opponent, you can choose a single curse effect currently affecting you to also affect the target. The target can negate this magical effect with a successful Will save (DC = 10 + your base attack bonus). If you are currently affected by multiple curses, you choose which one affects the target.",
					"This transferred curse affects the target exactly as it affects you, except that it lasts 1d4 minutes or the remaining duration of the curse affecting you, whichever is less. If the target succeeds at its Will save, or if you are not suffering from any curse effects, the target instead rolls twice on its next ability check, attack roll, saving throw, or skill check and takes the less favorable result. This is a curse effect."
				],
				"Special": [ "You can apply the effects of only one critical feat to a given critical hit unless you have Critical Mastery." ]
			},
			{
				"-id": "Sisterhood Dedication",
				"-title": "Sisterhood Dedication",
				"-groups": "Combat",
				"-description": "An elite member of the sisterhood is an inspiration to her fellow women, both invigorating their spirits and effortlessly coordinating their tactics.",
				"Prerequisites": "Cha 13, Shield Focus, Shield Wall, Sisterhood Rampart, Sisterhood Style, Weapon Focus (longsword), base attack bonus +6.",
				"Benefit": [ "While you're using Sisterhood Style and wielding a longsword and either a light or heavy shield, the bonus on saving throws from Sisterhood Style increases to +2 and you grant half that bonus to all allies within 20 feet. In addition, you can choose up to two teamwork feats you have when entering the Sisterhood Style stance. As a swift action, you can grant one of those feats to two allies within 20 feet until the beginning of your next turn, or you can grant both feats to one ally within 20 feet until the beginning of your next turn." ]
			},
			{
				"-id": "Sisterhood Rampart",
				"-title": "Sisterhood Rampart",
				"-groups": "Combat",
				"-description": "Maidens behind the line would then strike with polearms or longbows, picking off targets with ease.",
				"Prerequisites": "Cha 13, Shield Focus, Shield Wall, Sisterhood Style, Weapon Focus (longsword), base attack bonus +4.",
				"Benefit": [ "While using Sisterhood Style, you and adjacent allies gain an additional +1 bonus to the shield bonus granted by Shield Wall, and each of you adds your shield bonus to AC (not counting enhancement bonuses) to your CMD against bull rush combat maneuvers. In addition, you and adjacent allies do not provide soft cover against allies' attacks." ]
			},
			{
				"-id": "Sisterhood Style",
				"-title": "Sisterhood Style",
				"-groups": "Combat,Style",
				"-description": "You can easily coordinate tactics with other women.",
				"Prerequisites": "Cha 13, Shield Focus, Weapon Focus (longsword), base attack bonus +2.",
				"Benefit": [ "While using this style and wielding a longsword and a light or heavy shield, you gain a +1 bonus on Reflex and Will saving throws. In addition, when you enter the Sisterhood Style stance, you can choose a teamwork feat you have. As a swift action, you can grant that feat to an ally within 10 feet until the beginning of your next turn." ]
			},
			{
				"-id": "Sizzling Shot",
				"-title": "Sizzling Shot",
				"-groups": "Grit",
				"-description": "Your bullets ignite when you fire them.",
				"Prerequisites": "Grit class feature or Amateur Gunslinger, base attack bonus +4.",
				"Benefit": [
					"As long as you have at least 1 grit point when using a firearm to fire bullets, pellets, or similar ammunition, you can choose for half of the attack's damage to deal fire damage and the other half to deal bludgeoning and piercing damage.",
					"If you spend 1 grit point when you declare such an attack with a firearm, you can grant the bullet or pellets fired the flaming weapon special ability for that attack only."
				]
			},
			{
				"-id": "Skald's Vigor",
				"-title": "Skald's Vigor",
				"-description": "Your song and your enthusiasm combine to invigorate you in battle.",
				"Prerequisites": "Raging song class feature.",
				"Benefit": [ "While maintaining a raging song, you gain fast healing equal to the Strength bonus your song provides, starting in the round after you begin the song. If you stop maintaining your song, the fast healing ends, even if the effects of your song persist." ]
			},
			{
				"-id": "Skeleton Summoner",
				"-title": "Skeleton Summoner",
				"-description": "The walking dead respond to your call.",
				"Prerequisites": "Spell Focus (necromancy), ability to cast summon monster.",
				"Benefit": [ "Add “human skeleton” to the list of creatures you can summon with summon monster I and “human skeletal champion” to the list of creatures you can summon with summon monster III. Once per day, when you cast summon monster, you may summon a skeletal version of one of the creatures on that spell's summoning list (apply the skeleton template to that creature to create this monster)." ]
			},
			{
				"-id": "Skill Focus",
				"-title": "Skill Focus",
				"-description": "Choose a skill. You are particularly adept at that skill.",
				"Benefit": [ "You get a +3 bonus on all checks involving the chosen skill. If you have 10 or more ranks in that skill, this bonus increases to +6." ],
				"Special": [ "You can gain this feat multiple times. Its effects do not stack. Each time you take the feat, it applies to a new skill." ]
			},
			{
				"-id": "Skilled Driver",
				"-title": "Skilled Driver",
				"-description": "Choose a type a type of vehicle (either air, land, or water). You are more skilled when driving that vehicle.",
				"Prerequisites": "none",
				"Benefit": [ "You gain a +4 bonus on driving checks with your chosen vehicle." ]
			},
			{
				"-id": "Skilled Rager",
				"-title": "Skilled Rager",
				"-description": "With practice, you've mastered your rage to allow yourself more versatility.",
				"Prerequisites": "Rage class feature.",
				"Benefit": [ "Choose one Charisma-, Dexterity-, or Intelligence-based skill. While you are raging, you can use this skill." ],
				"Special": [ "You can take this feat multiple times. Each time you do, it applies to a different skill." ]
			},
			{
				"-id": "Skyseeker Impact",
				"-title": "Skyseeker Impact",
				"-groups": "Combat",
				"-description": "You've been trained to devastate larger opponents and shatter their weapons to negate their reach advantage.",
				"Prerequisites": "Con 13, Skyseeker Style, Skyseeker Thrash, Step Up, base attack bonus +9.",
				"Benefit": [ "While using Skyseeker Style, whenever you hit an opponent larger than you with a melee attack, your weapon deals damage as if that weapon were one size category larger. You also gain a +4 bonus on sunder combat maneuver checks against targets larger than you." ]
			},
			{
				"-id": "Skyseeker Style",
				"-title": "Skyseeker Style",
				"-groups": "Combat,Style",
				"-description": "You know how to duck and weave through small gaps in a foe's defense to close the distance between yourself and your enemy.",
				"Prerequisites": "Step Up, base attack bonus +1.",
				"Benefit": [ "Once per round, when an opponent attacks you with a reach weapon, you can take a 5-foot step towards your opponent as an immediate action. If the movement takes you to a square that the opponent's reach weapon does not threaten, you receive a +4 bonus to AC against that attack. If you take this step, you cannot take a 5-foot step during your next turn. If you take an action to move during your next turn, subtract 5 feet from your total available movement." ]
			},
			{
				"-id": "Skyseeker Thrash",
				"-title": "Skyseeker Thrash",
				"-groups": "Combat",
				"-description": "Your fighting style is enhanced by sheer fortitude in the face of intimidating foes.",
				"Prerequisites": "Con 13, Skyseeker Style, Step Up, base attack bonus +4.",
				"Benefit": [ "While using Skyseeker Style, you gain a cumulative +1 bonus on melee damage rolls for every size category your opponent is larger than you." ]
			},
			{
				"-id": "Slashing Grace",
				"-title": "Slashing Grace",
				"-groups": "Combat",
				"-description": "You can stab your enemies with your sword or another slashing weapon.",
				"Prerequisites": "Dex 13, Weapon Finesse, Weapon Focus with chosen weapon.",
				"Benefit": [
					"Choose one kind of light or one-handed slashing weapon (such as the longsword). When wielding your chosen weapon one-handed, you can treat it as a one-handed piercing melee weapon for all feats and class abilities that require such a weapon (such as a swashbuckler's or a duelist's precise strike) and you can add your Dexterity modifier instead of your Strength modifier to that weapon's damage. The weapon must be one appropriate for your size.",
					"You do not gain this benefit while fighting with two weapons or using flurry of blows, or any time another hand is otherwise occupied.",
					"FAQ",
					"What exactly does it mean that 'You do not gain this benefit while fighting with two weapons or using flurry of blows, or any time another hand is otherwise occupied?' Can I use a shield? What about a buckler? Can I use flurry of blows? Brawler's flurry? Two-weapon fighting? Spell combat? Attack with natural weapons? What if I throw the weapon? What about swordmaster's flair?",
					"Slashing Grace does not allow most shields, but bucklers work because they don't occupy the hand. Flurry of blows, brawler's flurry, two-weapon fighting, and spell combat all don't work with Slashing Grace. Attacking with natural weapons beyond the weapon you chose for Slashing Grace also does not work. Slashing Grace only works with melee attacks, not thrown attacks with a melee weapon. Swordmaster's flair should have a sentence added to it that says 'Carrying a swordmaster's flair counts as having that hand free for the purpose of abilities that require a free hand, though you still can't hold another object in that hand.'",
					"[Source]"
				]
			},
			{
				"-id": "Slayer's Feint",
				"-title": "Slayer's Feint",
				"-groups": "Combat",
				"-description": "You rely on your deceptive speed and agility instead of trickery to catch your opponents unprepared.",
				"Prerequisites": "Dex 15, Acrobatic or slayer level 1st, Combat Expertise, Acrobatics 1 rank.",
				"Benefit": [ "You can use Acrobatics instead of Bluff to feint in combat." ]
			},
			{
				"-id": "Slayer's Knack",
				"-title": "Slayer's Knack",
				"-description": "...",
				"Prerequisites": "Favored enemy class feature, base attack bonus +6.",
				"Benefit": [ "When you take this feat, choose one of your favored enemy types. Against enemies of that type, the threat range of any weapon you wield is doubled. This effect does not stack with any other effect that expands a weapon's threat range." ],
				"Special": [ "You can take this feat multiple times. Each time you take it, you choose a different favored enemy type." ]
			},
			{
				"-id": "Slaying Sprint",
				"-title": "Slaying Sprint",
				"-groups": "Combat",
				"-description": "With swift feet and deadly intent, you finish off your target before anyone sees your blade.",
				"Prerequisites": "Dodge, Mobility, Spring Attack, base attack bonus +13",
				"Benefit": [ "You can move up to half your speed instead of taking a 5-foot step when taking a full-round action to perform a coup de grace. Performing a coup de grace does not provoke attacks of opportunity. You can use this feat only when wielding a light or one-handed weapon." ]
			},
			{
				"-id": "Sleep Venom",
				"-title": "Sleep Venom",
				"-groups": "Vishkanya",
				"-description": "You can change the nature of your toxic spittle to put your enemies to sleep.",
				"Prerequisites": "Vishkanya.",
				"Benefit": [ "As a swift action, you may alter the effects of your venom so the target falls unconscious. This changes the initial and secondary effect of your venom to the following: initial effect staggered for 1d4 rounds; secondary effect unconsciousness for 1 minute. You must make the decision to alter your venom before you apply it to a weapon." ],
				"Normal": [ "Vishkanya venom deals Dexterity damage." ]
			},
			{
				"-id": "Sleeper Hold",
				"-title": "Sleeper Hold",
				"-groups": "Combat",
				"-description": "By maintaining a grapple hold on your opponent, you can cause it to lose consciousness.",
				"Prerequisites": "Greater Grapple, base attack bonus +8.",
				"Benefit": [ "You must declare that you are using this feat before you make a combat maneuver check to maintain a grapple (thus a failed check to maintain the grapple ruins the attempt). If you maintain a grapple for a number of consecutive rounds equal to your opponent's Constitution bonus (minimum 1 round), you can attempt to knock out your opponent. The victim must succeed at a Fortitude save (DC 10 + 1/2 your character level + your Str modifier) or else it falls unconscious for 1d4 rounds. Each successive round you attempt this, the target takes a cumulative -1 penalty on its saving throw. When you use this feat, you take an additional -2 penalty to your AC. Creatures that are immune to bleed damage, stunning, or critical hits are immune to this ability." ]
			},
			{
				"-id": "Sliding Axe Throw",
				"-title": "Sliding Axe Throw",
				"-groups": "Combat",
				"-description": "You may aim your thrown axe to avoid an enemy's shield and even trip your opponent.",
				"Prerequisites": "Dexterity 13, base attack bonus +1.",
				"Benefit": [
					"You can choose to take a -2 penalty on a ranged attack roll with an axe, bouncing it or sliding it along the ground. If the target is flat-footed, running, or charging, this attack ignores any bonuses to the target's AC from its shield. If the attack hits, you may immediately make a trip attempt against the target as a free action. If you fail to trip your opponent, your opponent does not get an attempt to trip you in return.",
					"This ability may not work in certain circumstances as determined by the GM, such as if the ground is soft, there is an obstacle or difficult terrain on the floor between you and your target, and so on."
				]
			},
			{
				"-id": "Sliding Dash",
				"-title": "Sliding Dash",
				"-groups": "Combat",
				"-description": "Your seemingly reckless advance becomes an agile strike at the last moment.",
				"Prerequisites": "Dex 15, Acrobatics 10 ranks or acrobatic charge class feature, Bluff 3 ranks.",
				"Benefit": [ "When charging, instead of moving to the closest space from which you can attack your target, you can move to the space adjacent to your target and on the other side of it, as long as you move through the closest space from which you can attack the target and through the target's space to get there. When you move through the target's space, you must attempt an Acrobatics check with a DC equal to 10 + your opponent's CMD. Success allows you to move through the target's space without provoking an attack of opportunity from that target, and when you arrive in the destination space and make your attack, the target is considered flanked for that attack (or the first attack if you have more than one attack on a charge). On a failed check, you instead provoke an attack of opportunity and complete the charge as normal. Whether or not you succeed at the Acrobatics check, you take a -4 penalty to your AC until the start of your turn, instead of the normal -2 penalty." ],
				"Normal": [ "When charging, you must end the movement part of a charge in the closest space in which you can attack your target." ]
			},
			{
				"-id": "Sling Flail",
				"-title": "Sling Flail",
				"-groups": "Combat",
				"-description": "You can use your loaded sling to effectively strike at nearby foes.",
				"Prerequisites": "Weapon Focus (sling), base attack bonus +1.",
				"Benefit": [ "You can make melee attacks using your loaded sling, using that weapon's normal statistics but treating it as a flail. Using a sling in this way does not expend mundane ammunition, but magical or masterwork ammunition loses its special properties after a single hit." ],
				"Special": [ "Any feats you have that apply when you use a flail also apply when you use a loaded sling as a melee weapon." ]
			},
			{
				"-id": "Slipslinger Bombardment",
				"-title": "Slipslinger Bombardment",
				"-groups": "Combat",
				"-description": "You can sling a rain of splash weapons at your enemies.",
				"Prerequisites": "Quick Draw, Slipslinger Grenadier, Slipslinger Style, Throw Anything, Weapon Focus (sling) or weapon training (thrown) class feature, warslinger racial trait.",
				"Benefit": [ "You can use a sling to hurl alchemical splash weapons as ammunition with Slipslinger Grenadier during an attack action or a full-attack action, loading your sling with such weapons as a free action." ],
				"Special": [ "This feat can't be used with alchemists' bombs." ]
			},
			{
				"-id": "Slipslinger Grenadier",
				"-title": "Slipslinger Grenadier",
				"-groups": "Combat",
				"-description": "You can hurl splash weapons with your sling.",
				"Prerequisites": "Slipslinger Style, Throw Anything, Weapon Focus (sling) or weapon training (thrown) class feature, warslinger racial trait.",
				"Benefit": [
					"While using Slipslinger Style, as a standard action you can use a sling to hurl an alchemical splash weapon, treating it as a sling bullet for the purpose of drawing and loading it into your sling. Your sling deals its normal weapon damage, plus the loaded splash weapon's effect or damage.",
					"This extra damage is not multiplied on a critical hit."
				],
				"Special": [ "This feat cannot be used with alchemists' bombs." ]
			},
			{
				"-id": "Slipslinger Style",
				"-title": "Slipslinger Style",
				"-groups": "Combat,Style",
				"-description": "You can fire all manner of slings and sling-like weapons.",
				"Prerequisites": "Weapon Focus (sling) or weapon training (thrown) class feature, warslinger racial trait.",
				"Benefit": [ "You gain a +1 bonus on damage rolls made with all types of slings, and don't provoke attacks of opportunity when reloading a sling. In addition, you treat all ranged and thrown weapons that have 'sling' in their name as if they were slings for all feats and class abilities that require such weapons, as well as the warslinger racial trait." ]
			},
			{
				"-id": "Slow Faller",
				"-title": "Slow Faller",
				"-description": "You can reduce the amount of falling damage you take when you are close to a wall.",
				"Prerequisites": "Acrobatics 5 ranks or slow fall class feature.",
				"Benefit": [ "When you are within arm's reach of a wall, you can slow your descent, as long as you are not in heavy armor. You take damage as if the fall were 10 feet shorter than it actually is. This ability stacks with the slow fall class feature." ],
				"Special": [ "You can take this feat multiple times. Each time you do, you take damage as if the fall were an additional 10 feet shorter." ]
			},
			{
				"-id": "Slow Time",
				"-title": "Slow Time",
				"-groups": "Combat",
				"-description": "Meditation allows you to perceive time as if it were moving more slowly.",
				"Prerequisites": "Wis 15, Combat Meditation, Meditation Master, character level 7th.",
				"Benefit": [
					"Once per day, when you meditate as a full-round action using the Combat Meditation feat, you gain the effects of haste for 1 round per 2 character levels.",
					"These effects do not stack with the haste spell, the speed magic weapon special ability, or other effects granting the same result. This is an extraordinary ability."
				]
			},
			{
				"-id": "Sluggish Jinx",
				"-title": "Sluggish Jinx",
				"-description": "Your jinx makes creatures slow and clumsy.",
				"Prerequisites": "Halfling Jinx alternate racial trait.",
				"Benefit": [ "Your jinx's penalty on saving throws also applies to the target's initiative and attack rolls." ]
			},
			{
				"-id": "Slurk Rider",
				"-title": "Slurk Rider",
				"-groups": "Combat",
				"-description": "You are skilled at riding slurks into battle.",
				"Prerequisites": "Kobold.",
				"Benefit": [ "You are able to control, guide, and communicate with slurks, as if they understood Draconic. You can also spend a standard action to manipulate the nodules on the slurk's back to activate its slime ability. Both you and the slurk can activate this ability during the same round." ]
			},
			{
				"-id": "Sly Draw",
				"-title": "Sly Draw",
				"-description": "You can draw your weapon with such speed and finesse that your opponents don't realize they're threatened.",
				"Prerequisites": "Quick Draw",
				"Benefit": [ "When you draw a light weapon, you may make a Sleight of Hand check instead of a Bluff check to feint in combat. Other feats and abilities that affect a feint still apply to your feint." ]
			},
			{
				"-id": "Small But Deadly",
				"-title": "Small But Deadly",
				"-description": "You have learned to make the most of certain weapons, despite your physical weakness.",
				"Prerequisites": "Weapon Focus or natural weapon, Small size or smaller.",
				"Benefit": [ "You ignore your Strength penalty to damage when making attacks with your racial natural weapons and weapons for which you have the Weapon Focus feat." ]
			},
			{
				"-id": "Smash",
				"-title": "Smash",
				"-groups": "Combat",
				"-description": "You overcome obstacles by breaking them.",
				"Prerequisites": "Power Attack, half-orc.",
				"Benefit": [ "When you attack an inanimate, unattended object, you ignore the first 5 points of its hardness. You also receive a +5 bonus on Strength checks made to knock down or break open doors." ],
				"Special": [ "The benefits of this feat do not apply to sunder attempts or attacks against constructs, only attacks on inanimate, unattended objects." ]
			},
			{
				"-id": "Smashing Crush",
				"-title": "Smashing Crush",
				"-groups": "Combat",
				"-description": "Your hammers strike objects with destructive force.",
				"Prerequisites": "Str 13, Improved Sunder, Smashing Style, Weapon Focus with the chosen weapon.",
				"Benefit": [ "While using Smashing Style, if you successfully damage an object with the sunder combat maneuver, you reduce its hardness by 1. An object can't have its hardness reduced to less than 50% of its normal hardness, and its hardness is restored when the damage dealt by the sunder attack is repaired." ]
			},
			{
				"-id": "Smashing Dent",
				"-title": "Smashing Dent",
				"-groups": "Combat",
				"-description": "Your hammer strikes cause traumatic injuries.",
				"Prerequisites": "Str 13, Improved Sunder, Smashing Crush, Smashing Style, Weapon Focus with the chosen weapon, base attack bonus +6.",
				"Benefit": [ "While using Smashing Style, each time you damage a suit of armor with a sunder combat maneuver, you reduce its armor bonus to its Armor Class by 1 and increase its armor check penalty by 1. Armor cannot have its armor bonus to AC reduced to less than 50% of its normal bonus or its armor check penalty more than doubled. These reductions and increases both end when the damage dealt by the sunder is repaired." ]
			},
			{
				"-id": "Smashing Impact",
				"-title": "Smashing Impact",
				"-groups": "Combat",
				"-description": "The force of your assault drives your opponents against, and possibly through, solid barriers.",
				"Prerequisites": "Str 15, Crushing Impact, Improved Bull Rush, Improved Unarmed Strike, Power Attack.",
				"Benefit": [ "Whenever you successfully bull rush an enemy and its movement is stopped by a solid object or barrier, you can deal your unarmed strike damage to both the foe and the object or barrier, as long as the enemy is within your threatened area. If you performed your bull rush as part of a charge, you gain a +2 bonus on your damage roll. If the damage is enough to destroy the object or barrier, you can continue to push your target the remaining distance allowed by your bull rush combat maneuver." ],
				"Normal": [ "You can't bull rush a creature into a solid object or barrier." ]
			},
			{
				"-id": "Smashing Style",
				"-title": "Smashing Style",
				"-groups": "Combat,Style",
				"-description": "Your hammer blows dent armor, hampering your opponent.",
				"Prerequisites": "Str 13, Improved Sunder, Power Attack, Weapon Focus with the chosen weapon.",
				"Benefit": [ "Choose one weapon from the axes, hammers, or flails fighter weapon group. While using this style, when you succeed at a sunder combat maneuver check against a suit of armor worn by an opponent, you can immediately attempt a bull rush or trip combat maneuver against that target with the same combat maneuver bonus. This maneuver does not provoke attacks of opportunity." ],
				"Special": [ "A character with the weapon training (axes, hammers, or flails) class feature can use Smashing Style with any axe, flail, or hammer, respectively, in addition to the chosen weapon." ]
			},
			{
				"-id": "Smell Fear",
				"-title": "Smell Fear",
				"-description": "You can catch the sour scent of fear on the wind.",
				"Prerequisites": "Keen Scent, half-orc or orc.",
				"Benefit": [ "You receive a +4 bonus on Perception checks to detect creatures with the shaken, frightened, or panicked conditions using scent. You can substitute your Perception skill for Sense Motive skill checks if the subject has one of the previous conditions or is attempting to cover up their fear in some way." ]
			},
			{
				"-id": "Smiting Reversal",
				"-title": "Smiting Reversal",
				"-groups": "Combat",
				"-description": "You can withstand the onslaught of holy or unholy forces.",
				"Prerequisites": "Power Attack, Toughness.",
				"Benefit": [ "Three times per day after being targeted by the smite attack of an enemy, you can immediately make an attack of opportunity against the target. You gain a bonus on this attack roll equal to your Charisma bonus. If this attack of opportunity hits, you gain a bonus on the damage roll equal to your character level. This attack of opportunity ignores all damage reduction the creature possesses." ]
			},
			{
				"-id": "Snake Fang",
				"-title": "Snake Fang",
				"-groups": "Combat",
				"-description": "You can unleash attacks against an opponent that has dropped its guard.",
				"Prerequisites": "Combat Reflexes, Improved Unarmed Strike, Snake Sidewind, Snake Style, Acrobatics 6 ranks, Sense Motive 9 ranks.",
				"Benefit": [ "While using the Snake Style feat, when an opponent's attack misses you, you can make an unarmed strike against that opponent as an attack of opportunity. If this attack of opportunity hits, you can spend an immediate action to make another unarmed strike against the same opponent." ]
			},
			{
				"-id": "Snake Sidewind",
				"-title": "Snake Sidewind",
				"-groups": "Combat",
				"-description": "Your sensitive twisting movements make you difficult to anticipate combat.",
				"Prerequisites": "Improved Unarmed Strike, Snake Style, Acrobatics 3 ranks, Sense Motive 6 ranks.",
				"Benefit": [ "You gain a +4 bonus to CMD against trip combat maneuvers and on Acrobatics checks and saving throws to avoid being knocked prone. While using the Snake Style feat, whenever you score a critical threat with your unarmed strike, you can make a Sense Motive check in place of the attack roll to confirm the critical hit. Whenever you score a critical hit with your unarmed strike, you can spend an immediate action to take a 5-foot step even if you have otherwise moved this round." ],
				"Normal": [ "You can take a 5-foot step only if you have not otherwise moved this round." ]
			},
			{
				"-id": "Snake Style",
				"-title": "Snake Style",
				"-groups": "Combat,Style",
				"-description": "You watch your foe's every movement and then punch through its defense.",
				"Prerequisites": "Improved Unarmed Strike, Acrobatics 1 rank, Sense Motive 3 ranks.",
				"Benefit": [ "You gain a +2 bonus on Sense Motive checks, and you can deal piercing damage with your unarmed strikes. While using the Snake Style feat, when an opponent targets you with a melee or ranged attack, you can spend an immediate action to make a Sense Motive check. You can use the result as your AC or touch AC against that attack. You must be aware of the attack and not flat-footed." ],
				"Normal": [ "An unarmed strike deals bludgeoning damage." ]
			},
			{
				"-id": "Snap Shot",
				"-title": "Snap Shot",
				"-groups": "Combat",
				"-description": "With a ranged weapon, you can take advantage of any opening in your opponent's defenses.",
				"Prerequisites": "Dex 13, Point-Blank Shot, Rapid Shot, Weapon Focus, base attack bonus +6.",
				"Benefit": [ "While wielding a ranged weapon with which you have Weapon Focus, you threaten squares within 5 feet of you. You can make attacks of opportunity with that ranged weapon. You do not provoke attacks of opportunity when making a ranged attack as an attack of opportunity." ],
				"Normal": [
					"While wielding a ranged weapon, you threaten no squares and can make no attacks of opportunity with that weapon.",
					"Editor's Note",
					"Can a character with Snap Shot and Combat Reflexes make multiple attacks of opportunity with a ranged weapon, assuming that loading the ranged weapon is a free action?",
					"Yes. As long as you can reload your weapon with a free action you can reload your weapon as part of the ranged attack attack of opportunity you are making with the Snap Shot feat."
				]
			},
			{
				"-id": "Snapping Flank",
				"-title": "Snapping Flank",
				"-groups": "Combat,Teamwork",
				"-description": "You can make a swift bite attack against a flanked foe.",
				"Prerequisites": "Base attack bonus +9, bite attack.",
				"Benefit": [ "Whenever you are flanking with an ally who also has this feat, as a swift action you can make a bite attack against the opponent you and your ally are flanking." ]
			},
			{
				"-id": "Snapping Jaws",
				"-title": "Snapping Jaws",
				"-groups": "Combat",
				"-description": "When enemies get too close, your jaws tear flesh and bone.",
				"Prerequisites": "Base attack bonus +1, gnoll.",
				"Benefit": [
					"You can use your bite as a natural weapon.",
					"This is a primary attack that deals 1d6 points of damage."
				]
			},
			{
				"-id": "Snapping Turtle Clutch",
				"-title": "Snapping Turtle Clutch",
				"-groups": "Combat",
				"-description": "Your unarmed style allows you to turn your opponent's attack into an opportunity.",
				"Prerequisites": "Snapping Turtle Style, Improved Grapple, Improved Unarmed Strike, base attack bonus +3 or monk level 3rd.",
				"Benefit": [ "While you are using the Snapping Turtle Style feat, the shield bonus the style grants to your AC applies to your CMD and touch AC. Whenever an opponent misses you with a melee attack while you are using the Snapping Turtle Style feat, you can use an immediate action to attempt a grapple combat maneuver against that opponent, but with a -2 penalty." ]
			},
			{
				"-id": "Snapping Turtle Shell",
				"-title": "Snapping Turtle Shell",
				"-groups": "Combat",
				"-description": "Your guarding hand is almost magical in its skill at deflecting incoming blows.",
				"Prerequisites": "Snapping Turtle Clutch, Snapping Turtle Style, Improved Grapple, Improved Unarmed Strike, base attack bonus +5 or monk level 5th.",
				"Benefit": [ "While you are using the Snapping Turtle Style feat, the shield bonus the style grants to your AC increases to +2, and your enemies take a -4 penalty on critical confirmation rolls against you." ]
			},
			{
				"-id": "Snapping Turtle Style",
				"-title": "Snapping Turtle Style",
				"-groups": "Combat,Style",
				"-description": "Your deft unarmed style allows you to shield your body from harm.",
				"Prerequisites": "Improved Unarmed Strike, base attack bonus +1 or monk level 1st.",
				"Benefit": [ "While using the Snapping Turtle Style feat with at least one hand free, you gain a +1 shield bonus to AC." ]
			},
			{
				"-id": "Snatch Arrows",
				"-title": "Snatch Arrows",
				"-groups": "Combat",
				"-description": "Instead of knocking an arrow or ranged attack aside, you can catch it in mid-flight.",
				"Prerequisites": "Dex 15, Deflect Arrows, Improved Unarmed Strike.",
				"Benefit": [
					"When using the Deflect Arrows feat you may choose to catch the weapon instead of just deflecting it. Thrown weapons can immediately be thrown back as an attack against the original attacker (even though it isn't your turn) or kept for later use.",
					"You must have at least one hand free (holding nothing) to use this feat.",
					"FAQ",
					"Does an attack that is deflected count as a miss?",
					"It depends on the ability that is deflecting the attack.",
					"For example, the Deflect Arrows feat says, 'Once per round when you would normally be hit with an attack from a ranged weapon, you may deflect it so that you take no damage from it.' It doesn't say the attack is a miss or is treated as a miss—instead, you take no damage from the attack. Because it is not a miss, effects that would trigger on a miss (such as Efreeti Style or Snake Fang) are not triggered.",
					"Likewise, the Crane Wing feat uses similar language and does not say the deflected attack is a miss or treated as a miss.",
					"Note that the Snatch Arrows feat counts as a deflected attack—you do not take damage if you choose to catch the weapons instead of just deflecting it, and catching the weapon does not mean the attack was a miss.",
					"Update: If the attack is deflected, not only does the target take no damage, but any other effects (ability drain, negative levels, harmful conditions, and so on) associated with that attack do not occur. If the deflected attack is a touch spell or other effect that requires 'holding the charge,' the charge is not expended. For example, if a ghoul's claw attack is deflected, the target is not subject to the ghoul's paralysis ability from the attack. If a shocking grasp touch attack is deflected, the attacker is still 'holding the charge.'",
					"[Source]"
				]
			},
			{
				"-id": "Sneaking Precision",
				"-title": "Sneaking Precision",
				"-description": "Your knowledge of your enemies' vulnerable spots is especially punishing.",
				"Prerequisites": "Sneak attack +6d6, Critical Focus, any critical feat, base attack bonus +9.",
				"Benefit": [ "Whenever you successfully sneak attack an opponent for a second time on your turn, you can spend a swift action to apply the effects of one critical feat you know to that opponent." ]
			},
			{
				"-id": "Sneaky Vagabond",
				"-title": "Sneaky Vagabond",
				"-description": "You have a well-practiced ability at going unnoticed. ",
				"Benefit": [ "You get a +2 bonus on Stealth checks when others are actively trying to find you. In crowds, this bonus increases to +4. Additionally, you gain a +2 circumstance bonus on Diplomacy and Knowledge (Local) checks when trying to find a place to hide." ]
			},
			{
				"-id": "Snoutgrip",
				"-title": "Snoutgrip",
				"-groups": "Combat",
				"-description": "You can hold an opponent's mouth shut.",
				"Prerequisites": "Combat Expertise, Combat Reflexes, Improved Grapple, Improved Unarmed Strike, base attack bonus +12 or 10th-level monk.",
				"Benefit": [ "As an immediate action, whenever an opponent up to one size category larger than you misses you with its bite attack, you can attempt a grapple with a -5 penalty on the check. If you succeed, you have grappled your opponent and are holding its mouth shut, preventing it from using its bite attack, breath weapon, or spells with a verbal component until it escapes your grapple. You may make this grapple attempt even if the target is out of your reach." ]
			},
			{
				"-id": "Snuffing Spell",
				"-title": "Snuffing Spell",
				"-groups": "Metamagic",
				"-description": "Your magic disrupts sources of light.",
				"Benefit": [
					"You can modify a spell to extinguish magical and non-magical light sources that the target has. The first time a creature takes damage from or fails a saving throw against a snuffing spell, any non-magical light sources it has are immediately extinguished and you can attempt to dispel any active spells with the light descriptor that are affecting the target as if you had also cast the targeted version of dispel magic. Spells that do not target creatures can't be snuffing spells.",
					"A snuffing spell uses up a spell slot 2 levels higher than the spell's actual level."
				]
			},
			{
				"-id": "Sociable",
				"-title": "Sociable",
				"-description": "You have a way of helping others to get along.",
				"Prerequisites": "Cha 13, half-elf.",
				"Benefit": [ "As a move action, you grant all friendly creatures within 30 feet who can see or hear you (including yourself ) a +2 bonus on Diplomacy checks for a number of rounds equal to your Charisma modifier (minimum 1 round)." ]
			},
			{
				"-id": "Social Bravery",
				"-title": "Social Bravery",
				"-groups": "Combat",
				"-description": "Even the most stressful social situations don't daunt you, and you weather them as easily as a battle with a dragon.",
				"Prerequisites": "Cha 13, bravery class feature.",
				"Benefit": [ "In social situations, your bravado protects you and makes you harder to read. Add your bravery bonus to the DCs of checks to demoralize you, feint against you, change your attitude, or convince you to perform a request (this also applies against Cutting Humiliation and Intoxicating Flattery). Additionally, add a morale bonus equal to your bravery bonus on Bluff and Intimidate checks." ]
			},
			{
				"-id": "Solar Spell",
				"-title": "Solar Spell",
				"-groups": "Metamagic",
				"-description": "Your spells erupt with the searing light of the sun, blinding or burning creatures of evil.",
				"Benefit": [
					"Any spell you cast with the [light] descriptor is fortified with the cleansing energies of the sun. If the spell creates an area of light, all creatures are dazzled for as long as they remain within the spell's area. Oozes, fungal creatures, creatures from the Shadow Plane, and undead must also succeed at a Will save (DC 10 + the spell level + your Wisdom or Charisma bonus) or take a –2 penalty on attack rolls, damage rolls, saving throws, skill checks, and ability checks for as long as they remain within the spell's area. If the spell normally dazzles or blinds affected creatures with a duration other than instantaneous or permanent, the duration of that effect is increased by a number of rounds equal to the spell's original level. Saving throws to remove the effect early still apply and can bypass this increase.",
					"If the spell deals more damage against oozes, fungal creatures, creatures from the Shadow Plane, or undead with a specific vulnerability to sunlight, the spell deals 1 additional point of damage per die against such creatures.Level Increase: +1 (a solar spell uses up a spell slot one level higher than the spell's actual level.)",
					"Note: Spells that do not inflict damage do not benefit from this feat."
				]
			},
			{
				"-id": "Solid Shadows",
				"-title": "Solid Shadows",
				"-groups": "Metamagic",
				"-description": "Your shadowy illusions are more potent.",
				"Prerequisites": "Spell Focus (illusion).",
				"Benefit": [
					"When casting greater shadow conjuration, greater shadow evocation, shadow conjuration, or shadow evocation (and, at the GM's discretion, any similar spell with the shadow descriptor that mimics a spell of another school), that spell is 20% more real than normal.",
					"Level Increase: +1 (a solid shadows spell uses up a spell slot 1 level higher than the spell's actual level.)"
				]
			},
			{
				"-id": "Solitary Survivor",
				"-title": "Solitary Survivor",
				"-groups": "Combat",
				"-description": "Growing up in the harsh tundra, you could rarely rely on anyone other than yourself. Solitude has only made you stronger as you overcame insurmountable odds.",
				"Prerequisites": "Str 17, base attack bonus +4, half-orc.",
				"Benefit": [ "As a free action when you have no conscious allies within 30 feet of you, you can call upon your solitary prowess to enter a focused state. While in this state, your melee attacks deal an additional 1d6 points of damage. This damage is not multiplied on a critical hit. You can remain in this state for a number of rounds per day equal to your Hit Dice. These rounds do not need to be consecutive." ]
			},
			{
				"-id": "Solo Maneuvers",
				"-title": "Solo Maneuvers",
				"-groups": "Combat",
				"-description": "You fight best when you're on your own.",
				"Benefit": [ "Whenever you are the only one threatening an opponent, you gain a +1 bonus on combat maneuvers against that creature and a +1 bonus to CMD against combat maneuvers made by that creature." ]
			},
			{
				"-id": "Sorcerous Bloodstrike",
				"-title": "Sorcerous Bloodstrike",
				"-description": "You can regain power when you kill a creature.",
				"Prerequisites": "Cha 13, sorcerer bloodline class feature.",
				"Benefit": [ "Once per day, as an immediate action upon reducing a creature to 0 or fewer hit points with one of your sorcerer spells, you can regain one usage of a sorcerer bloodline power that has a limited number of uses per day. The slain creature must have at least half as many Hit Dice as your sorcerer level. You cannot use this feat to gain another usage of a bloodline power that you have not yet used today." ]
			},
			{
				"-id": "Sorcerous Strike",
				"-title": "Sorcerous Strike",
				"-groups": "Combat",
				"-description": "The power flowing through your veins also flows through your unarmed strike.",
				"Prerequisites": "Sorcerer bloodline class feature, Improved Unarmed Strike.",
				"Benefit": [ "When you gain this feat, you choose one bloodline power that you can use to affect a single opponent. If you make a successful unarmed strike against an opponent, in addition to dealing your unarmed strike damage, you can spend a swift action to deliver the effects of the chosen bloodline power to that opponent. Doing so provokes no attacks of opportunity." ]
			},
			{
				"-id": "Soulblade",
				"-title": "Soulblade",
				"-groups": "Combat",
				"-description": "You can't always count on having a source of positive energy to fight haunts, and have mastered an eerie talent for briefly focusing your own life energy into your weapons.",
				"Prerequisites": "Knowledge (religion) 1 rank, Perception 1 rank.",
				"Benefit": [ "As a standard action, you can make a weapon attack against a haunt. If successful, your attack deals damage equal to your weapon dice plus any enhancement bonus (but not other bonuses, such as those granted by Strength, Weapon Specialization, or class features like sneak attack). You can use any Vital Strike feat in order to enhance this attack." ]
			},
			{
				"-id": "Soulwrecking Strike",
				"-title": "Soulwrecking Strike",
				"-groups": "Combat",
				"-description": "Your strikes are so powerful that they harm both your target and any force possessing it.",
				"Prerequisites": "Vital Strike, base attack bonus +6.",
				"Benefit": [ "Whenever you use the attack action against a creature that is possessed, both the creature and any creature possessing it are damaged by your attack (the amount of damage includes your weapon's damage dice, your Strength modifier, weapon special abilities, and so on). The possessing creature can attempt a Will save (DC = 10 + 1/2 your base attack bonus + your Charisma modifier) to halve the damage. Damage Reduction applies normally against this attack, but incorporeal creatures take full damage from this attack as if they were corporeal." ]
			},
			{
				"-id": "Spear Dancer",
				"-title": "Spear Dancer",
				"-description": "You incorporate your two-handed reach weapon into a dizzying martial dance.",
				"Prerequisites": "Weapon Focus (any two-handed reach weapon), Perform (dance) 4 ranks.",
				"Benefit": [
					"Each time you hit a creature with a two-handed reach weapon that you have Weapon Focus in, the creature is dazzled for 1 round.",
					"Combat Trick",
					"Note If using the optional Stamina Pool rules, the following trick may be used with this feat.",
					"Combat Trick: When you inflict the dazzled condition on an opponent using the Spear Dancer feat, you can spend up to 5 stamina points to increase the duration of the effect by 1 round per stamina point spent."
				]
			},
			{
				"-id": "Spear Dancing Reach",
				"-title": "Spear Dancing Reach",
				"-groups": "Combat",
				"-description": "You can strike from afar with double weapons.",
				"Prerequisites": "Dex 17, Spear Dancing Spiral, Spear Dancing Style, Two-Weapon Fighting, Weapon Finesse, Weapon Focus with the chosen weapon.",
				"Benefit": [ "While using Spear Dancing Style and making a full attack using the chosen weapon as a double weapon, you can grant the reach special weapon feature to one or both of the weapon's ends until the end of your turn as a swift action." ]
			},
			{
				"-id": "Spear Dancing Spiral",
				"-title": "Spear Dancing Spiral",
				"-groups": "Combat",
				"-description": "You wield spears with poise and grace.",
				"Prerequisites": "Dex 15, Spear Dancing Style, Two-Weapon Fighting, Weapon Finesse, Weapon Focus with the chosen weapon.",
				"Benefit": [ "While using Spear Dancing Style, you gain the benefit of Weapon Finesse with the chosen weapon if it is appropriately sized for a creature of your size category. In addition, you can use any feat or ability that functions with a quarterstaff with your chosen weapon." ]
			},
			{
				"-id": "Spear Dancing Style",
				"-title": "Spear Dancing Style",
				"-groups": "Combat,Style",
				"-description": "You can use polearms and spears as double weapons.",
				"Prerequisites": "Dex 13, Two-Weapon Fighting, Weapon Focus with the chosen weapon.",
				"Benefit": [
					"Choose one weapon from the polearm or spear fighter weapon groups. While using this style, you grant the chosen weapon the double special weapon feature, using the weapon's normal statistics for its main-hand end and the statistics of a light mace for its off-hand end.",
					"A weapon wielded in this way loses the brace and reach special weapon features."
				],
				"Special": [
					"A character with the weapon training (polearms or spears) class feature can use Spear Dancing Style with any polearm or spear, respectively, in addition to the chosen weapon.",
					"Get this book AND support this site!"
				]
			},
			{
				"-id": "Spectacular Exit",
				"-title": "Spectacular Exit",
				"-groups": "Combat, Performance",
				"-description": "You have mastered acrobatic maneuvers that turn even your retreats into breathtaking feats of skill.",
				"Prerequisites": "Dex 15, Dodge, Acrobatics 7 ranks",
				"Benefit": [
					"When you must attempt a performance combat check because you used the withdraw action, you can attempt an Acrobatics check against your opponent's CMD before the performance combat check. Success allows you to withdraw without taking the standard -5 penalty on your check. In addition, for every 5 points by which your Acrobatics check result exceeds your opponent's CMD, you gain a +1 bonus on all Perform checks you make for the remainder of the round.",
					"Combat Trick",
					"Note If using the optional Stamina Pool rules, the following trick may be used with this feat.",
					"Combat Trick: When you use Spectacular Exit to withdraw without taking the -5 penalty on performance combat checks and you spend 5 stamina points, you don't need to succeed at an Acrobatics check in order to avoid the penalty."
				]
			},
			{
				"-id": "Spectrum Sight",
				"-title": "Spectrum Sight",
				"-description": "Your pursuit of dispassionate perfection gives you unmatched insight into the condition of others.",
				"Prerequisites": "Alertness, Perception 5 ranks.",
				"Benefit": [
					"You can perform the read aura occult skill unlock even if you can't use psychic magic. If you can cast psychic spells or have the Psychic Sensitivity feat, you can use read aura one additional time per day.",
					"Once per day, you can perform an aura reading as a full-round action. If you successfully use detect thoughts or a similar mind-reading divination on a creature, you can use the read aura skill unlock on that creature as a full-round action as long as it is in your line of sight and within 30 feet. If you fail the check, you can't attempt to read that same creature's aura for 24 hours."
				],
				"Special": [ "If you have a ki pool, you can expend 1 point from your ki pool as a swift action to gain one additional daily use of the read aura occult skill unlock." ]
			},
			{
				"-id": "Spell Bane",
				"-title": "Spell Bane",
				"-description": "While your bane weapon is active, creatures that your bane affects find it more difficult to resist your spells.",
				"Prerequisites": "Bane class feature.",
				"Benefit": [ "While your bane class feature is affecting a creature type, the saving throw's DCs for your spells increase by +2 for creatures of that type." ]
			},
			{
				"-id": "Spell Bluff",
				"-title": "Spell Bluff",
				"-description": "You know the principles of arcane dueling, and when fighting other spellcasters, you have learned to hide the true nature of your spells until the last possible moment.",
				"Prerequisites": "Bluff 5 ranks, Spellcraft 5 ranks.",
				"Benefit": [
					"If another spellcaster tries to counterspell your casting, she adds +4 to her Spellcraft DC when trying to determine your spell.",
					"Because you have studied how to mask the recognizable elements of your spellcasting, you gain a +2 bonus on your Spellcraft checks to identify and counter an opponent's spell if it is a spell you know or have in your spellbook."
				]
			},
			{
				"-id": "Spell Cartridges",
				"-title": "Spell Cartridges",
				"-groups": "Combat",
				"-description": "You can fire bullets of arcane energy when your ammunition runs low.",
				"Prerequisites": "Arcane Strike, ability to cast arcane spells, proficient with firearms.",
				"Benefit": [ "While your gun is imbued with power from the Arcane Strike feat, you can fire force bullets instead of regular ammunition. A force bullet deals 1d4 points of force damage for every five caster levels you have. Force bullets do not use black powder or ammunition and count as magic for the purpose of bypassing damage reduction." ]
			},
			{
				"-id": "Spell Chain",
				"-title": "Spell Chain",
				"-groups": "Teamwork",
				"-description": "You help your allies bypass your foes' magical defenses.",
				"Prerequisites": "Spell Penetration.",
				"Benefit": [ "Whenever you make a successful caster level check to overcome a target's spell resistance, the next ally who also has this feat that attempts to overcome the same target's spell resistance can roll twice when attempting his own caster level check, taking the better result. This benefit must be used within 1 round or else it is lost." ]
			},
			{
				"-id": "Spell Focus",
				"-title": "Spell Focus",
				"-description": "Choose a school of magic. Any spells you cast of that school are more difficult to resist.",
				"Benefit": [ "Add +1 to the Difficulty Class for all saving throws against spells from the school of magic you select." ],
				"Special": [ "You can gain this feat multiple times. Its effects do not stack. Each time you take the feat, it applies to a new school of magic." ]
			},
			{
				"-id": "Spell Hex",
				"-title": "Spell Hex",
				"-description": "You can transform a 1st-level spell into a hex.",
				"Prerequisites": "Major hex class feature.",
				"Benefit": [
					"Select one 1st-level spell in the class that grants you the major hex class feature. You can learn that spell as a hex, and can use that hex three times per day. This is a spell-like ability. You use your class level in the major-hex-granting class as your caster level for the spell hex. The spell hex uses your hex DC instead of its original spell DC.",
					"If the spell is a touch spell and you miss the creature, you cannot target the creature with that spell hex again for 24 hours. If the spell allows a saving throw to negate or take a partial effect from the spell, and the target succeeds at that saving throw, it cannot be affected by the spell hex for 24 hours, even if it is in the area of the spell hex."
				]
			},
			{
				"-id": "Spell Mastery",
				"-title": "Spell Mastery",
				"-description": "You have mastered a small handful of spells, and can prepare these spells without referencing your spellbooks at all.",
				"Prerequisites": "1st-level wizard",
				"Benefit": [ "Each time you take this feat, choose a number of spells that you already know equal to your Intelligence modifier. From that point on, you can prepare these spells without referring to a spellbook." ],
				"Normal": [ "Without this feat, you must use a spellbook to prepare all your spells, except read magic." ]
			},
			{
				"-id": "Spell Penetration",
				"-title": "Spell Penetration",
				"-description": "Your spells break through spell resistance more easily than most.",
				"Benefit": [ "You get a +2 bonus on caster level checks (1d20 + caster level) made to overcome a creature's spell resistance." ]
			},
			{
				"-id": "Spell Perfection",
				"-title": "Spell Perfection",
				"-description": "You are unequaled at the casting of one particular spell.",
				"Prerequisites": "Spellcraft 15 ranks, at least three metamagic feats.",
				"Benefit": [ "Pick one spell which you have the ability to cast. Whenever you cast that spell you may apply any one metamagic feat you have to that spell without affecting its level or casting time, as long as the total modified level of the spell does not use a spell slot above 9th level. In addition, if you have other feats which allow you to apply a set numerical bonus to any aspect of this spell (such as Spell Focus, Spell Penetration, Weapon Focus [ray], and so on), double the bonus granted by that feat when applied to this spell." ]
			},
			{
				"-id": "Spell Specialization",
				"-title": "Spell Specialization",
				"-description": "Select one spell. You cast that spell with greater than normal power.",
				"Prerequisites": "Int 13, Spell Focus.",
				"Benefit": [
					"Select one spell of a school for which you have taken the Spell Focus feat. Treat your caster level as being two higher for all level-variable effects of the spell.",
					"Every time you gain an even level in the spellcasting class you chose your spell from, you can choose a new spell to replace the spell selected with this feat, and that spell becomes your specialized spell."
				],
				"Special": [ "You can gain this feat multiple times. Its effects do not stack. Each time you take the feat, it applies to a different spell." ]
			},
			{
				"-id": "Spell Sponge",
				"-title": "Spell Sponge",
				"-description": "Your mystical connection with your spellcasting master attunes you to helpful magical effects.",
				"Prerequisites": "Animal companion or familiar, share spells ability.",
				"Benefit": [ "Whenever your master targets you with a spell with a target of “you,” the spell's duration is doubled as if modified by the Extend Spell metamagic feat. This does not affect spells with a duration of concentration, instantaneous, or permanent, or spells already modified by Extend Spell." ],
				"Special": [ "Feats that are meant for familiars can be switched out for a familiar's default feats (as listed in the familiar's statistics) if the familiar meets the prerequisites. Such feat replacements must be made when the PC first acquires a new familiar, and-like all new feats from supplemental sources-the new feats should be approved by the GM before being integrated into play." ]
			},
			{
				"-id": "Spell-Drinker",
				"-title": "Spell-Drinker",
				"-description": "The magic that cannot harm you only makes you stronger.",
				"Prerequisites": "Con 13; Great Fortitude, Iron Will, or Lightning Reflexes.",
				"Benefit": [ "Once per hour, as an immediate action after you succeed at a saving throw against a creature's spell or spell-like ability, you gain a number of temporary hit points equal to 1d6 plus the spell's level for 1 minute. While these temporary hit points last, you gain a +2 bonus on saving throws against spells and spell-like abilities cast by that creature. If you have 10 or more Hit Dice, the number of temporary hit points you gain from this feat doubles. These temporary hit points stack with those gained from other sources, but not with each other." ]
			},
			{
				"-id": "Spellbreaker",
				"-title": "Spellbreaker",
				"-groups": "Combat",
				"-description": "You can strike at enemy spellcasters who fail to cast defensively when you threaten them.",
				"Prerequisites": "Disruptive, 10th-level fighter.",
				"Benefit": [ "Enemies in your threatened area that fail their checks to cast spells defensively provoke attacks of opportunity from you." ],
				"Normal": [ "Enemies that fail to cast spells defensively do not provoke attacks of opportunity." ]
			},
			{
				"-id": "Spellsong",
				"-title": "Spellsong",
				"-description": "You can blend the power of your performance and spellcasting.",
				"Prerequisites": "Cha 13, bardic performance class ability, able to cast 1st-level spells.",
				"Benefit": [
					"You can combine your bardic performance and your spellcasting in two ways. First, you can conceal the activity of casting a bard spell by masking it in a performance. As a swift action, you may combine your casting time of a spell with a Perform check. Observers must make a Perception or Sense Motive check opposed by your Perform check to realize you are also casting a spell. This uses 1 round of your bardic performance ability, regardless of the spell's casting time.",
					"Second, as a move action, you can use 1 round of bardic performance to maintain a bard spell with a duration of concentration. You can cast another spell in the same round you are using bardic magic to maintain concentration; if you do this, your concentration on the maintained spell ends when you end the bardic performance the spell is part of."
				]
			},
			{
				"-id": "Spider Climber",
				"-title": "Spider Climber",
				"-groups": "Drow",
				"-description": "...",
				"Prerequisites": "Character level 3rd, drow.",
				"Benefit": [ "You can cast spider climb once per day as a spell-like ability, using your character level as the caster level. Furthermore, you gain a +4 bonus on saving throws against the web special attacks of spiders and the effects of web and other similar spells (such as the web cloud spell)." ]
			},
			{
				"-id": "Spider Step",
				"-title": "Spider Step",
				"-description": "Your physical mastery grants you an impossible stride.",
				"Prerequisites": "Acrobatics 6 ranks, Climb 6 ranks, monk level 6th.",
				"Benefit": [ "As a move action, you can move up to half your slow fall distance (maximum 50 feet) across a wall or ceiling or across ropes, branches, or even water or other surfaces that cannot support your weight. You must reach a solid, level surface by the end of your turn or you will fall." ]
			},
			{
				"-id": "Spider Summoner",
				"-title": "Spider Summoner",
				"-groups": "Drow",
				"Prerequisites": "Ability to cast summon monster or summon nature's ally spells, drow.",
				"Benefit": [
					"When casting either a summon monster spell or a summon nature's ally spell, your options increase.",
					"Depending on the level of the spell, you can summon the spiders listed below.Summon monster:Summon nature's ally:Creatures marked with an asterisk (*) are summoned with the celestial template if you are good, and the fiendish template if you are evil. If you are neutral, you may choose which template to apply to the creature. Furthermore, when you summon spiders using summon monster or summon nature's ally, the DC of the summoned monster's poison and web effects increases by 2."
				]
			},
			{
				"-id": "Spiked Destroyer",
				"-title": "Spiked Destroyer",
				"-groups": "Combat",
				"-description": "You can attack with your armor spikes while using bull rush or overrun.",
				"Prerequisites": "Proficient in spiked armor.",
				"Benefit": [
					"When you succeed at a bull rush or overrun combat maneuver, you may automatically make an attack roll with your armor spikes against the target of the maneuver as a swift action, using your highest attack bonus.",
					"Combat Trick",
					"Note If using the optional Stamina Pool rules, the following trick may be used with this feat.",
					"Combat Trick: You can spend 4 stamina points after succeeding at a bull rush or overrun combat maneuver check to use Spiked Destroyer against that target as a free action."
				]
			},
			{
				"-id": "Spinning Throw",
				"-title": "Spinning Throw",
				"-groups": "Combat",
				"-description": "You whirl your foe around and then let go.",
				"Prerequisites": "Combat Expertise, Improved Bull Rush, Improved Trip, Improved Unarmed Strike, Ki Throw.",
				"Benefit": [ "On a successful unarmed trip combat maneuver against an opponent your size or smaller, you can spend a swift action to attempt a bull rush combat maneuver against that opponent. If your bull rush succeeds, you can move that opponent to any unoccupied square you threaten, then push that opponent the number of 5-foot increments your successful bull rush allows. The target is then knocked prone. If the bull rush fails, you can use the Ki Throw feat as normal. If you also have the Improved Ki Throw feat, a successful bull rush allows you to push the opponent into a space secondary targets occupy. You resolve this effect as if you used the Improved Ki Throw feat to throw the opponent into that space." ],
				"Special": [ "Per the Ki Throw feat, a monk can use ki to affect creatures larger than himself with this feat." ]
			},
			{
				"-id": "Spirit Ally",
				"-title": "Spirit Ally",
				"-description": "You have a close connection with a spiritual assistant capable of aiding you in small ways.",
				"Prerequisites": "Caster level 8th.",
				"Benefit": [ "You gain the assistance of an invisible shapeless spirit. This acts as a constant unseen servant spell, using your character level as your effective caster level. For every 4 character levels you have, the spirit ally's effective Strength score increases by 2 (to a maximum of 12 at 20th level). If the spirit ally dissipates or is dispelled, it returns after 24 hours." ]
			},
			{
				"-id": "Spirit Focus",
				"-title": "Spirit Focus",
				"-description": "You have a strong connection to a particular legend, Which empowers the spirits you channel.",
				"Prerequisites": "Spirit bonus class feature.",
				"Benefit": [ "Select a legend of spirits. Your spirit bonus from spirits of that legend increases by 1." ]
			},
			{
				"-id": "Spirit Ridden",
				"-title": "Spirit Ridden",
				"-description": "You can invite lesser spirits to partially share your body in exchange for their training and experience.",
				"Benefit": [ "You can perform a seance once per day, taking 1 hour and requiring your concentration, calling out to any nearby spirit with the skill you seek. At the end of the hour, you invite the spirit to inhabit your body. The spirit grants you ranks in a skill of your choice equal to your character level, and you treat the skill as a class skill. These effects persist for 1 hour per character level. You cannot have more ranks in a skill than your total number of Hit Dice. While you're possessed, the spirit influences your personality." ]
			},
			{
				"-id": "Spirit Sense",
				"-title": "Spirit Sense",
				"-description": "You sense the presence of the unseen.",
				"Prerequisites": "Psychic Sensitivity or ability to cast psychic spells.",
				"Benefit": [
					"You gain a +5 bonus on checks to notice haunts.",
					"In addition, when you target an incorporeal creature with a corporeal spell or effect that doesn't deal damage, you have a 75% chance of affecting the target."
				],
				"Normal": [ "Corporeal spells and effects that don't deal damage have only a 50% chance of affecting an incorporeal creature." ]
			},
			{
				"-id": "Spirit Speaker",
				"-title": "Spirit Speaker",
				"-description": "By absorbing spirits, you can learn how to set them free.",
				"Prerequisites": "Cha 13, Con 13, Absorb Spirit†, Diplomacy 5 ranks, must have died at least once or been possessed by an undead creature.",
				"Benefit": [
					"When you absorb a spirit with the Absorb Spirit feat, you can converse with it through an internal dialogue in your mind. While conversing with the spirit, you can attempt Diplomacy checks to change its attitude toward you, as a normal use of that skill. If you are a medium with the haunt channeler class feature, you gain a +4 bonus on these Diplomacy checks. Once the spirit's attitude is indifferent or better, you can request to know what must be done to lay the spirit to rest, though the DC to do so is the DC to change its current attitude + 15. This takes into account the circumstance modifiers for the request in a typical situation, though it could be higher or lower in an unusual circumstance.",
					"The spirit's starting attitude is usually hostile since you destroyed it and imprisoned it within you, interfering with its rejuvenation. If it's the spirit of an undead creature, it has the same Charisma bonus it had while fully manifested. ",
					"If the spirit is that of a haunt, it has an effective Charisma based on its CR using the following table.",
					"Conversing with a spirit in this manner unsettles the mind. Each time you attempt a Diplomacy check using this ability to influence the spirit's attitude or make a request, you take 1 point of Wisdom damage. No effect can prevent or reduce the ability damage, nor can the ability damage be healed or suppressed by any means until you release the spirit."
				],
				"Special": [ "If you are using the optional sanity rules, when you attempt a Diplomacy check using this ability, you take 1d6 points of sanity damage instead of 1 point of Wisdom damage. No effect can prevent or reduce the damage, nor can the damage be healed or suppressed by any means until you release the spirit." ]
			},
			{
				"-id": "Spirit Symbiosis",
				"-title": "Spirit Symbiosis",
				"-description": "Your phantom is impressionable and easily influenced by contact with new spirits.",
				"Prerequisites": "Ability to cast speak with dead, phantom class feature.",
				"Benefit": [ "When you cast speak with dead, you can choose not to gain any of the normal effects of the spell, instead temporarily merging the summoned spirit into your phantom, exchanging your phantom's current emotional focus and all related abilities for a new emotional focus of your choice. This new emotional focus persists for 10 minutes per class level you have, after which your phantom's original emotional focus returns." ]
			},
			{
				"-id": "Spirit Talker",
				"-title": "Spirit Talker",
				"-description": "By forging a temporary bond with a spirit, you gain access to an unfamiliar hex.",
				"Prerequisites": "Hex class feature; shaman level 6th or witch level 6th.",
				"Benefit": [ "Once per day, you can spend 10 minutes communing with a shaman spirit of your choice. When you do, you gain the temporary use of one hex from its list of hexes. This hex is added to your list of available hexes for the next hour, after which you immediately lose all benefits of that hex." ]
			},
			{
				"-id": "Spirit Vision",
				"-title": "Spirit Vision",
				"-description": "You retain your senses when seeking a possession target.",
				"Prerequisites": "Magic jar as a known spell or spell-like ability, Wis 15",
				"Benefit": [ "When you sense life forces while seeking a host, you can observe them as you could when you were in your own body. Attempting to possess a body is a standard action." ]
			},
			{
				"-id": "Spirit of the Corps",
				"-title": "Spirit of the Corps",
				"-groups": "Combat,Teamwork",
				"-description": "You find inspiration in your fellow soldiers, trusting that your shared training and dedication will bring you victory on the battlefield.",
				"Benefit": [ "Whenever you are within 10 feet of an ally benefiting from a spell or effect that grants a morale bonus on a particular type of roll, once during that effect's duration, you can apply that morale bonus on a roll you make of that type. For instance, if an ally with this feat is benefiting from heroism, once during the duration of the spell you could gain a +2 morale bonus on one saving throw, attack roll, or skill check. You can use this feat only once per round, and only once per spell or effect." ]
			},
			{
				"-id": "Spirit of the Wild",
				"-title": "Spirit of the Wild",
				"-groups": "Elf",
				"-description": "...",
				"Prerequisites": "Attuned to the Wild, Guardian of the Wild, elf.",
				"Benefit": [ "When you are in a terrain type you have selected the Attuned to the Wild feat for, you gain a +4 bonus on Perception checks made to act in the surprise round of combat. If you act in the surprise round, you gain blindsense out to a range of 30 feet during the surprise round. If you are in an area that qualifies as more than one kind of terrain, these bonuses do not stack; you receive the bonus for only one terrain type." ]
			},
			{
				"-id": "Spirit's Gift",
				"-title": "Spirit's Gift",
				"-description": "You commune with a spirit of your choice, and it grants your animal companion or familiar a boon.",
				"Prerequisites": "Animal companion class feature or familiar class feature.",
				"Benefit": [ "At the start of the day, you can choose to commune with a single shaman spirit. (Although a shaman would need an hour of preparation, this takes you no time.) Once during the next 24 hours, you can spend a standard action to grant your animal companion or familiar that shaman spirit's spirit animal ability for 1 minute per level in the class that grants your animal companion or familiar." ]
			},
			{
				"-id": "Spirited Charge",
				"-title": "Spirited Charge",
				"-groups": "Combat",
				"-description": "Your mounted charge attacks deal a tremendous amount of damage.",
				"Prerequisites": "Ride 1 rank, Mounted Combat, Ride-By Attack.",
				"Benefit": [ "When mounted and using the charge action, you deal double damage with a melee weapon (or triple damage with a lance)." ]
			},
			{
				"-id": "Spiritual Balance",
				"-title": "Spiritual Balance",
				"-description": "You focus your ki in order to quell the influence of outside spirits on you.",
				"Prerequisites": "Ki pool class feature, still mind class feature.",
				"Benefit": [ "The saving throw bonus from your still mind class feature applies against possession effects, and as an immediate action you can spend 1 point from your ki pool to double the saving throw bonus provided by still mind." ],
				"Normal": [ "Your still mind class feature applies only against enchantment spells and effects." ]
			},
			{
				"-id": "Spiritual Guardian",
				"-title": "Spiritual Guardian",
				"-description": "Your spiritual guardians are more powerful than those of most others.",
				"Prerequisites": "Ability to cast spiritual weapon or spiritual ally, spirit magic class feature.",
				"Benefit": [ "Whenever you cast spiritual weapon, spiritual ally, or a similar spell that grants you a spiritual guardian, that guardian uses your shaman level instead of your base attack bonus to determine its base attack bonus, potentially granting it multiple attacks. Additionally, it gains a +2 bonus on caster level checks to overcome spell resistance as well as on damage rolls." ]
			},
			{
				"-id": "Spiritual Training",
				"-title": "Spiritual Training",
				"-description": "Through dedicated study and training, you can resist the control of possessing spirits.",
				"Benefit": [
					"You gain a +2 competence bonus on Knowledge checks to identify creatures with the incorporeal subtype, and can attempt Knowledge checks dealing with incorporeal creatures untrained. When affected by a dominate person, magic jar, or possession spell or a similar ability, your mind and soul remain aware within your body, at war with the invading consciousness. While dominated or possessed, you can attempt a Will save as a swift action to temporarily regain control over your body.",
					"On a successful save, you can act normally for 1 round. On a failed save, you cannot attempt to regain control for 1 hour, but the possessing consciousness can't take a swift action that round."
				]
			},
			{
				"-id": "Spiritualist's Call",
				"-title": "Spiritualist's Call",
				"-description": "Whenever you summon your phantom, it is more powerful for a brief period of time.",
				"Prerequisites": "Phantom class feature.",
				"Benefit": [ "Whenever you summon your phantom, you can give it a +2 enhancement bonus to its Strength, Dexterity, or Charisma. This bonus lasts for 10 minutes after the summoning ritual is complete." ]
			},
			{
				"-id": "Spit Venom",
				"-title": "Spit Venom",
				"-groups": "Combat,Nagaji",
				"-description": "You have mastered the nagaji warrior technique of spitting venom into your opponent's eyes.",
				"Prerequisites": "Nagaji.",
				"Benefit": [ "As a full-round action, you can spit poison up to 10 feet as a ranged touch attack. If you hit, the target must make a successful Fortitude save or be blinded for 1d6 rounds. The DC of this save is equal to 10 + 1/2 your total Hit Dice + your Constitution modifier. You can use this ability once per day plus one additional time per day for every three Hit Dice you have." ]
			},
			{
				"-id": "Splash Weapon Mastery",
				"-title": "Splash Weapon Mastery",
				"-description": "You are adept at increasing the range, area, and accuracy of splash weapons.",
				"Benefit": [ "When throwing a splash weapon, you act as if you had the Far Shot feat. When you hit with a splash weapon, select one additional square adjacent to the splash area; creatures in this area also take splash damage. When you miss with a splash weapon, you may adjust the miss direction on the grid by +1 or –1. This feat counts as Far Shot for the purpose of qualifying for other feats, but only in regard to splash weapons." ]
			},
			{
				"-id": "Splintering Weapon",
				"-title": "Splintering Weapon",
				"-description": "Your fragile weapon works to your advantage, breaking off fragments in wounds you inflict.",
				"Prerequisites": "Base attack bonus +1, proficient with weapon, weapon made of primitive material.",
				"Benefit": [ "Whenever you use a melee or thrown weapon with the fragile weapon feature or similar quality and hit an opponent, you can give your weapon the broken condition to deal that opponent 1d4 points of bleed damage." ]
			},
			{
				"-id": "Split Hex",
				"-title": "Split Hex",
				"-description": "You can split the effect of one of your targeted hexes, affecting another creature you can see.",
				"Prerequisites": "Witch level 10th.",
				"Benefit": [ "When you use one of your hexes (not a major hex or a grand hex) that targets a single creature, you can choose another creature within 30 feet of the first target to also be targeted by the hex." ]
			},
			{
				"-id": "Split Major Hex",
				"-title": "Split Major Hex",
				"-description": "You can split the effect of one of your targeted hexes, affecting another creature you can see.",
				"Prerequisites": "Split hex, caster level 18th.",
				"Benefit": [ "When you use one of your major hexes (not a grand hex) that targets a creature, you can choose another creature within 30 feet of the first target to also be targeted by the major hex." ]
			},
			{
				"-id": "Spontaneous Metafocus",
				"-title": "Spontaneous Metafocus",
				"-description": "You can focus to combine one of your known spells and metamagic feats.",
				"Prerequisites": "Cha 13, one metamagic feat, able to spontaneously cast spells.",
				"Benefit": [ "Pick a single spell that you are able to cast spontaneously. When you apply metamagic feats to that spell, you can cast the spell using the normal casting time instead of at the slower casting time." ],
				"Special": [ "You can take this feat multiple times. Each time you select this feat, choose a new spell that you can cast spontaneously; the feat applies to that spell." ]
			},
			{
				"-id": "Spontaneous Nature's Ally",
				"-title": "Spontaneous Nature's Ally",
				"-description": "Instead of casting a cure spell, you can instead cast summon nature's ally.",
				"Prerequisites": "Knowledge (nature) 5 ranks, ability to spontaneously cast cure or inflict spells, Animal or Plant domain.",
				"Benefit": [ "You can “lose” a prepared spell in order to cast any summon nature's ally spell of the same level or lower, instead of casting a cure spell or an inflict spell as you normally would. For the purpose of this feat only, the summon nature's ally spells of the appropriate spell levels count as being on your spell list at the same spell level as for a druid." ]
			},
			{
				"-id": "Spring Attack",
				"-title": "Spring Attack",
				"-groups": "Combat",
				"-description": "You can deftly move up to a foe, strike, and withdraw before he can react.",
				"Prerequisites": "Dex 13, Dodge, Mobility, base attack bonus +4.",
				"Benefit": [ "As a full-round action, you can move up to your speed and make a single melee attack without provoking any attacks of opportunity from the target of your attack. You can move both before and after the attack, but you must move at least 10 feet before the attack and the total distance that you move cannot be greater than your speed. You cannot use this ability to attack a foe that is adjacent to you at the start of your turn." ],
				"Normal": [
					"You cannot move before and after an attack.",
					"Can Vital Strike be used with Spring Attack? Can Vital Strike be used on a charge?",
					"No. Vital Strike can only be used as part of an attack action, which is a specific kind of standard action. Spring Attack is a special kind of full-round action that includes the ability to make one melee attack, not one attack action. Charging uses similar language and can also not be used in combination with Vital Strike.",
					"[Source]",
					"Can I use Spring Attack to make an attack from an ally's square?",
					"Let's use a diagram of a 5-foot-wide hallway to help visualize this question. Periods are open squares. A is the acting character. Numbers are allies of A. X is the monster.",
					". . . . . A 1 2 3 X",
					"Using the diagram as a model, the question is, 'Can I use Spring Attack to move from A to 3, make an attack on the monster from 3's square, then move back to A and end my turn?' The answer is 'yes.' The key to understanding this is the general rule, 'you cannot end your movement in an occupied square.' Spring Attack is a full-round action; it is not a move action, then an attack, and then another move action, it's one continuous movement with an attack happening in the middle. Thus, with Spring Attack you're not ending your movement until you end your movement for the turn. To look at it another way, if the character just wanted to move from A to 3 and back to A, that would be a legal move because he's not ending his movement in 3, he's ending his movement back in A. With Spring Attack, the character still isn't ending his movement in 3; the feat gives him the ability to perform an attack as part of the continuous movement from A to 3 to A (regardless of whether that attack happens when he's in an occupied square). (Even with speed 15, a character moving 15 feet from A to 3 and then 15 feet from 3 to A isn't ending his movement in 3… using a move action to move 15 feet and a standard action to move 15 feet doesn't mean he's actually pausing halfway through his movement to change actions.)",
					"[Source]"
				]
			},
			{
				"-id": "Spring-Heeled Reaping",
				"-title": "Spring-Heeled Reaping",
				"-groups": "Combat",
				"-description": "Your armor's flexibility and your own training allow you to strike multiple times while moving.",
				"Prerequisites": "Dex 17, Dodge, Mobility, Shot on the Run or Spring Attack, Spring-Heeled Sprint, Spring-Heeled Style, base attack bonus +11, proficiency with light armor.",
				"Benefit": [ "While using Spring-Heeled Style, whenever you use Shot on the Run or Spring Attack, you can attack two different creatures at any point in your movement. Each attack is made at your full attack bonus. Any creature that you attack in melee with this feat cannot make attacks of opportunity against you for that movement, as normal for Spring Attack." ]
			},
			{
				"-id": "Spring-Heeled Sprint",
				"-title": "Spring-Heeled Sprint",
				"-groups": "Combat",
				"-description": "You can move quickly without sacrificing your offense.",
				"Prerequisites": "Dex 15, Dodge, Mobility, Shot on the Run or Spring Attack, Spring-Heeled Style, base attack bonus +7, proficiency with light armor.",
				"Benefit": [ "While using Spring-Heeled Style, you can move up to twice your speed when using the Shot on the Run or Spring Attack feats." ]
			},
			{
				"-id": "Spring-Heeled Style",
				"-title": "Spring-Heeled Style",
				"-groups": "Combat,Style",
				"-description": "You cunningly dart across the battlefield from foe to foe, taking advantage of your armor's flexibility to duck blows.",
				"Prerequisites": "Dex 13, Dodge, Mobility, Shot on the Run or Spring Attack, base attack bonus +4, proficiency with light armor.",
				"Benefit": [ "If using this style during any round in which you take a move action to move 10 or more feet, you gain a +2 bonus on weapon attack rolls until the start of your next turn. While using this style, you gain the AC bonus feats from Mobility against attacks of opportunity provoked by making a ranged attack or loading a ranged weapon." ],
				"Special": [ "A character with the armor training class feature can use Spring-Heeled Style while wearing any type of armor with which she is proficient." ]
			}
		]
	}
}